[
  [
    "University of California Berkeley",
    "Puckett, Kent",
    49,
    [
      "Simply brilliant. Definitely incorporates a good amount of literary theory into his lectures, which are utterly mind-boggling in the best way possible. Don't know much about him as a mentor, but as a lecturer he's FANTASTIC.",
      "His lecture is inspiring. Although there are assigned six novels during the semester, they are quite heavy (of course this is about 19th British Lit class). Professor Puckett is nice and kind outside of the class. There are 3 papers and one home-take exam. He offers the prompts for them, but does not force the students to follow strictly them.",
      "This guy is a master at giving lectures!",
      "Professor Puckett is fantastic.",
      "One of the Department's finest. An engaging, creative lecturer who has high expectations but who makes every effort to support his students. While his reading list is lengthy, everything he assigns is a work of importance and his lectures are surpassing textual and historical analysis. Papers and exam were graded fairly, but depends on the GSI.",
      "Puckett is awesome. English Lit can get redundant after a while and he had interesting ideas and made us really think about new ideas. Always willing to talk. I only went to office hours twice but he was extraordinarily helpful both times. Papers are GSI graded but he will work with you on them. Definitely take him.",
      "Pucket is an amazing professor who gives the wackiest ideas and makes them work! Lectures are interesting, so interesting that they carry on to the next class we were behind the entire semester. 2 papers and a final, which sound like a sinch, however depends on gsi and mine was horrible, thus it wasn't easy. Be choosy with GSI's!",
      "Lectures are interesting, but he doesn't allow enough time for how much he wants to say so syllabus changes a few times. His ideas flow between the books and lectures have a unified quality. Essays are typical.",
      "Puckett is the not only the best Prof I've had, but also one of my most respected and trusted people--I've learned more in one semester from his lectures& his person than I did in years of highschool. Brilliant lectures that leaves you speechless, he is the repertoire of endless knowledge. Super kind & caring, so affable. It was a great honor.",
      "Don't miss taking a class with Puckett!! I had him for 45B and 121 and even though the subject material wasn't my focus he made it both enlightening and interesting! Definitely one of the best professors at Cal - interesting, clear, so helpful and nice during office hours, and funny too!",
      "Professor Puckett has been awarded the 2011 Distinguished Teaching Award which is more than deserved!! I am a senior English major and Professor Puckett is my favorite professor at Cal. I have been in Puckett's Eng 45B, Eng 190, and Eng 125B classes and have always found his lectures intriguing and look forward to going to his classes.",
      "He's a very intriguing lecturer, and immensely dedicated to his students, especially in Office Hours. But he is not easy. The reading load is literally impossible, unless one neglects other classes. I have yet to receive a paper back, but for this class, they are GSI-graded anyway. Overall I recommend him, but be sure to balance your schedule with classes that have less reading.",
      "Puckett is definitely my favorite professor at Cal. He is the most helpful professor I've had, he is extremely modest and very easy to talk to. He makes you feel like any idea no matter how small or stupid, gives way to a nugget of genius. Office hours are priceless with this man. Great sense of humor and cute as a button.",
      "Kent Puckett is awesome. I love this man. Extremely knowledgeable, always had a long list articles and book chapters specifically on whatever topic I was interested in, all of which were outside the field of literature. Supportive, friendly, has great taste in music. He's also in a band with his sister. If you don't know, now you know.",
      "The man is intellectually generous. He helps students build up their own ideas without pushing the student to accept his own. He assigns a lot of reading, but EVERYTHING he asked me to read was completely applicable to EVERYTHING I'm interested in.",
      "Puckett is a great Professor! He makes the material very interesting and approachable and his jokes make lecture fun. My only complanit is that I wish his lectures were more concrete and structured (through some sort of powerpoint or presentation). Other than that though, great class. Oh, and Puckett is definitely not bad to look at either.",
      "Very inspiring, very helpful, and he leads a seminar well. He can fall a little behind on the syllabus and returning papers, but all the superlatives attached to his person eclipse that small fault. Not to mention he is very cute, husband material if fact, if he doesn't already belong to some lucky person.",
      "Puckett is the type of guy who will make something that seemed incredibly boring sound amazing! I thought that the Auto of Ben Franklin and Robinson Crusoe would be boring but he brings in very interesting insights. He will always ALWAYS make you think about something new. There's a lot of reading but its so worth it to hear him lecture. Great dude",
      "One of the single most helpful professors that I've ever had!",
      "A ton of reading, but great lectures. He's brilliant and enthusiastic- I really enjoyed taking his class.",
      "Cool guy, and charming and funny. Has a great knack for transforming lame student statements into something fascinating- in that sense he's so helpful. Overall one of just the coolest profs I've had. Beautiful eyes too.",
      "Kent is one of those professors everyone would love to have and take a class from. He is a true specialist in his field, fun and approachable. Take note: Kent assigns a fair amount of reading, so if you are not into that...need I say more&#63; But for those of us that enjoy reading, Kent makes very dense material accessible and is totally helpful.",
      "The course I took was a survey of Victorian lit, not at first appealing. But Puckett changed my life - literally. I relate all my studies of literature to what I learned in this class. Victorian literature is so so so amazing, and Puckett is an incredible lecturer. Very helpful in office hours. I would take this class every semester if i could.",
      "Professor Puckett is witty, charming, and brilliant. I've really enjoyed his class, and plan on working with him next semester on my senior thesis whether or not I get into one of his classes. The connections he makes between the texts and life in general are very illuminating. Exams are very fair. Plus he's absolutely adorable.;-)",
      "Puckett made literary theory accessible. His lectures were focused and often infused with his great sense of humor. He's also very approachable and genial during office hours or when you run into him on campus.",
      "This class was really interesting...I had trouble understanding a lot of it, but what I did get was brilliant. Puckett made me laugh several times each lecture..He's definitely not boring. And nice to look at even if Literary Theory doesn't strike your fancy. He's also one of the nicest professors I've had at Berkeley. I love him! Take him!",
      "Excellent lecturer, enthusiastically nerdy, often gives hilarious examples related to whatever he's talking about for class. Incredibly helpful during office hours, but prepare for long lines during Telebears times because he's also a major adviser for English. Easy-going but the material can be difficult. Is somewhat obsessed with saying &quot;right&#63;&quot;.",
      "THE GREATEST! The &quot;Intro To Critical Theory&quot; class I took was one of the best classes I have taken in my six year college career. Makes you re-examine soo many things that you take for granted. This is social criticism. Very difficult reading, Very worthwhile. Take this class! Love this Professor!",
      "I agree: original ideas, organized lectures, material flows easily from one text to the next, funny, actually nice in OH...but still, not blown away. Lectures, although interesting, not really helpful, lots of really cretive critiques which get a bit mundane after awhile. Seems like the kind of guy that would be fun to meet a bar.",
      "Great professor, extremely interesting lectures. Brings new insight into old material. Not too hard on the eyes.",
      "very approachable and very understanding! the material is very managable and is organized in a great fashion! he's great!",
      "Prof. Puckett is brilliant and one of Cal's best professor's by far, in my opinion. His lectures for 45b were clearly composed, organized, and comprehensive. He is a careful listener and very original thinker during Seminar discussions. Expect a long line during OH. Only complaint was a GSI I had for 45B Section who made many students miserable.",
      "I wasn't blown away by Professor Puckett, but he was certainly competent and consistent. Lectures sometimes got pretty boring, but overall he was decent. The midterm was very easy, but the papers are HARD!",
      "Kent Puckett's a really nice, intelligent guy. He's younger too, so he relates the material to the college-aged masses so it's not your average dry, boring literary lecture. I highly recommend his course... you'll laugh at least once a day during his class.",
      "Made even the most boring Victorian Era literature semi-interesting. Puckett is an interesting lecturer and tries hard to involve the class in the lecture material at hand.",
      "Better be a fast note taker to keep up with Kent. But what he says it brilliant. I'd think about a tape recorder. Takes questions even in lecture classes. If you really want to learn, take his classes. Really knows his 19th century.",
      "Oh my, i could listen to him talk for days. He has helped me completely understand (and want to keep reading) 18-19th century literature. To top it off, he has a great sense of humor.",
      "An amazing professor. I've never had a lecturer like him, truly an experience.",
      "Wow, he is so incredibly nice and understanding! His lectures are enjoyable to listen to, too, but he's also very easy on the eyes :D",
      "Unlike many Berkeley English professors Kent Puckett is never difficult for the sake of being difficult. He is certainly challenging, but always in an engaging and pertinent manner. And kind, Oh so kind. A wonderful rarity in academia. A true asset to the department, and to the students who encounter him.",
      "An incredibly good lecturer -- super clear, makes perfect sense, yet still fascinating even while discussing the most obscure subjects. Even when talking about Freud's strange theories he is still not confusing! Sheds so much light on the texts. Jaw-droppingly nice and understanding. The best professor I've ever had in my life.",
      "holy hotness",
      "No Comments",
      "Very laid back. Doesn't make you feel foolish if you say something lame. Easy to talk to in office hours and when you go for advising. Helpful. Handsome.",
      "Very smart, great lecturer (though he tends to spend too much time answering dumb questions in class). Very helpful in office hours, and a nice guy, too.",
      "He's very intelligent and often witty. His lectures are pretty helpful. He's really friendly and approachable in class and in office hours."
    ]
  ],
  [
    "Columbia University",
    "Conti, P",
    24,
    [
      "PC warned us that we were gonna miss him. He's correct.",
      "Great semester.",
      "Gets us to think deeper and write better.",
      "He taught me a lot.",
      "The most hilarious prof I've ever encountered. Extremely learned even though he plays against it.",
      "One of the good guys.",
      "Good job as PC says.",
      "Great. Very well-read and informed. Brings a global perspective to his class which most Americans do not.",
      "He's one of the best I had at CU. funny and compassionate.",
      "Scared me at first. He's a hip hop and martial arts expert. It turns out that he's caring and compassionate but obviously not a pushover. As it states on hi syllabus: come strong or don't come at all.",
      "I miss the coolest prof ever.",
      "He's reminded me of one of the kids in high school who everyone wanted to hang out with. Our classes flew by. I wish he would have lectured more because he seems like he has a lot of useful information about pedagogy and life in general.",
      "I think everyone at CU has a crush on him. More of a gansta than a prof but he's smart even if he doesn't seem it.",
      "I thought I was going to hate his class; in the end I loved it. The man is cool, cocky, and a true nonconformist but at the end of the day, he cares about all of us.",
      "It was like being at a comedy club every week. Why isn't this guy on tv?",
      "Definitely teaches out of the box. But he's a welcome change from the stringent political correctness that sometimes stifles us here. And he's a hellava writer.",
      "Great!!!!",
      "Dude's my dude. Doesn't fit in here; doesn't want to. Irreverent humor. Lots of knowledge. Lacks patience sometimes.",
      "Conti is not your typical professor. He's young, he acts young. I think he misses being a student. The tats, muscles, and New York attitude can be a bit intimidating but once he sees you work hard he'll go all out for you. Just don't be late or defend texting... Its a no-win situation!!",
      "great guy. down t earth, really cares.",
      "PC is hot and funny and practices what he preaches. That is, he writes well (read his novel) and he is a workaholic. you'll have to be too if you want an A in his class. Don't let the tats and Brooklyn accent fool you, he's a softy",
      "He took over midway through the course and blew away the other professor. He makes the boring stuff interesting. I highly recommend him. And he's hot!!!",
      "great course. Funny and intelligent.",
      "Good guy, albeit a bit unconventional in his approach to writing."
    ]
  ],
  [
    "Stanford University",
    "Skinner, Marcus",
    13,
    [
      "His novel totally captured what it's like to be a teenager.",
      "Mr. Skinner is an amazing instructor. His lessons extend beyond the classroom environment. Mr. Skinner fo' Life",
      "Really great guy.",
      "He is absolutely awesome. Pay him more money!",
      "he is amazing. his book made me become a writer. thank you Mr. Skinner.",
      "Great Professor! He changed my life.",
      "Great teacher. Very well spoken. Knowledge of books is astounding. One of the greatest writers of our time. He has inspired millions to become writers, including myself.",
      "Brilliant. Absolutely brilliant",
      "No Comments",
      "No Comments"
    ]
  ],
  [
    "Harvard University",
    "Mukherjee, Sri",
    37,
    [
      "Amazing! Best professor I have ever had!",
      "Great with feedback! I love when professors take the time to examine the work us students put in, and actually help. Both a great educator as well as a facilitator! Thank you, Sri!",
      "Sri's method is not very productive for some, but extremely effective for others (like me). She gives extensive written feedback and pays very careful attention to your writing. I came into expos knowing I was going to suffer (not a fan of writing), but Sri made it much more manageable. I learned so much with her that I started even enjoying it!",
      "Sri is a superb Expos preceptor who truly cares about her students' academic and scholarly growth. She teaches a rigorous and demanding curriculum that requires students to formulate compelling papers with well structured and progressive ideas, and she is effective. Most of all, her feedback on student work is impeccable and enormously thorough.",
      "Dr. Mukherjee is one of the best instructors at Harvard. Her teaching was largely responsible for bringing my academic writing skills up to a whole new level. Her instruction combines peer analysis, class discussion, and lectures, couched in a literary context, and her feedback on our writing was meticulous and enormously helpful.",
      "Sri was one of the most helpful and instructive professors I've ever had. I learned to craft arguable, sophisticated theses & support my essays with a complex progression of ideas. I also greatly improved my critical thinking and analysis skills. She was not only skilled but passionate about her field, inspiring me to pursue the humanities!",
      "Sri's selection and analysis of sample essays that applied \"complicateextendcounter\" moves to the authors' ideas really helped me with synthesizing how multiple texts spoke to one another instead of simply reading a source in isolation and laying out what the author's argument was.",
      "Dr. Mukherjee's class was immensely helpful in honing my skills as a writer. Prior to Expos 20.066, I frequently got away with writing \"flowery\" essays filled with SAT words. That doesn't cut it for Dr. Mukherjee. This isn't a highscool writing class. Dr. Mukherjee, always willing to help but never willing to handhold, is a superb expos preceptor.",
      "Sri is an exceptionally talented instructor. Sri is aware that new concepts she presents take time to implement and gives thorough explanations on how to effectively support & advance arguments. I appreciate her clear expectations, both verbal and written, and her thoughtful feedback. I’m a different reader, writer, and thinker after this course.",
      "Sri Mukherjee is one of Harvard's gems. She is not only lucid in her manner of conveying key ideas, but also genuinely cares about her students' success. She met with me several times outside of class and provided extensive feedback on my work. Two years later, her writing strategies continue to be essential tools in my academic writing at Harvard.",
      "Sri Mukherjee is a highly intelligent and very talented teacher. Most college freshman do not have high school English experiences that prepare them for college level writing. Professor Mukherjee helped me to make this transition smoothly. She helps you to advance your essay and writing using methods applicable and useful in all college writing.",
      "On 5/12/11, I submitted a rating on ratemyprofessors.com. Much to my dismay, I realized that I gave Professor Mukherjee 1's in Helpfulness and Clarity, when my intent was to give her the HIGHEST ratings (This is VERY clear in my comment section). Consequently, I registered to ratemyprofessors.com to modify my error. She is one of Harvard's best!",
      "Sri is an brilliant and engaging professor who teaches students to create strong academic arguments and guides students in the transition to scholarly writing. Her class and feedback is focused on ideas and skills rather than mechanics, which allows students to apply her revisions to all of their papers rather than just her assignments.",
      "Sri is an incredibly engaging professor. She guides students to arrive at their own ideas and is very knowledgeable about cultural interactions. Her class is very much idea driven, and her feedback on papers focuses on writing skills rather than the prompt, which allows students to grow into their own style as they progress from paper to paper.",
      "Sri is a very personal professor.She works with your strengths and identifies and resolves your weaknesses.She guides students rather than being authoritative, and allows us to grow as opposed to being forced in a particular direction.Her attention to detail is excellent and the amount of individual attention she gives each student is unparalleled.",
      "I have just completed my writing course in Harvard summer school with Dr. Mukherjee. She is resourceful, amiable and eager to offer help outside the classroom. The course is fantastic and I have learned the essence of college academic writing through this fast-paced course. Thank you so much, Dr. Mukherjee and I hope to work with you in the future.",
      "completed 2nd week (12 hours)of summer expos 20 & just finished first one on one conference. prof is very challenging & engaging (plus cute). wish had similar conferences in my other course, really helpful",
      "Before Expos, I couldn?t even use a comma; bouncing between inner-city schools had avoided me writing an essay. Dr. M is not only clear, thorough(applying all concepts beyond Expos),and engaging, but dedicated. She constantly worked with me, even when off. Her dedication literally caught me up to a college writing level: by far my best teacher yet.",
      "Sri was an absolutely fanstastic teacher. Her instruction was precise and clear. Assignments were challenging, but we never lacked direction. Help was always available. I left the class feeling that I was a far better writer than when I'd started.",
      "Sri is a superb teacher on all accounts. She adeptly factilitated class sessions to engage all students in rich discussions that continually challenged and expanded our understanding of course materials. Her thoughtful, thorough critiques of our work reflected her passion for teaching and her strong interest in students' growth.",
      "Professor provides excellent guidance and support, offering constructive advice and working to enhance students reading and writing abilities. Classes are engaging and insightful, and selected texts are interesting and exciting to work with.",
      "This class was essential to my development as writer. I went from producing high school, descriptive 5-paragraph &quot;lists&quot; to engaging in scholarly conversations with critics and authors. I'm sure that the skills I've acquired will be invaluable not only as a student, but also in my scientific career. I recommend this section very much!",
      "This class was essential to my development as writer. I went from producing high school, descriptive 5-paragraph &quot;lists&quot; to engaging in scholarly conversations with critics and authors. I'm sure that the skills I've acquired will be invaluable not only as a student, but also in my scientific career. I recommend this section with great enthusiasm!",
      "Excellent feedback on all drafts and papers. Encourages class participation and chooses novels that stimulate interesting discussions about socio-cultural themes. Challenged and helped me to become a more effective and persuasive writer.",
      "In expos, class discussions were dynamic, as Prof Mukherjee made the effort to draw everyone into the discussion. One of the best aspects of the class was the feedback. The feedback was often, thorough, and honest, both helping to point me in the right direction and helping me to significantly improve and layer/complicate my arguments.",
      "Dr. Mukherjee was accessible outside of class and gave helpful feedback and comments. Her instructions are pretty clear to follow. The class is demanding but you learn a lot about college-level writing. The books and stories are mostly interesting.",
      "Professor Mukherjee was a very nice, always made herself available, and was encouraging, but also honest. Her feedback was very beneficial and I strongly believe helped me improve my writing as she challenged me to always search for deeper significance and consider alternative perspectives. All grading and assignments were very fair.",
      "Writing conferences were extremely helpful - the professor came extremely prepared and I always left with strong, constructive feedback that made revising my essays painless and even exciting. Books and short stories read were stimulating and facilitated strong seminar discussion.",
      "Dr. Mukherjee gives great individual guidance. Her feedback really helped me develop as a writer, and she was very helpful throughout the entire editing process. Initially you may be in for a shock because college writing and high school writing really is very different, but it gets better once you understand what is expected.",
      "Dr. Mukheree is a great teacher, but also sets her expectations high for her students. She is very helpful during individual conferences and her feedback is always valuable. Her critiques helped move my writing in the right direction and her high expectations really pushed us. Class becomes more enjoyable as the semester wears on.",
      "Dr. Mukherjee is a fabulous teacher. Her comments and suggestions helped strengthen my writing skills and ability to analyze literature. She conducted class in a very engaging manner, and always made us think deeper and in different ways. I am extremely happy that I took Dr. Mukherjee's course and I would recommend it to all!",
      "Professor Mukherjee's class Expository Writing 20: The Outsider is a very helpful introduction to college-level academic writing. Excellent literary and cinematic materials chosen to support a clear central theme make it a very interesting course in its own right, and Prof. Mukherjee is consistently thorough and helpful in her feedback to students.",
      "This was the most beneficial writing class I've ever taken. Not only will Prof. Mukherjee sharpen your writing, but her class encourages you to take your critical analysis skills to the next level through all kinds of texts/genres. I think whatever it is you study, this class will make a lasting impression on your writing abilities.",
      "Dr. M was an extremely good professor. Her class is an excellent transition from high school to college writing.Class discussions are vital, so be engaged. Expect to spend a lot of time revising drafts. Even if the first draft is not great, you can really clean it up after workshoping it and talking with Dr.M about it in conference.",
      "Like many of us with very high AP English scores, I came to Expos in the Fall with an attitude. Yet Dr. M's amazing (& amazingly underplayed) brilliance made it a humbling experience. She's a dynamic teacher who'll subtly but surely open your eyes to the complexities of college writing (& trust me, you don't know nothin' yet).",
      "Dr. Mukherjee is a great professor. While her teaching methods are more formal, she is a warm person and very willing to help a student in need. Her assigned readings are reasonable, and her assignments challenging. She will take your writing to the next level- especially through her level of expectations, helpful conferences, and comments."
    ]
  ],
  [
    "Yale University",
    "Bloom, Harold",
    13,
    [
      "I took a class from professor Bloom about 5 years ago. professor bloom knows a lot and can give a great lecture. I thought to myself all this material is free at the public library/ the public internet/web. Paper /Pencil. Internet /web. what I wanted was to be a great writer or creative writing. Pencil /Paper. Internet /web /facebook. All we need.",
      "He is incredibly knowledgeable and experienced in his field, and students can hear some great thoughts and interpretations on pieces. However, he does tend to get off subject; sometimes for 10 minutes, sometimes for 30. Either way, you still get great knowledge about the subject. Being graded only on the term paper is a great thing too.",
      "An incredible lecturer, and wonderful one on one if you have any questions concerning the final paper or anything under the poetic sun. Each lecture more interesting than the last -- Prof. Bloom can recite much of the poems and plays covered by heart, and has dedicated his life to teaching them in his own distinct (but great) way.",
      "The unthinkingness of school makes his class look absurd. You have to read to understand him, and school generally precludes reading with busywork. The implication is, if one wants to be the greatest student he ever had, one has to have no priorities other than literature. Flunk out of Yale first, then go to his class.",
      "He is a bear. He roars and challenges. &quot;Squeeze lemon and throw out pulp if you disagree with me.&quot; He knows that he is a literary star so he doesn't hide fact you should respect him. He loves literature and examining man and God and Freud. He does want us to learn how to see things through a different lense. Suprisingly warm and supportive one/one",
      "Talk about MAN unlimited. Where shall wisdom be found&#63; Right here. I used to like T.S. Eliot, but then Dr. Bloom showed me how ignorant I was. But that's OK. His influence causes no anxiety here.",
      "Bloom is da bomb"
    ]
  ],
  [
    "New York University",
    "Rectenwald, Michael",
    107,
    [
      "Professor Rectenwald was by far my favorite teacher of my first semester at NYU. He inspired my fellow classmates and myself to think outside of the box. His grading criteria is explained and extremely fair. He is very understanding and in the end wants each student to learn. Love him and glad to have him again next semester.",
      "Professor Rec is such an Angel. Always hold class on Google handout when you don't want to go to class. TAKE HIM IF YOU WANT TO HAVE CLASS ON THE INTERNET. Just turn off the camera and microphone and enjoy his smile. Homework is basically some interesting readings and it's fine if you don't read them at all.",
      "Dr. Rec is truly an amazing prof. I've never had another teacher who meets with each student individually and gives line by line feedback on their essays before they're due. Most of my profs won't even read my essays let alone give feedback. I feel like my writing did genuinely improve under his instruction.",
      "If you're thinking of the MCC major take him! Great dude, super intelligent but sort of crazy. He does class online via google hangouts sometimes. I loved the readings but they can be long and difficult. A blog is due every couple of weeks, theres about 4-5 papers but he allows you to meet with him and he will give you feedback and he's easy grader",
      "Very rigorous, and even more engaging. Highly sympathetic to personal issues, great guy all around. Always the most interesting and carefully chosen material to read and write about, and he manages to sprinkle humor into our discussions. Never mind being the best professor in LS, Rectenwald might be the best prof. at NYU.",
      "Extremely rewarding writing class that has changed my entire academic career. Would not have made it w/o mike",
      "Dr. Rec is without a doubt one of my favorite professors at NYU. Even if you disagree with his views (Like most of the class) you simply must admire him for being so understanding and helpful. He is flexible, gives out extensions, and his focus is teaching how technology has affected our society, with many dense, but enlightening readings. Worth it",
      "Dr. Rec is a great professor. He cares about his students, is always available to give feedback, and is very lenient about deadlines and grading. You don't necessarily have to come to class, but I would because I would leave mind-blown pretty often. Not your conventional writing class, but I liked that a lot.",
      "Dr. Rectenwald will physically edit your first drafts with you and he is very caring towards his students. He has pretty lenient deadlines. He's a great writing professor because he encourages you to open your mind about modern topics. His grading is pretty easygoing and he doesn't give below a B plus if you try. Take him. He is awesome. .",
      "This guy is brave, inspirational, and honest. So many professors have adopted a singular idea and are unwilling to speak their mind. Rechtenwald is different. I encourage anyone who values critical thinking to study under him.",
      "LOVE HIM! Take him if you have the chance to! He's a really inspiring professor especially for writing. The topic for essays is basically technology. He loves technology and everything is electronic (except text book). Dont really have to work if you really dont want to, but I highly recommend to take his class seriously because its really helpful",
      "DrRec is the reason I signed up for Rate My Professors because I really love him as my writing professor. He is a mad genius type of person and teaches a lot other than writing skills. He once reproduced the class for me because I missed the class. He's very responsible and definitely knows perfectly about what he's teaching.",
      "Dr. Rec is fantastic. Know that he focuses on 'academic writing'- contemparary topics opposed to creative writing (this actually helps a lot for other classes). If not doing poetry like some of your friends are is okay with you, he's an unregretable choice. Manageable and clear workload. If you do what he asks and try, you'll get a great grade too",
      "Simply put, Rec is a genius, and onto something, just does not necessarily know how to make it more difficult. Does not make him a bad professor, actually he's amazing, but his class is definitely not the hardest Ive ever taken...",
      "Professor Rectenwald is the coolest writing instructor I've ever met!",
      "This professor was very kind throughout the entire semester, he was very clear about expectations. The class was not easy, but was very interesting. The professor only choice topics that he knew would interest students, and students opinions were more than welcomed. I would recommend that anyone considering taking Writing 1 take this class.",
      "Professor Rectenwald and his course are absolutely amazing. You read about engaging and modern topics which make you think hard and want to dig deeper. Our \"roundtable\" in-class discussions are open and stimulating. Writing assignments require thought and allow much freedom of content. By far the best prof and course I've ever had. TAKE HIM.",
      "Dr. Rectenwald introduced a lot of information about modern life dealing with technology which taught me a lot and was a nice break from all the ancient text common in the other freshman required courses. You have to do the homework and reading to understand and pass the class but it was worth it cause the material was actually interesting.",
      "Best professor at NYU, bar none.",
      "Professor Rectenwald is a great professor that if you pay attention in class, and do the necessary assignments with a good amount of effort, you WILL get an A. He is very reasonable. Although it did take some time for the assignments to be returned, I wouldn't get to upset about it. After all, professors have their own lives too. I would recommend!",
      "Dr. Rectenwald is smart, knowledgeable, and funny. Also, it doesn't hurt that the professor is a major scholar in his field. Students who didn't learn anything must have been sleeping themselves!",
      "Dr. Rec is a phenomenal professor. Not only is he EXTREMELY intelligent and well rounded in not only material for the course, but in so many worldly topics as well, he is very funny and makes his lectures super interesting. I would recommend his class to everyone who can take him. Dr. Rec is also very, very fair - which is so rare!",
      "Show up, listen, participate, pass. Nothing much more than that. Easy class, nice teacher, extremely nice in most cases. Lectures, not so interesting, but the required reading was GREAT. Would have liked some more clear and precise lectures on the incredible novel Hard Times (I loved it) and Frankenstein, but you take what you can get.",
      "Dr. Rec is absolutely delightful. He's a very busy guy but he always finds time to help students out. I email him often about questions on assignments and he replies very quickly. Lectures are usually casual but the way he presents the material really makes the information stick in your mind. Overall awesome guy- will miss him!",
      "He is an amazing professor. I would take him again if I could. Clear and fair. You can't fail if you just go to class. He is not like most professors who drill you about grades. He truly wants you to take something, or anything from the class. Open to all opinions and is not shy about sharing his own. Great man, great class!",
      "I wanted a class that was not too demanding to add to my rigorous premed schedule, but not pointless either for my education. Rectenwald provided me with just that. Extremely understanding, nice, and well-educated man. 5 2 paragraph essays, group presentation and a take home final consisting of essays only, no memorization of pointless material.",
      "50% of your grade is from 5 1-2 responses on the readings-with these you have the ability to write about whatever you want to relating to the text, which makes it more interesting, and he's a very fair grader on them-there's also a group presentation and a take home final-overall he was a very interesting and good professor",
      "Interesting man. I've never had a professor with an interest in secularism. He seems to have a lot on his plate most of the time, but is very accommodating to student needs! He isn't the toughest nor easiest professor out there, but his lectures are a must attend since topics you write about in your essay and final are discussed.",
      "As much as I hate all the LS classes, professor Rectenwald's class is really easy. The materials might not be interesting but do spend some time reading the assigned readings. The man himself is relaxed about class discussions, he won't disregard any comments you make, so participate.",
      "Discussion based class and did 5 blog posts with 3 essays in the semester. He is really helpful, especially with his conferences. Will read over and discuss your essay in great detail with you and gives such great advice! Very helpful.",
      "Very discussion based class. Weekly blog posts based on readings, three papers due over course of the semester. His comments on your papers are extensive, but he will often tell you exactly what he wants said. Put that down verbatim and he'll be super impressed with your \"writing ability\". Pretty much everyone gets an A in the end.",
      "His classes will change the way you look at things, the way you see the society. He will twist your mind through reading and discussions on post-structulism, modernism, deconstruction. I took his writing class and I highly recommend it to people who want to learn new things/perspectives. Awesome and mind-boggling classes :D",
      "Rectenwald is the best professor in the LS program. He takes his class seriously without taking himself too seriously. He is very well-read and articulate. Class discussion is open and relaxed, you won't have much trouble participating. He is not a hard grader. He can be pretty funny too. Take him!",
      "Loved him. Attendance is not mandatory, teaches well, you have to write blogposts but he doesn't check them until the end of term. Papers are easy to write. No participation is necessary",
      "extremely helpful, limited coursework, midterms and finals are essay. you will learn what you want to take from the class. the explanation is thorough but then again participation is crucial if you want to take anything away from the course.",
      "Dr. Rec is a true academic, extremely passionate about his subject, and very funny. His assignments are slightly vague, but he's super helpful and encouraging when you have questions. Class discussions are crucial. A fair grader. Two papers, 5 blogs, one group presentation. Focus is mainly on literature and philosophy.",
      "He is laid back, doesn't call on people, and gives fair grades (slightly easy grader). About 4 blog posts for HW, 1 midterm paper, and 1 final paper. Almost all texts are scanned or online. Take notes during class (very helpful for me), follow his instructions/grading guidelines, and you will do well. Take him!!",
      "The subject matters in this class are so convoluted. You will have no idea what's going on in class most of the time. But the writing assignments are actually fun and his cirriculum is very technology-focused.",
      "Dr. Rec himself is very nice and funny, helpful and understanding. The class is challenging, but you will really learn a lot and become a better writer and reader. Definitely sign up for this class, the readings are fascinating and the discussions are illuminating. Don't worry if you don't understand the reading, everything becomes clear in class!",
      "Dr. Rec is great. He is also a great writer, as you can see by the many reviews of himself he has written on here."
    ]
  ],
  [
    "Princeton University",
    "Wolff, Tamsen",
    14,
    [
      "Best lectures of my life. This class--Contemporary Drama--is amazing.",
      "TAMSEN IS A GENIUS",
      "Amazing. Professor Wolff brings up great points and completely engages the class. She's quirky and funny and her lectures are incredible. I had heard she was brilliant but terrifying, but she's just brilliant. She's a serious grader, but totally fair.",
      "I had her for contemporary drama and I loved every minute of it (okay maybe one or two of the plays I could have done without, but they were all included for a reason). She's fantastic. Her lectures are smart and funny, and my writing really improved with her help. I loved this class.",
      "Take a class with her! I liked her so much, I asked her to be my advisor. She's amazing.",
      "I can't say enough good things about Tamsen. I was excited to come to every class. In fact I don't think anyone was absent all semester. I learned so much, not just about contemporary plays but about theatre and how it works and about writing. Tamsen is tough but fair, she's hilarious and she's really helpful. One of the best classes I've taken.",
      "If you don't fall in love with plays (or her) you're crazy.",
      "Hands down, the single best professor I encountered during all four years of college.",
      "wonderful class, really fun prof. she knows an amazing amount of stuff about theater",
      "cool young hip",
      "No Comments"
    ]
  ],
  [
    "University of Toronto",
    "Mount, Nick",
    23,
    [
      "Amazing lecturer!",
      "Amazing lectures and a great personality. He made me get into poetry. The things he taught me in first year helped me make connections with second year's English courses",
      "Best professor I've had throughout my entire university career. So inspiring and genuine. So open and restful. If you ever have the chance to take a class with him, do it.",
      "Nick Mount is incredibly passionate and very well informed about poetry and the understanding of the poet and what makes him tick. he is absolutely the best at what he does..",
      "Nick Mount is an outstanding professor. I found myself attending his office hours just to have a chance to speak to him in person. He was always so friendly and kind. But more importantly- he has a true passion for the material and thsi is conveyed vividly in his lectures. Highly recommended.",
      "Great guy, great prof. Take this course, if you can manage to get in!",
      "Amazing, amazing professor. He is truly engaging and thought provoking. Very funny and creates a great atmosphere. His class was the best part of my week, by far. I would honestly recommend his lecture to anyone.",
      "Incredible professor. By far one of the best lecturers at U of T, if not the best. Passionate about his work and always engaging. You need to take his class. Seriously.",
      "Amazing Professor, I love this class!",
      "One of the best professors at U of T.",
      "Amazing!",
      "Nick Mount is a brilliant man and an awe-inspring professor. Forever humble and open to all ideas, Mount is able to create a very welcoming and accepting environment which not only breeds thought, but demands it. Dry humour peppers his engaging lectures as he weaves his way in and out. Cannot recommend him highly enough.",
      "An articulate master of English. Light comedy, but his reading list can be questionable at times. Highly advisable to take the night class; it has a much looser atmosphere.",
      "An amazing professor. Such a good speaker and overall nice guy.",
      "Great Personality",
      "Nick Mount is one heck of an inspiring man. He's brilliant, but unassuming, always giving students credit for thinking of something he already knows.",
      "Amazing professor, one of the best at U of T. Very approachable, very relaxed teaching style. Reassuring and extremely organized.",
      ".",
      "No Comments",
      "The best prof ever, even though the grading was a bit severe (in my opinion).",
      "No Comments",
      "awesome professor, very engaging."
    ]
  ],
  [
    "McGill University",
    "Nystrom, Derek",
    93,
    [
      "Nystrom is a really kind and lovely man. He cares about his students and puts effort into giving good lectures. Jokes around in class. He gives great feedback on papers and pushes students to the best of their ability. I love this prof!",
      "Derek is like the best prof at McGill, and is so much more kind, empathetic, and pragmatic than a lot of his colleagues. This class was super hard and he likes a really specific kind of jargon-y, academic writing, so the papers were hard for me to do well on. He is, however, super helpful in office hours. Actually the nicest man i have ever met.",
      "Derek is one of the nicest, best profs at McGill, and definitely the best in the English department. He's definitely a hard marker and likes really academic papers, but is helpful during office hours. He's also incredibly empathetic and kind, and is willing to make jokes and laugh and poke fun at the absurdity of his profession and McGill itself.",
      "GREAT GREAT GREAT prof! The papers are specific in terms of what he's looking for. He doesn't give out As easily, but if you love pop culture, you'll enjoy this class! I never wanted to skip this class because of him! And I'll definitely try to do a higher level course with Derek again.",
      "So here's the thing, Derek is an amazing professor and is someone who gives very interesting lectures BUT the actual course material can be inexplicably hard. A lot of it is comprised of convoluted and overly complicated theory. His lectures focus on explaining the dense and long readings, so don't miss any class or you'll be super lost.",
      "My best prof this semester. be ready to read a lot and work, but prof. Nystrom is always available for help which is very much appreciated. He's very funny and make theoretical things clear!",
      "Cool professor for a cool class. For an intro course it was definitely not easy, and there was quite a bit of reading at times, but 100% worth taking if you're interested in the topic. Grading is critical but it helped with my essay writing",
      "Nystrom is inarguably the most respected and eminent professor in the English department and for good reason. If anybody was to take a course from the English department, I highly recommend to take a class with Nystrom. The material is by no means easy, you have to really be engaged and passionate. This prof is a highlight of my career at McGill.",
      "Professor Nystrom was an amazing prof! Even if you dont do the readings, he is able to describe exactly what the authors are saying and what it is important to understand. Super fun to be in class with, i never found myself staring at my watch. This class is a must take!",
      "great lecturer - very passionate. if you email him with any concerns he's super accommodating. he's also insanely attractive.",
      "Great prof. Extremely clear about everything, really helpful during class and office hours, and actually interested in student feedback. Also just a generally cool person.",
      "I took 4 classes with Nystrom during my undergrad and I gotta say I kind of miss the guy. Brilliant prof & an all around truly rad person. He is the only Cultural Studies prof that I eeeever witnessed show support, respect and encouragement towards his students. His classes were the reason that I was able to stick with it and graduate. 1010",
      "Prof Nystrom is AMAZING. The man knows how to lecture and teach. Organization is there throughout the course, and it proved to facilitate the learning process greatly. I went to see him for my papers, and he gave the necessary feedback. Show up for class, take solid notes, do most of the reading (I had 12 left) and you'll get an A.",
      "Awesome prof and super cool assignments. I got screwed over by the TA's. But if you go see him he is willing to talk with you (despite the fact that he says to talk to the TA's first). Final exam was doable. Do the readings! Some of them suck, but class will be so much easier to understand.",
      "Simply the best",
      "Love him. Attend Classes.",
      "Nystrom is one of my favorite profs I've ever had at McGill. He gives great lectures and is always prepared. He is super informed and a hard worker himself. He is very clear in his lectures and in his expectations. He IS a hard marker but if you follow his guidelines and put in effort, you can definitely get an A.",
      "had lots of classes w him. sure, i think he's a total babe, but only cause he knows his stuff, and goes out of his way for his students all the time. sometimes a little heavy on the jargony, absurdly esoteric theory, but if you can stomach that bullcrap (and if you're in cultural studies, you should be able to), he's totally worth taking.",
      "Truly fantastic prof. Lectures were clear and well thought out, def recommend!!!",
      "Such a great prof, also not bad to look at. So interesting and really nice to talk to, was really helpful and gave incredibly interesting lectures with no midterm, such a great class would RECOMMEND HIGHLY!",
      "really enjoyed his class. very clear, interesting and funny lectures. assignments are super clearly outlined. not sure about his grading because it was all done by TAs who were extremely hard markers, so it depends on who you get. he gives you the final exam questions ahead of time to prepare. i'd recommend taking him!",
      "I liked Nystrom. His teaching was clear and direct. My mind was not blown by this class, which is understandable. It was an intro course and concentrated a lot on basic terms, but it is a good foundation if you want to study film. His marking scheme is a little tough but I would still recommend Nystrom for sure.",
      "Amazing prof, really insightful and intelligent. He's polite, approachable, and very helpful. It's evident that he puts a lot of work into his lectures and course outlines. He's really a very interesting lecturer, and has lots of great ideas.",
      "Amazing prof! great lecturer. makes easy stuff comprehensible. love him! opens up thinking valves, but still: what is cultural studies all about&#63;&#63;&#63;",
      "Cultural studies is HARD. the readings are dense. Nystrom manages to make the readings seem easy, and if you haven't been keeping up with them you can still follow along in lectures though it's better if you read them beforehand. He makes good jokes but looks super pissed off when people are whispering/texting etc. Recommend. You learn a lot.",
      "Great prof, lectures are entertaining and informative. He also has a good sense of humor and makes sure the students are awake. I wouldn't recommend this class as an elective because the readings and subject matter can be dense, but it's a fantastic class for cultural studies majors/minors.",
      "Everybody loves Professor Nystrom, but for good reason- he's really great, either in his massive survey classes (which he deftly handles with capable TA's and well-structured lectures) or in a smaller venue. He's extremely interesting and is great at defining and explaining ideas- a necessity for a survey course!",
      "Amazing prof. Lectures are clear, thought-provoking, and entertaining... one of the few courses where I've made a priority of attending the lectures. He's also very approachable after class and receptive to students' special needs. ENGL 275 = course is difficult and you must do the readings and attend conferences; however, it's rewarding if you do!",
      "This class was always entertaining because he's really funny and gives interesting examples for all of the not-so-interesting readings. I did need to learn how to write really fast though.",
      "Nystrom is wonderful! Engaging, insightful, entertaining. Helpful if you ask questions. Unfortunately he says a LOT in class - sometimes hard to follow. There's also a lot of reading, a lot to study, but you are not required to retain THAT much of it. It's worth it for his silly jokes.",
      "funny, informative, interesting and dynamic... you almost dont realise you're learning while you do and the in class lecture is always facinating",
      "Very helpful. Excellent lecturer with a great sense of humour, and he selects just the right clips of shows and movies to illustrate his points. The class has a lot of hard readings that you have to stay current with, but it's worth it. Really an all-around wonderful teacher and course.",
      "Such a good prof. Lectures were dense and there was never a dull moment. Great dry wit. Course felt thorough, and the readings were well tied together and highly applicable.",
      "Great lecturer, great class. Don't take it thinking that it will be a walk in the park. I learned so much.",
      "No Comments",
      "Very interesting class, woke me up in the morning, and was a class I actually enjoyed going to!!!",
      "i know it's been said, but SO CUTE. more importantly, v. amusing, best in front of a big crowd as in 275 but did a great job with 360 too, really listens to students' comments. Explaining Marxist criticism through star wars wins bonus points for originality. He is the reason I understand Derrida and that's really saying something.",
      "yes, derek nystrom is a fox. yes, i would marry him if he asked me. BUT more importantly, he really is a great lecturer with a staggering intellect and is one of the most approachable and student-friendly profs in the department.",
      "Derek's the cutest prof in the planet, you'll have to resist the urge to get up from your seat and go hug him... and he's super nice, interesting, clear and funny too. he's just plain wonderful.",
      "I agree, I guess he knows his stuff but if you seriously think he's hot, I would recommend spending less time at the library and going outside a little more.",
      "Great guy, but still human despite everyone's awestruck comments. Absolute killer in marking but couldn't do better at making very dense readings crystal clear. You have to take this if you're in C.S., but just know that while you'll learn lots, a high mark is all but impossible. Overrated yet still a really great prof in the truest sense.",
      "He is soooo dreamy!Yes there really is a hot teacher at McGill but he's also very interestsing and you will actually learn something from this class. There's a lot of reading, but, come on, it's an English class, that should be expected.",
      "he's sooooooooo cute! you'll just fall in love with him during lectures!",
      "No Comments",
      "How is he doing this&#63; Making Freud and Mrx seem interesting&#63; I love his sense of humour and his hotness (smart, good body) is only minorly distracting. Not looking forward to his papers though. Very dry sense of humour and an overall knowledge of what, everything&#63;",
      "Derek, will you please marry me&#63; he's hot (soooo hot), funny, interesting, and tells you exactly what he thinks is important. Best class i took all year.",
      "Derek Nystrom is the perfect man. He's hot and a Marxist. Kinda looks like Burt Reynolds.",
      "I'm always surprised that the class is over so soon, because he makes time go by so quickly! He is super funny and makes really dense readings enjoyable!",
      "nystrom is engaging, clear, funny, and has a hilarious laugh. he also makes simpsons and star wars references on a regular basis, which scores him bonus points.",
      "he's amazing. i've taken two other classes in cultural studies and his class is the only reason i understand anything. whether you're in cultural studies or just looking for an elective, TAKE THIS CLASS! (it's not hard at all, just thought-provoking)",
      "just one word. FOX.",
      "nystrom rocks!! definetly hot and very interesting! This was my favorite class even though I did get a C+ on my last paper and still think that was unfair. (but I got an A- on the first)",
      "He is one of the best profs I've ever had. Very knowledgeable and has a fun, innovative approach to teaching that is lacking in a lot of profs. Definitely a hard marker, you probably won't get an A in his class, but you'll learn a lot and love actually sitting in class, if you can believe it.",
      "The class is good but Nystrom marks too hard for a 200 level class. Really interesting material, but A's and A-'s are hard to come by-- TAs have to defend A's given to students to Nystrom and the English dept.",
      "Prof. Nystrom is fantastic. 489 is a lot different from 275, but it's still fantastic. He's a brutal grader, but I couldn't ask for a better prof. Go to see him at office hours, he's fun! One of the best profs I've ever had, but a lot of work is required!",
      "Great prof who is very helpful.He really clarifies the readings which are at times tough and lenghty in his witty and entertaining lectures. His organization of the course really makes the concepts he first introduces more tangible with time.It is a really eye opening course, try to get L.Moth as TA",
      "A lot of long and tough readings but he makes everything clear in lecture and always willing to go over it again. Answers when you write to him, interesting lectures and an overall fun class. He's also so adorable that you look right past his sometimes cheesy attempts to entertain",
      "grade A, no question. if you're lazy, don't take the class--",
      "He's absolutely great! The lectures are really interesting and Nystrom is hilarious! Even when the readings are confusing, he clears things up in the lecture. Attending this class is a real pleasure; my absolute favorite and I recommend it to everyone.",
      "my favorite class by far!! prof is interesting, entertaining, clear, extremely knowledgeable, and very helpful! plus he has the cutest laugh! i highly recommend this class!",
      "Amazing professor. Really enjoys what he is talking about (not so much in intro class) and always wants to know what the students' opinions are. Knows everything about film and pop culture... has a great laugh that you will never forget and can hear a mile away!",
      "Though the readings are hard at first, Nystrom is amazing at going through the main points step by step and gives perfect examples. I could see him being better in a discussion class, but even in this - my favourite class by far - he is great. And beautiful.",
      "Once you get into one of his classes where the subjet matter interests him (ie. NOT intro to cultural studies) the man lights up inside. He would much rather hear what his students think than blather on himself. He stimulates discussions, while making sure they stay on track. AMAZING PROF! and cute.",
      "SO so so so cute. His lectures and interesting, and i find myself smiling when he talks...he's just so damn cute",
      "This class is a fantastic intro to cultural studies, especially if you're more into the theory than the application. Nystrom is progressive and comical - a refreshing change from the usual facists at McGill.",
      "Prof. Nystrom is great. His lectures are funny and explain the readings really well. The readings themselves are killer though. His evaluations are very fair, but not easy. He tries his best to help you at all costs. I learned a lot",
      "Really clever prof, and always willing to help. However, lectures are scripted and can tend to get a little overwhelming. Insanely hard readings!! But overall, not a bad class.",
      "Yes, he's definately a cutie but he is really thourough in his lectures too. If you got into them they weren't too hard understand but if you were day-dreamin then you are screwed. Anyway, if you do pay attention you don't have to do all that damn readng!",
      "He is the cutest guy ever to walk into a classroom. He is interesting and well spoken. His laugh is SO ADORABLE!",
      "Wow! He's really good looking. His lectures are somewhat boring to listen to.. hard to get into. lots of reading for the class. don't take it if you have a lot of hard classes or as an elective",
      "Smart, funny and hot. Lectures make the reading make sense. But a brutal marker.",
      "The most refreshing teacher I have ever had! Amazing lectures that are witty and have fun with the material. Ahh, young blood! And what better person to be teaching cultural studies (ie American pop.culture) than an American with a wicked sense of humor!",
      "He's the man. Nothing more, nothing less.",
      "This guy is hot and funny but he reads his lectures and they read like a very difficult to read theory book. The topics are interesting but the way he lectures uses very complex language and is quite difficult to comprehend.",
      "Interesting lectures that pretty clearly summarize the readings. Seems to be a pretty approachable guy too.",
      "tries hard, but just not interesting--reads his lectures",
      "No Comments"
    ]
  ],
  [
    "University of British Columbia",
    "Fox, Lorcan",
    157,
    [
      "he is brilliant and kind. he makes lecture interesting and funny, but he can be pretty awkward which can make lectures momentarily painful. he tries to make the lecture material really accessible for everyone no matter their background.",
      "He's a really fair marker and tries to make his class interesting. You don't get penalized for not participating which can't be said for a lot of other 112 classes. 10/10 would recommend if you want to breeze through first year English",
      "Professsor Fox is one of the best English profs in the department, his classes all prepare you for the quizzes and the final, and he marks extremely fairly and actually gives good feedback. Super respectful of students and easy to talk to. An A in this class is super attainable if you read the works and come to class.",
      "Good prof, kinda awkward guy which can make lectures painful at times, but mostly they're fine; he placed a heavy emphasis on the history of the texts, which depending on how much you like history could be a good thing or a bad thing; he's very approachable, nicer to talk to one on one than during lecture",
      "I actually liked prof fox way more than I thought I was going to. He explains everything very well and gives good context. He made 18th century english interesting. TO DO WELL: participate. Read the readings and look up summaries and when he asks questions answer them - they are easy questions anyways. Take ENG 220 with him!! 1 final and 2 midterms",
      "He teaches very concisely, and drops funny dry humor at the same time. He tells you exactly what he wants for essays and tests. There were only a few in class essays and one paper to complete. If you include everything he tells you to and write well, you can easily get an A. You have to buy a couple books, but they can also be found online.",
      "Lectures are kind of scattered but take good notes and you will be solid for the in class tests. Fair amount of reading but he does his best to make it interesting.",
      "Good prof.",
      "Super fair marker and really respectful prof.",
      "Lorcan is the coolest. Go to his lectures, and he'll tell you exactly what you need to know to do well. The material for this course is pretty bland, but he does a good job of making sure the students understand his points. His marking isn't difficult per se, but you need to work hard to impress him. His dad jokes are a bonus. Would recommend.",
      "Great prof- really nice and approachable! Learned lots in his class! He's a decent marker (he definitely won't kill you). Lectures aren't boring at all (considering it is English).",
      "Hilarious guy with a dry sense of humour; class is always interesting. You can basically just regurgitate lecture points on the midterms.",
      "he gives out fat knowledge in lectures which will increase your grade if you apply that knowledge in his tests. very smart and nice will take again but i am in cs so someone else should take his classes",
      "He's a really fair marker and his class is really standard. If you don't like doing unnecessary work and just want to get the course done, this would be a good one. He does read a lot from the text so make sure you are prepared for that. Otherwise, solid class. Lorcan has great cynical humour to keep you entertained.",
      "He is literally the best English Professor that I had so far. He's very kind and welcoming and his lectures are amazing! You learn so much in every class; so don't skip them! The writing quizzes are easy and based entirely on what he says in class. The only downside is that he doesn't give out A's very easily; so you'll usually get B's.",
      "Most of my learning came from the textbook, but the lectures were very helpful to drive home the main points and ask questions. He doesn't give participation marks, but will give you a higher grade if you have been participating in class. I found that he was a fairly easy marker as well.",
      "Amazing professor and hilarious jokes. Highly recommend!",
      "The Anthology assigned wasn't specifically necessary, but he does refer to the page numbers on it, so if you go for an online source, get ready to scramble to the part he's talking about. Fair grader, listen and take notes in class and you'll do fine on the midterms.",
      "Made English class actually interesting for garbage science student like me.",
      "Great teacher. Evidently enjoys the works he teachers, and is a good help with papers/course work. His lectures were simple and straight forward, but handles the material well. I would only caution against his (what I would call over-) enthusiasm for Shapiro when reading Lear, which sidelines more classic interpretations.",
      "Lorcan takes dry material and adds humour to it to make it bearable. He's an awesome guy and easy to listen to. The class itself was pretty easy. I never found myself with a lot of homework to do or something until the day before the term paper was due. Would recommend.",
      "Lorcan was easily my favorite prof in my entire first year! Great person inside and out and genuinely cares for you. Would recommend!",
      "One of the best profs I had in UBC. very helpful in office hours. Classes are fun and not boring. Take english with him if you need ENGL112!!!",
      "Prof Fox is the best teacher I ever seen in UBC, definitely choose him if you are going to take ENGL112 course.",
      "Lectures are mostly class discussions on the assigned pre-reading. Readings were usually 10-20 novel pages per class on average. You can usually skip out on the pre readings and do fine in class for participation. As for papers, as long as you don't go off topic, you should get a B. Very hard to get into the A range. Takes attendance every class.",
      "He was a really great prof, he made boring material fun to go through, and made jokes along the way. If you do the reading and talk in class, you should be fine in the course. Instructions and assignments are clear. He marks easy, but he doesn't give higher than an A- on your final mark.",
      "very clear on what he expects of you. great prof and funny lectures! his tests and in-class assignments are not too tough. workload is very reasonable compared to some of the other eng112 profs :)",
      "I legitimately looked forward to going to his lectures. They were interesting & informative, and he made it unbelievably clear about what to expect on exams. Gave historical context along with the readings, to give you a greater appreciation for the works. He's a wonderful professor, and very highly recommend him. Awesome guy. Participate & attend!",
      "Prof. Fox is one of my fav profs at UBC. He's always willing to help you if you need. His lectures are amazing. What we read in class covers different topics but have similarities- so as a whole, you learn something more than English. I think that is exactly the function of literature- always make you think differently about the world and life!",
      "My state of mind -- -- Before the term - English? Literature? What a joke!! Waste of time!! -- After the first lecture - WHoa!! Its actually interesting.. How come I never enjoyed an english course before? -- After the term - Where can I buy more books to read?? Most inspirational prof ever. He breathes literature. Changed my view for ever",
      "I missed the course evaluations so that's why I am writing this for Prof. Lorcan Fox. I took him in the summer and he is one of the best English professors out there. Always wiling to help during office hours and after class. His instructions for tests and quizzes are really clear and his lectures, though long, are very interesting and informative!",
      "Cool class. Cool dude. Cool beans.",
      "I thoroughly enjoyed my semester with Prof Fox. Lots of reading, but his lectures are informative, enjoyable, and his expectations in terms of assignments & exams are extremely clear cut. If you keep up pretty well with readings, and take good notes in class, you should do very well. Participation mandatory. I very highly recommend professor F",
      "Very easy to get an A- or B+ but might as well forget about any mark higher than that. I found lectures to be alright, he tries to make the best out of a really dry course (engl 112). Overall nice & funny. Would recommend.",
      "Undoubtedly the best prof I've ever had. Made every single class worth going to and I even looked forward to going to class. Clear about what he expects, helpful at both office hours and through e-mail but tries his best not to play favourites. Smart, respectable, funny guy. I also missed the course evaluation which is why I'm doing this :D",
      "Great prof! Fair marker and made class enjoyable with his witty comments. He is also very approachable and does everything to help and answer all your questions.",
      "Spends time on historical background to give context to the works. Loved that. Reminded me of my high school lit teacher. Interesting reading list. I found the research essay excruciating though. Probably should have gone for some help. Oh well, I still got a pretty decent mark on it. He's not too harsh with marking.",
      "Best prof at UBC. He is so clear with his assignments and in class tests. Really no excuses to get a bad mark unless you don't attend or pay attention in class. Passionate to help his students succeed and will learn everyone's names. Extremely comfortable to approach and not intimidating at all.",
      "Lorcan is a funny prof, seems monotone and dry until you really listen. He'll throw in something bizarre just to keep you on your toes. Great Prof!",
      "Great prof. He speaks slowly and explains in a way everybody can understand. He learns everybody's name, and yet gives everybody decent respect. A very knowledgeable person that has an \"interesting\" sense of humour.(he identifies himself as a \"grey person\"). Approachable and not intimidating at all",
      "Great prof. Really down to earth and always willing to help student succeed. Pretty lenient marker as well. Would definitely take a course with him again",
      "Best instructor I've had in my first semester. Extremely fair marker, and very helpful and approachable. His humour was also on point haha. More importantly, he was always prepared for class discussions, which made the discussions very helpful and engaging. I'm in science but wouldn't mind taking another English course if it were with him :)",
      "Great class, you can tell he's really into what he's teaching. He's a good lecturer, 3 hour lectures went by really quickly. The material is interesting and most of all exams are straightforward and he marks very fairly. I liked him so much I signed up for another class with him.",
      "Very approachable professor and always has a lot of interesting things to say about the works studied in class. A little monotonous sometimes but has a dry sense of humour that makes the class chuckle. Not the easiest marker, but he's very fair. If you attend his class and take good notes, you'll be fine.",
      "He is a great English prof I have ever met! I am an ESL student and worry about my English class, but his passion and teaching style really makes this class easier then what I imagined. Speak slowing and very straightforward! He is also very helpful after class. Highly recommend his class!",
      "Very straightforward, clear, and slow (not that there is much material in the course anyway) teaching. It was always clear what was expected for assignments and exams. Other than that, I like his dry sense of humour.",
      "Great Professor! Really knows his stuff and explains it really well! Lots of class discussions and really takes the time to explain things clearly without rushing through anything! He is also really flexible when handing in assignments; this is useful when you first enter into university! I would definitely take his classes again!",
      "Dr. Fox makes every piece of literature seem interesting (he does choose excellent works), through his own love of literature. He provides ample historical background to accompany works and is extremely well informed in general. He is very concerned with student understanding and improvement. Above all he is dry humour is funny!",
      "You HAVE to go to class and you MUST take good notes. These 2 things are going to be your most important elements of success. He gives really good lectures and if you listen carefully, you'd know how to pull an essay on his quizes and final. I took the class in summer, so I had time to work on my research essay and stuff. I got a B+ (78%).",
      "Took a class with Dr. Fox in my first year at UBC. He's very helpful during office hours, and he helped to ease my transition - giving me advice on how to use academic journals as sources. Although I only had a B+ in his class, I learned so much... interesting book selection - waiting for the barbarians/inheritance of loss etc. Great prof!",
      "Cool guy, explains concepts of the pieces of literature very clearly. Tests / exams area basically exactly the things discussed in class so if you at least understand the basics, you will get a decent mark for sure.",
      "Excellent instructor. I put off fulfilling my literature requirements for a while but am very happy I completed them in his class. He's a very fair marker, extremely helpful, and goes beyond the literature aspect of the course by giving historical information and insight and how it would have affected the writing at that time. Take his class!",
      "Solid English professor. Gives you clear expectations. Best thing is he gives the literature a history and social context so it's not free-floating, and he connections the works to specific genres/the broader canon of lit. Take his class!",
      "SO good at his job. cares about students, explains concepts and expectations clearly, offers good feedback and leads easy-going discussions. down-to-earth, amusing guy. a little repetitive sometimes, but that should be your HINT that what he's saying *might* just show up on future quizzes/the exam. definitely recommend.",
      "I had Mr.Fox for english 112, he was pretty easy compared to other 112 professors, he is explains things very well, easy to approach, and learns all of his students names. I would recommend him to anyone taking 112.",
      "Really nice and explains well. isn't intimidating to approach",
      "One of the best English professors I've had at UBC. Open to interpretation of literary works, but also offers enough historical context that you don't have to be good at interpretation to do well. Makes his expectations clear and is extremely helpful in making sure students do well.",
      "Exemplary professor. His lectures are crystal clear, you know what to expect on quizzes/ tests. Put work in and you will get a good grade. He is also a genuinely nice person, and knows how to get his (interesting!) points across. I learned a lot in this class.",
      "Good lecturer, presents many important aspects or details of a work as well as different views from various critics. Seems to have the uncanny ability to recall the page number of a certain passage on the spot. A decent mark (A or higher) is hard to get though, as hard as I tried... maybe not true for other students though",
      "An amazing professor who gives everyone a chance to succeed. He gives participation opportunities to those who rarely do so. He marks with detail, writing down passages from class materials to help us understand. His discussions on Austen's Northanger Abbey were hilarious! A respectful professor who truly shows concern for student learning.",
      "We haven't been given our papers back yet, but I really like this guy so far. Yeah, a bit dull, but he's also steeped in the historical context and L-O-V-E that! I've only missed class once and that was for... personal... reasons... Otherwise it's extremely informative and if he didn't ask questions before, then he does now. I need an A!",
      "He is the best english teacher I've had so far. He is awesome. His lectures are very interesting and his choice of literature is unelieavable! I loved them all, but that's just me. Anyways, his marking was not too bad... if you participate in class a lot. He is definately a fair marker, very just. I would definately recomend his classes!",
      "He is a very reasonable, understanding, and fair professor. Fox only chose 5 novels which is a lot better than some 227 profs!!! Four out of five were great! He repeats himself frequently but is fairly insightful (and funny). If you take thorough notes in class and repeat discussed ideas on midterms, you will do quite well! I loved his class!",
      "super boring class because he teaches super boring material. aside from that. he's reallly helpful during his office hours. if you participate once or twice every class it helps your grade, so do it. He's a fair marker but more lenient if you participate. at first you dont feel like you've learned, but after finishing the course, i realized i did",
      "220: dull readings, get coles notes. 221: much more interesting reading. His quizzes are easy, just memorize the important points he goes over, final essay was easy as well, not difficult to do well, i recommend taking his classes",
      "Great prof, wonderful lecturer, his class was a pleasure. Tough-ish marker, but not bad.",
      "Good teaching style, enjoyable. but hard to score really high. final is cumulative, so lots of reading. nice guy",
      "best eng prof!",
      "Lorcan Fox is a pretty amazing Prof. He picks very interesting texts for the most part and has many unifying themes which combine them together. Highly recommended.",
      "He's got a name like a super-hero and the charming demeanor of Clark Kent. He enjoys his subject, although he doesn't seem to expect his students too, which is perhaps his only real flaw.",
      "He is one of the best profs at ubc! He is helpful, respectful, and fair. He genuinely cares about his students, and really wants everyone to do well, so he is very encouraging! I highly recommend any class with Professor Fox; he is truly a considerate teacher and very informative:)",
      "clear lectures, fair marker. Tries to be funny, overall nice guy.",
      "He is a respectful prof! Very nice and considerate. Fair marker. I received a B without too much effort.",
      "awesome prof.. very helpful, funny and informative at the same time.. makes the subject interesting.. one of the best profs in my opinion..",
      "Good prof and very nice guy. He was really helpful outside of class as well and it's fairly easy to get a good mark. He can get a little repetitive sometimes or seem like he's dumbing things down, but I honestly believe that's more the result of the unresponsiveness of the class. Overall, one of the best profs I've had. Pretty funny guy as well.",
      "He's a fair marker, but unbelievably boring. A lot of it had to do with the course material, to be fair. He took ages to explain the simplest concepts. Never would've gone if he hadn't taken attendace.",
      "Dr. Fox is a great prof! The readings were great. I took this class during summer so I had to read 1 novel/week. He explains things clearly! In terms of easiness, he is not easy but not hard. The word to describe him is FAIR. You get what you put in. If you attend lectures and participate, you will do well! Will take again for sure! Five stars!",
      "He was an interesting prof and laid out what he wanted in a very simple manner. Although, he was a difficult marker.",
      "A nice prof. Clear and helpful. A little boring, but I think that had more to do with the course than with him.",
      "He's really good. Best university English mark I've ever gotten: he's quite an easy marker. Not difficult to get over 80. He chose mostly comtemporary novels, most were quite interesting. I liked his lecture style and insight into the material. Would take again!",
      "He is definitely a fair marker; however, it is tough to get a high mark in his class. One would really have to work hard to achieve an A. But nonetheless, he is an awesome prof. He also has a sense of humor and uses 'up-to-date' analogies (e.g., Harry Potter, Lord of the Rings). It's always interesting to sit in his lectures.",
      "very well organized, very interesting but somewhat of a tough marker- guarteened a min. B- if you study hard. Prepares you well for midterm and final exam though.",
      "I use to get horrible grades in high school English. However, it seems like English in university is easier than high school when taking it with Fox! I agree that he's a very fair marker. I think I'm gonna crown him to be the best teacher of this semester.",
      "Excellent teacher. He is always very clear and proficient. He is also very considerate of students. I enjoyed his class even though English is my second language. He made it very easy. Another thing to mention is that he's a very fair marker.",
      "Organized layout of course. Easy for planning your studying. Good teacher. Very fair when marking and easy to understand in class.",
      "This guy doesn't really teach a whole lot, but at least he's nice and helpful, and his assignments are pretty easy.",
      "Very good prof. He is clear, and his lectures are very interesting. If you attend all classes and learn the material, you will get a good mark.",
      "great prof! he gets pretty funny sometimes...da quizzes r easy, not a hard marker",
      "the best prof i ever had",
      "Super nice and unpretentious. Yes, he's a picky marker, but in his defence, he's only teaching lower level courses where there really is only one answer and not much room for interpretative BS.",
      "For the most part, a good proff. Can be monotonous at times.",
      "Great prof!He is very helpful.",
      "Great professor, highly recommended. He's right; it is definitely worthwhile to keep the &quot;handbook for writers&quot;. Thanks for an awesome semester Professor Fox!",
      "Tends to ramble and repeat every little detail, but a very fair marker, and extremely helpful and clear. Seems rather strange, but is actually a very nice guy.",
      "Easy, but mentally taxing at times due to the monotony of his classes. Overall, he is a great guy and a helpful professor.",
      "Good prof, well-structured course, not too much reading that he actually uses and goes over, nice guy.",
      "All in all a great experience. He's extremely fair with his questions and marking. His sense of humour grows on you. Knows his subjuct. Good readings that were not overwhelming. Very helpful outside of class. Highly recommended!",
      "I had Lorcan for three semesters. He is very nice, very approachable, and very considerate of the shyer types. Take his class if you like listening to lectures or if you like participating in them - either way it is interesting stuff. Thanks Dr FOX!!",
      "Very insightful and engaging. I'd take another class with him in an instant. Probably one of the best prof's I've had so far. And believe it or not he's got a sense of humor! Fair marker too.",
      "Very good professor. I know I'm speaking in sentence fragments, but hopefully if he sees this, I will be forgiven. Oy, haha. Anyway, he's very helpful and clear. For me, his classes were interesting. I would take his class again, if the opportunity is giv",
      "He appears very approachable and friendly. It actually gave me motivation to do well in English.",
      "I took a course with him when Engl 220 was 201 (ie, all year round) and I thought he was great. He does speak slowly and looks kind of out of it sometimes but he is helpful and is willing to help you do your best.",
      "Great Prof... Take his course. He's very helpful and teaches well (although the course is boring). Easy as well:)",
      "Great guy, very clear, very helpful.",
      "Dr. Fox was one of the best profs I've had. He seems like he might be snooty at first,but he's really nice and really helpful. His in-class marking is a bit tough, but his classes were the best,very interesting & interactive.I'd take him again in a minute",
      "He is a really nice and helpful prof. He's really clear about everything and respects your efforts and consider it while marking. I enjoyed his class very much.Thanks Lorcane!",
      "A little boring but tried to make the class as interesting as possible. Has high expectations for in-class writing but is a decently fair marker.",
      "Almost painfully clear! His expectations are explicitly defined in class. EASY marker, if you don't get an &quot;A&quot;, it's your own fault!",
      "Dr. Fox was a really nice prof. Tests were fairly easy and he went out of his way to help people. Lectures were as interesting as could be with the subject matter.",
      "A decent teacher. The class was really boring and dry, but it wasn't all his fault. An average teacher; I would give him a B.",
      "Really helpful, really nice guy. His lectures were actually often interesting...perhaps this is because it was the only class where the size was low enough for student participation.",
      "This guy is one of the nicest teachers. Always willing to help during office hours and makes class discussions interesting.",
      "this guy was real cool. i really enjoyed his class. funny and nice guy. his lectures summarize important stuff from the readings. i never read the flick book once. real cool guy.",
      "Boring at first, but now he seems like a really good teacher with reasonable expectations.",
      "Very thoughtful to his students. His class is quite interesting. I'm impressed by his personality. He looks a bit sobriety, but actually he is a very nice person. He is one of the best prof I had at UBC.",
      "A very funny and understanding guy. Very considerate of his students. He is one of the best prof. I've ever had.",
      "Great prof. Very understanding and helpful. Fair marker. Attempts to be funny at times.",
      "Medium difficult marker, and a little intimidating at first, but in the end a very fair marker. Invited us to call him at home to answer questions.",
      "he is really boring..but he is easy tho",
      "Made ENG 112 much more enjoyable than I had imagined. I actually learned a lot from the course!",
      "No Comments",
      "pretty nice prof, very understanding and thoughtful of students",
      "enjoyed class because of him. Funny guy, really helpful, marks so-so easy",
      "No Comments",
      "really nice, helpful, funny",
      "No Comments",
      "In depth reading, very encouraging, engaging.",
      "very funny, not much much workload...quite an easy marker!",
      "Such a funny guy. Not too hard of a marker",
      "was able to make eng. 112 somewhat interesting",
      "he was an awesome prof",
      "a wise guy who makes wise cracks; otherwise, he's OK",
      "funny and nice guy",
      "funny guy and marks easily (compared to other english profs)",
      "He is funny(sarcastic), andmarks pretty easily",
      "He's a funny guy.",
      "No Comments",
      "No Comments",
      "No Comments"
    ]
  ],
  [
    "University of Alberta",
    "Sucur, Slobodan",
    171,
    [
      "Slobodan Sucur.. The man. The myth. The legend. One of the best professors I have ever had; works discussed were super interesting and required minimal reading. Overall he is absolutely amazing and I will really miss his classes; I say this as someone who used to despise english in high school.",
      "As someone who barely got through highschool English and barely getting over 60% on most essays, definitely did not expect to do as well as I did in his course. The essay questions were definitely difficult to answer and the readings were pretty boring. He is definitely generous when giving marks, the lowest marks he gave were B-'s.",
      "He's a great professor that marks fairly. The feedback he gives is helpful, and he outlines his expectations for each work very clearly. I would take this course again.",
      "Highly recommend this prof! He is very genuine and caring, and there are only two essays, one assignment and class participation. He provides a lot of information in class which can be used in the essays, which makes it very helpful!",
      "Best English professor. He will send you a lot of emails, so you will not miss anything and all these messages are good to you. Even if you're not native speaker, you can still do well. 2 papers, 1 assignment and participation. Average B, just hand in your work, and take few notes, cuz you will need those on your paper, that's it. Take his class",
      "I couldn't stand English in high school but this was totally different and the prof made everyone comfortable to speak up in class. Discussions were detailed and provided so much info for the essays that they weren't hard to write.",
      "Slobodan is a good prof. A little odd, but genuinely means well and is totally willing to help students out if they ask for it. Only marked on two essays, the final and class participation. He does talk a lot, and will go off on tangents which does kind of waste class time. Does have some interesting things to say that relate to the literature.",
      "Really fun English class and fair marker, would definitely take again!",
      "Incredible professor. Allows students to voice their own thoughts on texts in group discussions, and then further breaks down the texts in depth. This process provides an abundant amount of evidence to be used in essays. Makes himself available to students, and is very approachable. You can tell he deeply cares about the subject and his students.",
      "His class is an easy English class. You don't need to buy his recommended book. Readings are all pdfs he has links to. We read shorter works and watched many movies. Attendance isn't mandatory, but it's best to go and hear him talk about ideas. Take notes and writing essays won't be as challenging. You'll be better prepared for the final.",
      "Really enjoyed this class and I usually hate English. Fair marker and class discussion was helpful for the essays.",
      "Dr. Sucur makes me like English. The average of this class is B.",
      "Prof. Sucur was so caring, and he really knew a lot about the subjects he was assigning the class. His lectures may tend to get a little dry, but with a little participation discussions flow freely. He loves to break things down for his students, which is extremely helpful for essays. Highly recommend!",
      "Sucur was an excellent professor. You can see his passion for the class and his personal studies. Most of the readings/films studied in the class were interesting, though they could often be quite confusing. My only real critique is that Sucur's lectures felt like they could go on for ever.",
      "Honestly best English prof ever! Topic is dry but he spends all class period breaking things down with you. If you take notes during class, your research papers should not take more than a few hours. Not very reading heavy either! You watch a lot of movies and though they're old, I'd rather write a paper over a movie than an entire novel.",
      "Best guy. Best prof. Best class *drops mic*",
      "In high school, I stuck towards math and chemistry. However, when I took Dr. Sucurs English class, I actually quite liked it. Hes an excellent professor who is very passionate about what he does, and he gives great feedback in order for you to become a better writer. Definitely would take again!",
      "Take him if you can!! Prof Sucur is the best professor I've had yet and certainly the greatest English teacher I've ever had. I used to be that science student who dreaded English, but this class became my favourite this fall semester. You WILL NOT regret taking his class!",
      "Dr. Sucur is a very good prof. Classes were sometimes dry because they were full of discussion, but if you pay attention just a bit, you can learn a lot about pretty interesting readings. Papers were graded quickly and with awesome feedback. He also was always willing to answer questions and clarify assignements. Awesome English prof!",
      "He is honestly caring, so if you want a caring teacher, I undoubtedly advise you to choose this prof. He wants you to succeed, so go and ask him to your heart's content. He won't patronize you : ) He does not skimp when marking your essay, he will make many markings and comment @ end so you CAN improve. If you care to do well, he can help you.",
      "Sucur is a wonderful prof. His assignments are very straightforward, and he gives you the topics a month before they're due. I was in his night class so I thought it would be awful, but he is a very passionate lecturer so it was enjoyable. He always gave me good feedback on my papers when I went to him for help before the paper was due. 10/10",
      "Haven't done a formal English class in 4 years and I got a good grade in his class. Participating in class discussion about readings helps because he GIVES you content for your essays. Listen and then write about those things and you'll do great. Expensive book for only one story ($40), rest online access.",
      "This class is so chill. Professor Sucur is a reasonable person. Make sure you don't leave every assignment until the last minute because they're more time consuming you think they will be. Pay attention to the first few classes when he talks about proper essay writing and formatting, and to the class discussions because it helps with the papers.",
      "Class was very straight forward, he told you exactly what he was going to mark on for the papers. Boring reading material but at least there were not too many papers. Would definitely take again.",
      "Sucur's class discussions literally tell you EXACTLY what to put in your essays, so they help tremendously. I didn't do all of the readings, and only came to class for the discussions of the texts I was going to write on. Never said a word in class and got full marks for participation and straight A's for all my papers. Easy class, great prof!!",
      "He is a great prof who provides good feedback on your essays. I have hated English all through out high school but here I ended up doing well!",
      "Awesome Prof !!! Gives you lots of useful ideas on writing essays.",
      "He is a great teacher. He is lecture heavy but gives great insight. He is funny but is very monotone which will make you feel sleepy. Lectures are interesting and you have a lot of peer discussion. There is not a lot of reading in this class, he marks fairly easy, and we watched movies in class. I would recommend him.",
      "Lectures are very relaxed with little asked of students. He is very inviting should you want to share your opinion in class however you are not forced to do so. Provides time to discuss material with peers.",
      "Fantastic English prof, and a really great instructor if you struggle with English courses. He talks a lot in class but his lectures really help to clarify subjects and give you lots of ideas to use for essays. Definitely recommend him.",
      "Sucur made the class a breeze, especially for someone who typically struggles in English. I definitely recommend attending his class lectures as he discusses great ideas, practically spoon feeding us information, in use of strengthening your essays. He is also a very lenient marker and is willing to offer feedback on your papers. Take his class.",
      "Prof Sucur is the kind of prof who is awkwardly funny during his lectures. It was very heavy group/class discussion and he gave really good feedback and encouragement.",
      "He's awesome! A really sweet and caring guy. Emails back with help on papers. In- class discussions for 10% participation but he never picks on anyone unless you put your hand up and ends up giving everyone the 10% regardless. Doesn't use eclass, uses his own website. You watch movies in class. Not much work needs to be put into the class.",
      "Great Prof! Nothing much to say about him... straight forward and gives good feedback. Will email you back in 24hrs. If you need help on essays you can email him and he'll give you back good feedback and advice. Overall made English very enjoyable for me.",
      "Prof. Sucur was excellent. He answered emails very quickly and was available for help outside of class. If you're not as confident in English I highly recommend his class. The class includes 2 essays and a final worth 30%. And it's not hard to do well.",
      "Great prof. Can be boring at times but overall he tells you exactly what he wants on his final. Pretty easy marker too, gives good feedback although his handwriting is illegible at times. Accessible outside of class. Only marked on two essays and the final. Take him if you can.",
      "TAKE MY ADVICE AND TAKE HIS CLASS! THIS CLASS IS EASY AND A SAVIOR!! best teacher ever! He doesn't mark hard. NO FINAL OR MIDTERM. You just have to write three essays the whole semester. TRUST ME! you won't regret it.",
      "Dr. Sucur is a fantastic prof. He is very thorough in lecture in describing what he looks for. He tries to give his students as much information as he can so they can be successful in papers by giving good feedback and utilizing class discussion.",
      "Overall super easy. Very accepting of all ideas during discussion and won't force you to talk if you don't want to. Just be sure to take his class during a time where you'll be most awake because his lectures can be SUPER boring and his voice is quite monotone. But if you're just looking for your 6* in english, Sucur is a good pick.",
      "He is very skilled in his profession. Very knowledgeable in this field.",
      "The semester I took this I got really sick and missed a lot of class, and Dr. Sucur was so accomodating. He was super helpful in providing missed material and didn't dock me in participation marks. He mostly guides class discussion so they weren't terrible, but it did get a little out there at times. Definitely recommend.",
      "Dr. Sucur is such a sweetheart! He's a must for all engineering students. If you are that sort of person who doesn't like reading too much of literature stuffs, just pick him.",
      "Great class, really enjoyed the clear lectures and the mix of group work was good too. Most notes are posted on his website and easy to find, he also sends out helpful emails. Would recommend the class!",
      "Dr. Sucur is the savior of english professors. Classes are very enjoyable, with a lot of class discussion and he always brings forward new and interesting ways of looking at the literature discussed. He is extremely helpful in essay writing and editing, don't be afraid to go to him! I would highly recommend him to anyone.",
      "Very interesting manner of speaking. Really enthusiastic on what he is teaching. Take Notes! he talks fast but all of his essays as well as the final are covered in his lectures. Doesn't provide notes, write as he talks!",
      "He's super nice and helpful if you see him in office hours. The lectures can be long, but he is so excited about class contributions that you want to participate. There was only 2 papers and the final, and all the topics were very close to the class discussions.",
      "Found his lectures absolutely fascinating, some of his ideas were bizarre but it was great because he was receptive to any ideas from the class. Participation was encouraged but you could get away without it because he would often get very absorbed in his lectures. The class had two short essays nd the final was just two short answer questions.",
      "He's interested in gothic literature but if you don't mind that I would definitely recommend taking this class. Two essays and the final are all you write. His lectures are somewhat dry but it is not difficult to do well. Overall nice guy.",
      "Professor Sucur is really nice! Although participation is a part of your overall grade, he never calls anyone out in class which is great. However, if you do end up contributing to discussions he has a way of taking any comment as a new and interesting idea so don't be afraid to participate! Also, he doesn't have any tests, just papers.",
      "To some extent, as an ESL student, it will be hard to understand some terms in his class. But if you are a very professional English learner already, he will be a good prof. to you. Not hard to pass and get high grade actually, he is a helpful prof.",
      "I am someone who normally hates english class, but Dr. Sucur made it really enjoyable. He didn't force class participation, and allowed us to discuss questions in our groups. The entire class is either working in groups discussing questions, or talking about the questions together as a class, in which the prof goes on frequent long rants :)",
      "Dr. Sucur is probably the nicest man on the planet. He is incredibly kind and good-hearted. He never forces you to participate, but if you're nervous about it, he always makes you feel like your answer was a good one. When he marks, he always looks to give you marks rather than take them. Also a very sharp dresser! Best english prof at the uni!",
      "Such a good-natured, funny guy- I wasn't a fan of his choice of material, but still sailed through class- lots of group discussions in which he is encouraging to a fault, so a lot of class time is wasted. Very fair, easy class.",
      "Really clear prof, goes thoroughly through all literature that you cover in class. Almost every single class was purely discussion questions in small groups but he doesn't force you to speak unless you raise your hand. Only had two essays and the final the entire semester. Essay questions are very similar to the discussion questions from class.",
      "Sucur is the first pro I would like to write down comments on. He is so nice and a easy marker. you will get essays marked more than you expected. Many comments said they learnt nothing and classes were boring. however, it doesn't matter to me at all. I like him because he gives high marks and never force you to participate the class discussion!!",
      "Contrary to some, I didn't find Prof Sucur's class an Easy A but it is definitely easy to do fairly well. Great lecturer and perfect prof for a first year English class. The course load is light but that means essays are worth a lot so use Dr. Sucur as much as you can, he's very helpful even over email. Such a nice man, I'd take his class again!",
      "he's a nice guy. somewhat easy grader. You'd definitely pass if you hand in all the essays (like 2 the whole term) and show up for the final. Material is dry.",
      "He's amazing. A nice guy and super easy prof. If I ever need to take English again, I probably go with his class",
      "This was such an easy class. Easy A, and I'm a science student. Seriously, take his class.",
      "Literally one of the nicest people I have ever met. He's a very easy marker and the works assigned are easy to read. The lectures are very long and hard to pay attention in, but you want to pay attention because he's such a kind person.",
      "Basically no in class work, recommended to read a book for the final, but there was multiple things you could write on so not necessary. No quizzes. Easy marker as well.",
      "Sucur was one of my first professors and set a good ground to base my expectation of professors. He was professional, but could make a couple of jokes and realized that as a class, we don't really like talking. He would pair us up and have us discuss while he walked around the room, listening in. If he smiled as he passed, you said something right",
      "He is a great prof and will help you at all cost the content isn't very interesting but his class helps you write better.",
      "Wonderful teacher, easy grader, but a wonderful teacher!! I found his classes interesting and useful. Highly recommended!",
      "great class with good balance of group work and different presentation styles. dr s is a good speaker and really explains concepts well. made university english fun, which is surprising since i never liked english in high school",
      "Dr. Sucur is a fantastic prof. He understands that students are stressedbusy so he doesn't make our lives anymore harder than it should be. He's extremely helpful to talk to in person and very quick to respond with emails. The man loves to talk and discuss and is willing take up to 2 hours of his own time after class to chat with students. 55.",
      "Great class, much better than high school English. Dr. S knows his stuff and is a good speaker. He puts most of his notes online and is really fast with email. Class was usually fun and assignments were fairly graded.",
      "His classes are very drab and he is quite monotone, but there's nothing he can really do about that. A genuinely nice guy, his classes were very easy. The final was very fair and the two assignments through the year were easy to comprehend.",
      "He is really nice and helpful outside of class and can be really funny (sometimes awkwardly so). It was an easy A & I only had to write 2 essays. His choice in literature is a little creepy (lots of sex and gothic literature). Class discussions were really dry and mostly him talking (though to be fair it could have been my class). Final is fair.",
      "Very easy and relaxing course. The only thing that was due all semester was 2 essays. He's a very easy marker and I got an A on both essays. He's extremely helpful outside of class in person and through e-mail. Probably my favourite prof all first year. He's a good speaker and can be pretty funny at times. Literally no bad things to say about him.",
      "One of the best English classes I ever had. Organized lectures, very handy web site, and he explains all concepts very clearly in class. Marks fairly and not too many assignments. Take this if you can!",
      "Excellent class.",
      "Loved this class!! So fun, we got to do group work, lots of time to read the texts and most of his notes are online. Fair marker too. If you read the stuff and study for the final exam you should do fine. Also he's so fast with email replies!",
      "Such an easy class. I didn't read half of the assigned readings or even participate. He gives many different essay topics to choose from and gives you the literature he'll be testing for the final in advance. I literally put no effort into the course and still got an A-. He's kind of funny, in an awkward way. If his class is offered, take it!",
      "A very easy marker. B+ on papers started the night before. Start even earlier, get feedback, and I'm sure you'll do even better. The readings can be overwhelming if you're a slow reader, so try and get ahead before the term starts. The texts are quite boring and sometimes don't make sense, but he goes over them in detail during class.",
      "What a guy! Wow, great class, and an even greater professor. Such a fabulous man. If you can, take this class!",
      "OMGGGGG!!!!! BY FAR THE MOST INCREDIBLE PROF I HAVE EVER ENCOUNTERED IN MY LIFE AT UNI!!!!!!!!! LOVE HIM TO DEATH!!! FABULOUS PERSON! YOU GO MR.SUCUR!!",
      "He was my favourite prof in my first year. He is a very good teacher and a even better person. Very helpful over email and especially in person. He is enthusiastic in class and has a good sense of humour. He is also a very easy marker; there were a total of 16 A and A- marks out of 40 people on the last essay! Take him and you will love your life.",
      "Very easy class. Every day you will discuss questions about the literature just read. Nobody talked in my class so Sucur talked the whole time. Very boring literature picked but if you want an easy class you've found it. Only two essays were due all semester and then a final. Not much time to improve your mark but hardly any work.",
      "Very helpful and pleasant to talk to! You can tell he's really enthusiastic about the subject. Readings were interesting, and he marks very easy! Very light work load with only 2 essays and a final for the whole term.",
      "Very easy marker, I recommend reading ahead otherwise you will be completely lost during discussions and it will make it even harder to pay attention since it is super dry to begin with. Very very nice man and will help you with anything via email. Final is more difficult than any other work during semester.",
      "He's awesome. Very easy class. Make sure you go to class, and get all the answers to the discussion questions as 50% of the final is on one of the questions. He's really nice. Subject material is boring, but he is very enthusiastic and makes it fun.",
      "Great class, always helpful and knows his stuff. Good selection of reading materials too, and marks fairly.",
      "He is a very quiet but nice man, that is very helpful. His classes are dry at times, and he sometimes covers unnecessary material, but overall he goes over what is necessary. My favorite thing about him is that he is so helpful over email. Stuck on a paragraph or idea? Email him. Awesome prof. Never thought an A was possible in uni English.",
      "OMG this was SOOOO EASY. Class is basically you listening to him talk about the book, with occasional small group discussions. He is a really nice guy to and very knowledgeable PLUS you read interesting books. I never liked English in High School but he definitely made me love it again.",
      "Very nice prof! Will never make you feel bad if you speak up in class. Discussions are helpful for the essays and he is a very easy marker. If you put just a little effort in this class and show up most of the time you'll do great. I'd recommend :)",
      "Really great prof!! Take him if you can!",
      "I think he is a great prof. I recommend him. His in-class discussion are very useful. We only have to write two essays and a final exam.",
      "Go to most classes and plan your essays ahead and anyone will love this class.",
      "Was very helpful outside of class hours. Very detailed discussions and notes. Variety of literature covered, and we even watched a movie for about a week. He is a great speaker, and is a very fair marker. Very few assignments in his class. The final exam was very fair. Overall, excellent professor. Highly recommend.",
      "This class really isn't a whole lot of work. Go to class, listen to the prof's ideas and spend one weekend each writing two papers. That's it. Very fair marker, and the class average is typically B-B+ on essays. Thank you, Prof. Sucur.",
      "easy-going, very nice, very respectful. books were okay. only having two essays (1,000 and 1,500 words) and a final was nice. recommended.",
      "well, now that the terms over i can say that i really enjoyed this class. readings were interesting and i liked the mixture of lectures, slides, questions. grading was cool, he's a fair marker. hope i do good on the final exam too. good course overall and the teacher knows his stuff.",
      "I am a terrible writer and got a B+ in his class which was very surprising. He is very approachable and helpful, answers emails very quickly and actually answers your questions. Lectures were kinda boring but very helpful when it came time to writing the essays. Recommended prof for sure!",
      "Got A minus on an essay which was a surprise for me. I didn?t attend much class and the books were hard to get into (for me), and going to class would make me all the more confused, hence my low mark. But if you actually go to class, read the books he assigns (which aren?t that bad they kind of sneak up on you), u?ll do fine. Extrememely helpful.",
      "Really fun class. Liked the mixture of class discussion and lecturing, and the prof graded essays fairly. The choice of books was good too, they were interesting and there wasnt too much to read.",
      "Pros: Easy marker, good novels, and attendance is not mandatory, extremely helpful, sharp dresser, no assignments Cons: A bit boring, talks for most of the class. It's an into english class, but Id recommend him. Don't call him &quot;sucker&quot; Sidenote: there was an extremely attractive girl in my class, &quot;Hi&quot;",
      "Best prof ever! Classes were really interesting, and loved the literature we read!",
      "What a guy!! He is amazing. Marks essays easy. Classes were interesting for the most part.",
      "Prof. Sucur is a really interesting and knowledgable guy. He is very accepting of different perspectives and styles on essays. He will answer all your questions and reply to emails really fast. Lectures aren't mandatory but they are interesting. Overall, pretty easy to get a B/B+ in this class, and with some effort you can get an A-/A.",
      "really enjoyed this class. fair marker, good lectures and class discussion. not too many assignments, would definitely recommend it.",
      "He is such an easy marker, even when you write about the wrong story on an essay, you still get a C+ hahaha. Class average was 3.088",
      "I encourage you to take his classes. Classes are not mandatory since slides and notes are online but introduces concepts in class disscussion that will help you on your essays and final. Replies to emails instantly and is very respectful. Takes electronic submisssions and gives good feedback.",
      "Couldn't stand high school English but really enjoyed this class. Fun discussions and good teacher. Essays and exams are ok too if you take notes.",
      "Very good professor. A little dorky (and sometimes dull), but is very helpful in class and appreciates everyone's input. Also a relatively easy marker on papers (only handed out one mark below a B- all semester)",
      "Ok teacher, his topics for final examination were not very easy however.",
      "Great class, fair marker and topics were fun. Made me like English.",
      "I took both of his 121 and 124 class. He is such a easy marker! the average for each eaasy is around b+, and no one is below b-. But his class is useless, even if you skip all of his classes, you can still at a B at least. take his class if you want a higher grade. dont take his class if you really want to learn sth!",
      "He is an easy marker and teaches clearly. He is a really excellen professor.",
      "Slobodan Sucur is honestly one of the best instructors in the English department. Very easy marker on essays, replies to emails at midnight, helps you with anything class related. The only downside are his lectures, they sometimes get a little boring, but he gives away great advice for essay writing during class. TAKE HIS CLASS!",
      "Loved this class. Fun discussions and fair marker.",
      "Hope this is helpful..take his class if you're looking for easy. Class is really boring, but he's a really fair marker and I had no trouble getting a decent grade without going to every class.",
      "Great professor! Respects everybody's opinions. Not mandatory to attend class, but it helps with your essays and midterm/final if you hear the discussions in class. Replies immediately in my opinion. (Once replied at midnight)",
      "Pretty easy prof, just pay attention in class and use his thoughts for your essay. Also classes arent mandatory, and he also gives you the topics for the midterm and the final a class or two beforehand, so you can actually read the text. He's pretty cool tells you to use sparknotes.",
      "Great class, fair marker. Recommend it to friends.",
      "VERY GOOD PROF. He was friendly helpful and an EASY MARKER. Barely gave marks below a B on essays and it wasn't too hard to get in the B+ to A range. His exams were good because he tells you what's on them. For essays include what you talked about in class. Basically recopy your class notes into essay form and your set! So attend classes.",
      "Didn't like English until I took this class. Ok number of assignments, you'll do fine on exams if you show up regularly and listen to the lectures.",
      "Not too bad for an English class. Definitely recommend it to friends who need to take an English class.",
      "Loved this class, so fun for an English class. Discussions went well and we covered lots of interesting writers. Fair marker.",
      "He does ramble a little, tends to talk over his students` heads, and has a fixation with Poe, but that`s largely enthusiasm. Prof. Sucur is friendly and openminded (almost to a fault). His discussion questions will definitely help you look at literature from new perspectives. It`s an easy B or B+, but it only takes a little insight to get an A."
    ]
  ],
  [
    "Concordia University",
    "Rozahegy, Mark",
    77,
    [
      "Rozahegy is friendly and has good energy, more philosophy prof than english prof. He's very smart but his lectures are hard to follow, he's all over the place and his board notes are not comprehensible. Wish he would give more expectations for paper because its not clear, hard to get a good mark. Would take again now i know how how he teaches",
      "Mr. Rozahegy is a really cool guy who tries to make sometimes boring topics as interesting as they possibly can be at 8:45am. Grading consisted of 3 short essays that were based on the books we had to read for class. If you don't like to read this is not the class for you. If you do, this class is an easy A.",
      "Mark doesn't use powerpoint for his lectures and he can make some weird jokes, but I thought his lectures were clear and that he was funny! There were no tests, only essays, and if you went to see him with your essay draft during his office hours he was glad to tell me what I needed to change. I'd take him again! Very in touch with his students.",
      "Professor Rozahegy is a solid prof. If you are interested in literary analysis and some soft philosophy, this course is for you. Aside from being an understanding and compassionate human being, he is an extremely fair grader. Work smart, not hard. Do the important readings, listen to lectures for general ideas. Ideal elective class",
      "I took PHIL 236 Environmental Ethics. It was the best course I've ever taken in my life! If you are interested in environmental issues, take this course! You probably won't get an A but a totally changed worldview. It is incredibly refreshing, coming from business taking a phil course. It is insane how impactful this course was on my way of life.&lt;3",
      "Mark is great! He grades you on three small essays and that's it (on your choice of books!) His lectures can sometimes be a little dry, but overall he is there to help you. I'm taking another one of his classes this semester! Great guy.",
      "He is one of the best!",
      "Professor Rozahegy is the most patient, helpful professor I ever had. He responds to his email and is willing to take a look at your work before you submit the final version. He is very clear with what he expects for essays. I personally enjoyed his classes, he has his own sense of humor which made typically boring English classes more bearable.",
      "Prof. Rozahegy isnt perfect, but hes very human and I appreciate that. we looked at the texts through one general lens throughout the semester; it really drove home the concept of technology as a system, and has changed the way i think. what more could you ask for in a class 3 papers, might be hard if philosophy isnt something you grasp easily.",
      "Mr. Rozahegy was awesome. I very much enjoyed his philosophy course on death and the phrase he uttered on the first day of class when explaining why he left science to study philosophy still resonates with me; \"I cannot express the world in numbers.\" The material is a bit difficult but worth it if philosophy interests you. Would take again.",
      "okay teacher, not bad not good. IF u work hard you can get the A",
      "He is a good teacher but make sure you know exactly what he wants for assignment and paper as he is a tough grader if what you wrote is not what he wanted.",
      "Fun",
      "Funny and helpful! I improved a lot.",
      "Funny guy and very interesting lectures but most people in the class who's major isn't in the humanities struggled. Philosophy is like learning a new language and to get a good grade you must fully grasp the ideas and write about them clearly. However, he is very helpful during office hours and will walk you through how to organize your essays.",
      "He's a funny guy, he is not old school at all so you wouldn't get bored in his class. I made the mistake to not buy the book, although he uses it a lot so it's a must have. He helps with the assignment and gives a chance for a redo. I highly recommend it to everybody. Grammar classes are supposed to boring, he does a pretty good job changing that.",
      "I love him. I always go to his office hours and asking him how to write properly. He loves changing voice, which makes me love his class! He is not an easy marker but you can go see him before submitting the assignment. He is not strict with due date as long as you do the homework. Quizzes are not easy but prepare u well for the final. Recommended!",
      "absolutely brilliant and hilarious. Come to class with a blank mind and allow him to teach you! Even if some of your essays may be graded low, there is plenty of room for improvement! Stay positive :-)",
      "I do admit that Mark is vey nice. However, as an intensive summer course, he made it completely challenging. He asked us to read 5 books and other articles posted on the library website. Then, we had to write 4 short papers during five weeks. I considered such workload extremely heavy and unreasonable. I eventually dropped this course!",
      "Mark is the best prof I have had in Conc. He knows his stuff more than he should, he is helpful and an awesome guy overall. Go to his office hours and he'll help you as much as you want if you care for the course. I adored the course!",
      "I like this professor. I always met him during his office hour. I liked to ask him how to write an essay properly. Try to make more communication with him, and you will be fine. I got B- in ENGL 210. The highest grade I have ever had in 6 English courses including ESL.I'm very happy. However, there was no A+,A students. The highest grade was A-.",
      "Prof. Rozahegy was good at generating curiosity in the material. His descriptions were vague at times but that probably has more to do with the course material. He is stellar in the office hours and is more than capable of clarifying concepts. He is also a funny and relatable guy, someone you could see yourself having a beer with sometime.",
      "I would go out of my way to take another class with him, very passionate, very smart. Id recommend going to his office to talk with him, he's very open to having long discussions and it will help clarify any doubts. He's also a nice guy, let me take an extra week to hand in an essay.",
      "Prof. Rozahegy is one of the best philosophy profs at Concordia. I've taken five courses (PHIL 226,265,275,377,398) from him and each one has proved highly enlightening. He is not a strict marker and is always engaging in class. He also uses the blackboard quite a bit. Pay attention during lectures or you'll be lost! Very flexible office hours.",
      "Very approachable. Work hard and you'll learn a lot/do well. Shows you HOW to break down literature. Pretty straightforward about what he expects on essays, however his diagrams can be confusing. Jokes were also sort of lame, but overall, good prof. No BS.",
      "Just as philosophical thoughts are all over the place so is he. However, he is great and very open. Do the reading because he wont make sure you did them until the paper submission. Great philosophy class.",
      "Excruciatingly funny, knows what he's on about, passionate, masters course material, to the point. Best prof I've had yet.",
      "Good prof who obviously enjoys his job. Easy marker and he knows it. Does a good job trying to discover poetry with the students. Lots of participation. Too bad the subject is so boring to me (poetry analysis), but I got more out of it than I expected to. Don't hesitate to take a class with him, it will work out.",
      "I liked this guy, he's not the &quot;almighty eng prof&quot; like a lot of the other ones, there's something genuine about him. Material is clear enough, solid grader and makes funny comments. Loves to say the 3 words of &quot;in terms of&quot;",
      "Had him in Engl 207. Easy course but was made ridiculously easier by him. He'll tell you lots of stories of him getting into the military and may try to introduce you to philosophical stuff but there's nothing to worry. Has genuine sense of humour. Enjoy the ride while you can: he's a very easy marker compared with other engl teachers I had !!!!!",
      "Really fun prof, helpful. entertaining classes (his mental struggle is the same as yours!) It was a great intro class. Lots of reading though, but as long as you stay on top of it and highlight your text, you're good!",
      "Warning! This course is all about Heidegger. For your own piece of mind, get a taste of Heidegger before taking this class; many people end up hating this course because they just don't understand the readings. He's a good prof, he puts a lot of effort into his class. Fair marker if your capable of articulating the material.",
      "Had him for Metaphysics. Although we were absorbed in Heidegger, I will not hate on this professor. His only pitfall is his scattered blackboard writing. Regardless, you can tell he put effort into clarifying these difficult texts. He is also a good comedian with a nice touch of self-deprecating humor. His imitation of students was good, too.",
      "I've never been the same since. Everything in the world feels less exciting and less volume now that he is gone from my life. I looked forward to his classes more than I looked forward to going out with my friends on the weekend. Anyone who experiences the gift that is his presence, is instantly wealthy with magic. He IS my metaphysics.",
      "Absolutely terrific proffesor. His teaching style is directed at elucidating concepts: nothing else. Extremely smart, and brings his own philosophies into the picture in a very appropriate way. I wish every proffesor was this good.",
      "best english teacher I have ever had!!",
      "He is exactly what every English teacher should aspire to be. His writing is atrocious and he's a little scattered, but he is helpful and likeable. He tells you exactly what he expects on papers, and will let you rewrite your lowest grade. He actually helps his students improve and wants them to do well-imagine!",
      "mark is definitely one of the best. his lectures are interesting all the way through, he is funny and charasmatic, genuinely interested in the success of his students, easy marker, & extremely knowledgeable. he's scattered & goofy, but never misses the point. if you make a point to contact him before papers he will tell you exactly how to get an A.",
      "Excellent prof. The lectures are engaging and very intelligent. It's great to have a prof who doesn't assume we're a bunch of idiots. Highly recommended!",
      "true his blackboard style is totally chaotic. other than that hes top shelf.",
      "This guy is a genious! Not what I was expecting for an introductory class. but it was pleasantly surprising. 3 well written papers are all it takes to get an A. His diagrams are really helpful, confusing at first but wait until he's done and then write it all down...he puts off erasing the important stuff for most of the class so it works out.",
      "No Comments",
      "charismatic, funny,really appealing. lectures are interesting and engaging.",
      "total babe. really intelligent.",
      "haven't gotten any papers back yet-so i don't know what his grading style is...but his in class lectures are interesting and fun. He's a captivating speaker, good at breaking down dense theory into something comprehendable. And he makes really cute jokes.",
      "Great prof! The subject matter was intense and borderline incomprehensible, but he made it thought-provoking and easier to grasp. He's an enthusiastic and engaging professor and not to hard on the eyes either.",
      "Dr. Rozahegy is a dynamic, intelligent, passionate teacher. This course was more engaging and challenging than any other I have taken. Chats during office hours were very helpful. His black board notes are a disaster; paraphrase! He circles around and revisits difficult concepts; sometimes confusing but ultimately effective.",
      "I like his teaching style actually and he is a dynamic speaker which is a nice change. Haven't gotten any papers back yet but the class isn't boring and he is obviously possesses a great deal of knowledge within his field.",
      "not a great class if you really want to think for yourself, but very easy. he goes over everything you need to know for your papers in class, and all you have to do is recite it back. only three papers and no exam - a tiny workload. a very nice teacher, interesting teaching style, and helpful during office hours.",
      "nice guy, reasonable marker and no exam. 3 papers is all you need to do and even if you bs the entire paper you'll likely do fairly well.",
      "he is such a nice teacher. very easy marker. i had no idea what i was write about and i got A's and B's in his class. not too much work only 3 papers all term. no final. his notes are very messy but a very nice teacher.",
      "Good prof, I'm taking his other philo next term. Has sort of a sweeping style on the board, lots of diagrams, trick: wait until the board is full and you have the whole picture in your mind before you write any notes down. i have an A+ in his class, and all you have to do is write 3 tightly written papers.",
      "I found him to be clear, although that wasn't everyone's opinion. He was nice, humble and fair. Not very conscious of the time though. Tended to be a bit late and go overtime, miss breaks etc. I learned a lot in his class though and enjoyed him.",
      "Everything that you write in class will be graded normal, but the take-home stuff will be graded very very strictly. Didn't quite like his way of teaching, but overall he is an OK prof. and he tries to make it easy for the students.",
      "Mark is so hot that I couldn't really pay attention to his lecture on Benjamin. I got hard on Habermas and I wanted to spank him on Spinoza. Take this guy's class ... he is smart and sexy!",
      "Great teacher, but if you wanna feel that you accomplished a whole lot, don't take him. He gives out A's like madman, and at the end, the class average is so high that if you got an A, you're most likely to be below average.",
      "in summer 2003 he was ****ing. he is funny but a very tough marker.",
      "Funny, friendly but still strict. Do what he expects on papers cause he's a tough marker. But he says clearly what he wants so it's not rocket science.",
      "Really funny, easy marker if you do what he wants. He's really fun.",
      "Fantastic teacher, take his class.",
      "Very funny teacher, hard marker but very helpful guy"
    ]
  ],
  [
    "Western University",
    "Bentley, David",
    77,
    [
      "TAKE THIS COURSE! You don't have to be a great writer so don't be intimidated. Bentley wants his students to succeed. The TA's grade the assignments and most of the essay topics have nothing to do with the works we study in class so you can get away with skipping a few classes. If you can, go to lectures. They are amazing! Definitely a favourite.",
      "Dr. Bentley is an amazing professor. He's incredibly knowledgeable, but approachable. He made my first year of university enjoyable, and he's an inspiration. I would highly recommend taking any course that he teaches because he is simply the best in UWO's English department.",
      "Having taken a lot of English courses on main campus Bentley is quite simply The Best. Its more intensive, but if you want the experience and to actually learn, he's worth it.",
      "This guy is really special. He knew basically everyone's name in a 100+ person class. Very passionate lecturer, really the right guy to be teaching about the beauty of language. TAs are pretty brutal markers, but if you take it up w Bentley he'll usually boost you. Always smiling, great sly sense of humour - just a great person and prof.",
      "Dr. Bentley would casually drop pop culture references which made his lectures amazing and funny. He knew what he was talking about and was insightful!",
      "He has a passion for what he is teaching like no other. He is extremely knowledgeable and makes what could be terribly dry course material into something interesting and engaging. You must go to his lectures, but it won't feel like a chore to do so. If you have decent writing skills, do the readings, and attend lecture you'll do absolutely fine.",
      "HILARIOUS. absolute gem. 1 of the best profs I've ever had. sweetest man alive, he will greet you personally even if you walk in late, funny lectures, makes boring stuff interesting and memorable. such an admirable smart guy. you absolutely MUST attend lectures. course has tons of essays which such but overall one of the bet profs I've ever had.",
      "Dr. Bentley is the only professor I had this year who took the time to learn each one of his student's names. He's extremely caring and is the best lecturer I've ever had (He would often get applause). This is the best course I've ever taken, and made my decision to switch to English very easy. You will NOT regret taking this course!",
      "Bentley is hands down the best prof I've ever had. He makes an effort to connect topics we learn to pop culture, uni, and life in general making class enjoyable. Bentley really cares about his students and is super passionate about his area of expertise. His lectures are amazing! The toughness mainly pertains to the TA who marks most of the work.",
      "Dr. Bentley is engaging, hilarious and passionate about what he teaches. He genuinely cares about his students and brings treats in on holidays. He is very approachable, sweet and recognizes all of his students outside of class. The course is difficult if you don't love literature or do the readings. He speaks softly so sit near the front.",
      "Genuinely nice man who loves to help his students. He is so passionate about what he does, and that passion will rub off on you! He even remembers the names of all his students (which is a lot) and will come up to you in public to ask you how you're doing. He has a super interesting past and can even make Shakespeare fun!",
      "He's super into pop-culture and will relate almost anything to Miley Cyrus and Mean Girls. But do the readings!! He uses a lot of quotes in his lectures to explain this ideas, so if you haven't done the reading or are unfamiliar with the text you won't know what's going on. Tutorials are super chill, and the test is easy if you went to class/read:)",
      "Hits you with the surprise joke every now and then that's pretty funny. Talks softly though, be sure to sit close to the front. Things he says in lecture are almost exactly like the exam/test questions, so nothing should catch you off guard.",
      "Super sweet. never even talked to him, and he already knew my name, remembered me when he saw me in hallway. His exams are fair, with lots of choice and the essays are worth very little at the beginning until you know what he expects.. He is hilarious and bought us pizza for after the final exam. he is brilliant and knows so so much",
      "Dr. Bentley is very amicable and approachable, and also a complete legend; you'll enjoy his course no matter what faculty you're in. Doing well in this course requires completion of the readings and regular attendance. Seriously, go to lecture, you will not thoroughly understand the material if you do not.",
      "Best class I've ever taken. Dr. Bentley is passionate, charismatic and inspiring. His lectures are so good that he gets a round of applause after each one. I sometimes get lost in what he's saying (in a good way) because it is THAT good, and then suddenly the lecture is over and you leave feeling way more knowledgable and enlightened than before.",
      "A passionate professor who gives amazing and hilarious lectures. His love of literature is so evident and it reflects in his students. There are many readings, so make sure to keep up. As well, he doesn't post lecture notes online so it's very important to attend lectures. Overall a worthwhile class.",
      "Excellent prof and he remembered my name right through the semester. That made me love him more. Very detailed but clear lectures so once you attend class and tutorials regularly you're definitely going to ace this one.",
      "Not an easy class, but I adore this man. He can be hard to keep up with in lecture, but he is incredibly entertaining. Very passionate, and also very approachable. The readings can also be tough to keep up with; my advice is to focus on the ones that you like and understand. Went out with us at the end of the semester (a couple years back); a riot!",
      "The man. The legend. If you care about life at all, if you are searching for meaning, or if you just love Mean Girls, then take one of his classes. First years looking for an English course: 1022 is tough but totally worth it.",
      "If you want to take a truely fulfilling course English 1022E with Professor Bentley is the one to take. SERIOUSLY!!! He has one of the most powerful presences of any teacher. He is very smart and passionate. He enjoys it if you come in and talk to him during office hours.",
      "hilarious teacher, always looked forward to going to his class, he actually learned everyones name in the class and cared so much. recommend for anyone who is at all interested in english!",
      "Bentley was absolutely my favorite first-year professor. He made English fascinating to everyone, and his references to Mean Girls and Most Popular Girls In School kept everyone laughing and engaged. Definitely take first year English with this prof!",
      "Bentley is my absolute favourite professor at Western. He is incredibly intelligent, a great lecturer, and so funny! He is also very friendly & personable, and it is very worthwhile to visit him in his office hours/talk to him after class.",
      "LOVE Bentley. He's such an amazing professor! I never felt like I was coming to class to actually study English, he made everything so easy to learn, His real life stories not only help you understand the lecture, but they are extremely moving. I absolutely recommend you take his class.",
      "I'm sure I'm not the only one who feels the need to break out into applause every time he finishes a lecture. He spices his talks up with modern pop-culture references that leave you giggling long after the joke it over. Despite the hilarity, he's immensely knowledgeable and passionate, and his excitement is contagious. Amazing intro to university!",
      "very sensitive to his students. understands the world we live in.",
      "Inspirational. That's it.",
      "Professor Bentley is amazing. By far the best lecturer I had this year. He is so enthusiastic about the course and his lectures make you look at the readings in unconventional ways. He is always very friendly and always stays behind after class to chat. His jokes are also legendary. Overall I would definitely recommend taking his class!",
      "Dr. Bentley was absolutely my favourite professor this year. He definitely knows his stuff, and is a really exciting and interesting lecturer. He's also hilarious and a really cool guy to talk to. You learn so much in his class and his lectures are really enlightening! I'd definitely recommend taking his class!",
      "Bentley is a great prof who has a genuine desire to help all of his students learn and succeed. He is easily the most passionate, intelligent and hilarious instructor I have had at Western. I am not in English but I always wanted to go to his lectures because they are so much fun and just to hear him talk.",
      "Dr. Bentley is a wonderful professor. His knowledge and insight is evident, his humor light, and his lectures informative and enlightening. His manner of lecture is the best I have experienced, and his class the most enjoyable. I highly recommend taking one of Dr. Bentley's classes.",
      "He made every class immensely interesting--my favourite university course so far! The concepts he lectures about are eye-opening, and the parallels he draws between texts are new and intriguing. Any English course taken after his is a let-down.",
      "Dr. Bentley has an incredible knowledge of literature and explains the material very clearly. He is funny, approachable, and he really cares about the students and even knew all our names! He made coming to class actually fun! I especially loved his pop culture references and how he took life lessons out of the literature. GREAT PROFESSOR!! A+",
      "AMAZING PROF. I have never felt so valued as a student in my life. He is not \"hot\" because he is nearly 9,000 years old....but you'll be in love with him by the end of term, just a warning.",
      "Bentley is definitely one of the best profs I've had and I'm not even an English major. His teaching style is very direct and clear, and also ensures that a class is never boring. His warm personality belies a decently challenging course, but if you work hard, it'll pay off greatly. If you're starting a major related to English or if you just hav",
      "Dr. Bentley is an AMAZING prof. He knows what he's talking about and his lectures are worth going to. Outside of class, he is extremely approachable and makes himself available, whether in person or through e-mail. He WANTS you to succeed in this class and is willing to help in any way that he can. MY FAVOURITE PROF. ABSOLUTELY OUTSTANDING.",
      "Dr. Bentley completely changed my attitude towards my university education. He is an amazing man and an amazing professor. I highly recommend taking his class. I wish he taught upper year undergraduate courses!",
      "Awesome Prof! Absolutely brilliant! Easily approachable and extremely helpful!",
      "Professor Bentley is everything that a prof should be: not only is he extremely accomplished (and really modest about it!) he is personable, funny, and in general, a nice person. BEST. PROF. EVER. He relates the literature to your own personal life. I felt like giving him a freaking standing ovation after every lecture.",
      "Bentley is my idol. I didn't know if I was going to take english as my other major, but after taking his course I knew I would. He's so funny and understanding! I e-mailed him when I had a medical emergency the night b4 a test and he replied with words like 'lol' and 'wtf'. Greatest prof I've ever had. Plus you can visit him whenever!",
      "Bentley is the best teacher I have ever had. He is inspiring, empowering, kind and has a great sense of humor. He is very knowledgeable and passionate about literature and poetry and his lectures are incredibly well organized and clear. He is respectful and he sincerely cares about his students and their futures. Absolutely recommended!",
      "truly awesome and definitely my favorite.",
      "This class was great! Prof Bentley knows his stuff and he is hilarious. He presents the material in a way that you can understand and makes it exciting. The assignments are structured so it is actually easy to do really well, and the term test helps you to get a high mark. Everyone I know who took this class loved it.",
      "Really enthusiastic, geniunely cares about his students...difficult to get an amazing grade though.",
      "He is honestly one of the greatest teachers I've ever had. An amazing lecturer, funny, engaging, and insightful. He inspires me to continue in English. I would recommend his class to anyone, whether an English student or not.",
      "Bentley is incredible: my best teacher ever. I thought that I might be disappointed with his class because of all the great things people told me about it, but it was all true. The readings are great and Bentley's lectures are AMAZING!!!",
      "Bentley is amazing. He brings in ties with popular culture to keep students interested and laughing. We applauded him numerous times. God I love that man. PS you can hang out with him in the grad club. and he's so nice!",
      "Da best!",
      "I love him! He's amazing. Best teacher ever. He's so much fun that I actually want to go to his class and feel bad if I miss one!",
      "Super fun!",
      "Wonderful teacher!!!!! Definitely my best prof in first year. He made English fun, interesting, and relevant to my life. He even made me love Paradise Lost!!!! I am majoring in English because of him. He's GREAT!!!",
      "I have just graduated and can honestly say that Bentley was by far the best prof. that I had during my 4 years at Western. He made me love English and gave me the skills to write essays on all the courses that I took later. His lectures and tutorials were AMAZING!!! If you go to Western without taking English 022 you have missed out!",
      "Extremely nice prof, cares about how his students are doing. Teaches concepts clearly. You can tell that he is a very intelligent man. Not a class where you can slack off. Exam is somewhat on the difficult side.",
      "Dr. Bentley is a well-organized English prof who lectures for the entire class. In-class discussions are kept to a bare minimum and he relates the literature being studied to its historical context. Best prof ever! Even tries to let the class out five minutes early!",
      "a scholar and a gentleman!",
      "Absolutely wonderful - every lecture when he finishes speaking i'm flipping through my text realizing all the amazing things he's just said fit so perfectly!",
      "Dr. Bentley is an awesome prof, and this was one of my favourite classes of the year. Dr. Bentley is very funny and very friendly. He also presents very interesting interpretations of the texts studied.",
      "absolutely loved this man! but be warned - if you think you love english after taking his course (and decide to make it your major)... make sure you realize that NOBODY will compare to his teaching. he misled me into thinking i loved english... but really, i just loved him! not an easy course but definitely a worthwile experience!",
      "022 was definitely my favourite course in first year. Bentley is funny, engaging, and very knowledgeable in his area of study. The TAs for this course were similarly fantastic.",
      "I can't believe you hsd the same prof. Dr. Bentley is AWESOME!! His lectures are not just worthwhile and interesting for content, they are witty and inspiring. He is incredibly smart and obviously LOVES literature. English 022 was the only class I looked forward to attending. Thanks to Dr. Bentley it was a great learning experience.",
      "He is a very good prof - funny, interesting, encourages participation and very down to earth. It is a little but of a more challenging class, but his lectures are very clear and it will definitely better prepare you for upper-year English courses.",
      "For the last time, he's from KENYA.",
      "Seems to have an affected, false British accent, and tends to go to obscene lengths to identify possible sexual subtext in every work studied. Other than these two points, he really is about as close to the perfect ideal of an English professor as you will encounter in a real world situation.",
      "Prof. Bently was an awesome teacher, and a class act of a guy. I highly recommend talking to him after class, just about life, course subject matter, anything! He's great fun just to chat with, and his lectures are clear, concise, and make a great impact. I wish he was teaching a second year course! Anyone in his class this year is lucky as heck!",
      "BENTLEY IS DA BOMB",
      "Professor Bentley is absolutely amazing... i don't even mind the fact that this isn't an easy course because he is that good. I reccomend this class to all, Bentley will ispire you.",
      "The guy is awesome-totally brilliant and eloquent, and has a GREAT sense of humour. and an incredible knowledge of literature, history, and philosophy. Every class is so amazing and inspiring that I bring friends to it who aren't even interested in English. Bentley is definitely my favorite prof.",
      "Very interesting. He will help students no matter what and is very informative in his lectures. He definitely gets you to think about the material. Plus, he has an awesome car! I found it difficult to get an A on essays. They expect a lot of you, but its worth it to take one of his classes.",
      "he is easily my favourite professor, and as a TA he's superb. brilliant man, and who doesn't love his jokes&#63; also, whoever said fake british accent... it isn't fake. he grew up in kenya.",
      "old school but with a wink",
      "He is a very good instructor. My papers were graded by a TA, so I can't give information about his marking, but as a person he is amazing.",
      "he is one cool dude!",
      "No Comments",
      "really great. english doesn't get much better!",
      "Best car ever!"
    ]
  ],
  [
    "University of Ottawa",
    "Tucker, Trevor",
    130,
    [
      "Really wants his students to succeed. You can tell he actually tries to make the subject matter relatable. Attendance matters so be sure to email if you plan on missing a lecture. He understands that life can happen sometimes so he's really considerate about that.",
      "Amazing professor!! He loves when you participate so participate, he will notice and be more nice to you and notice the efforts you put in! He's also funny. If you come to class and actually listen you will have no difficulty or surprises on the pop quizzes or wiring assignments! TAKE HIM! 100/100!",
      "just take his course. just do it.",
      "This man is a saint. By far my favorite professor and my favorite class. He deserves everything good",
      "Honestly the best teacher ever, he's so chill. Doesn't care if you don't do your readings. Easy grader. 10/10 teacher definitely take his class",
      "Prof. Tucker is a genuine guy with a lot of fun stories. He goes off on tangents which can be quite distracting. He is definitely a tough grader and makes you work hard to get the mark you think you deserve. I never bought the course pack but if you want a high A, buy it.",
      "Really great lectures; interesting; course was very easy to succeed in! He's really interested in student opinions, cares less about memorizing terms.",
      "Great prof, great guy. Very approachable, and focused on discussion rather than straight memorization. Interested in people's opinions, and loved to use anecdotes and reference (good) movies and music. Made lectures actually enjoyable, and tests + other marking was very fair. Participation matters, and pop quizzes announced 2 weeks before.",
      "Great prof. He is engaging and the course content taught me a lot. Quizzes and final exam were very fair. Only improvement would be his powerpoint slides which are hard to follow.",
      "Incredible professor. So much respect for his teaching style. 10/10 would recommend.",
      "He's mad cool and teaches very well. He also orchestrates a lot of class discussions which are cool (we would do them every week during the second class section). Would 1000% recommend, he's awesome!",
      "A really good prof - cares about his students, listens to concerns, and prepares you for the exams and quizzes. He goes through the slides relatively quickly so you have to keep up, but he explains the material very well. He's also really big on engagement and participation so class discussions are fairly frequent.",
      "Exams for this class are multiple choice and not super long (2 midterms: 40 questions each/1 final: 60 questions) Pop quizzes (2) are in the style of short essays No papers Show up to class because sometimes he mentions things and shows videos that arent in the textbook but are mentioned on the exams Super nice and funny",
      "In this class we had a few pop quizzes, two midterms and a final exam. All were SO easy if you went to class and listened. For the final exam, he sent us questions ahead of time and picked from those for the exam. Professor Tucker is so easy to listen to and tells personal stories that really help you remember the content. Love him.",
      "AMAZING PROF!!! if you have the chance to take him you need to! He gives great life advice in class, makes class completely apply to your life and makes the stuff interesting. he really cares about his students and loves the stuff he studies.",
      "Very funny, tells lots of dad jokes. Great lectures, and fair exams. Was willing to go the extra mile with students, and was very easy to ask questions or voice concerns to. Always gave us notice before the &quot;pop quizzes&quot;. Easily one of my favourite profs by far.",
      "Very interesting individual. Funny (in his own way), fairly easy grader. He is extremely open-minded. Did not buy the textbook for CMN2148 - and still passed with an A-... Would take again!!",
      "Trevor Tucker is a gem. His class was super fun, interesting and insightful. He has a great way of explaining things and I never fell asleep in one of his classes. I usually dont buy textbooks but I did for this class because he does base some of his questions on the text. He makes his pop quizzes/midterms/finals fair and easy.10/10 would recommend",
      "Amazing Prof, made lectures interesting and engaging. Midterm and final exam are all multiple choice. Easy A, would 100% recommend",
      "Prof. Tucker is absolutely amazing. Lectures are well organised and easy to understand and his expectations for the exams are clear! 2 Pop-Quiz Participation points 2 mid-terms Final : Gave 110 sample questions, 60 were on the final.",
      "Prof. Tucker is amazing! Make sure you go to class, do the readings, and study the vocabulary and you'll do just fine. Also be sure to go to class because he includes questions on the exams that are based on material only discussed in class.",
      "M. Tucker cares a lot for his students. It's very easy to have great notes in his class, even if English isn't your first language (like me!). However, he's a little bit disorganized when he teaches. For example, he can read the half of the first slide of the PowerPoint (information very clear on it) and after going to the third slide.",
      "Best teacher I've ever had. If you have the chance to choose him as your prof.. DO IT! He makes class so interesting and makes you actually want to go to class.",
      "He's honestly an angel, he'll make material relatable and super straight forward. Midterms are a piece of cake like you have to try hard to do bad on them",
      "Hands down my favourite prof, he always gives amazing feedback and is willing to help his students. I find his way of teaching very simple and straight to the point, which makes class interesting and actually fun lol",
      "one of the best profs uottawa has to offer! hilarious, sweet, an overall amazing prof. will tell you exactly where you went wrong on quizzes, genuinely wishes well for his students, and just an amazing guy altogether.",
      "Professor Tucker is by far the most helpful and kind professor I have had. He is a very good speaker, applies the material to real life which makes it easier to understand. He is very clear on exam and assignment expectations, and genuinely wants to see his students succeed. It's very refreshing to have a prof that actually wants you to do good",
      "At first I was a little disappointed with the lectures, they arent structured and his thoughts seem incomplete. But as the semester went on he got way better. He gives you the Qs for the exams ahead of time, and he was very laid back about paper deadlines and APA format, etc. You know because of that he really wants you to do well, which was great",
      "The classes are small so if you don't go to the lectures it's noticeable. He talks a lot about his personal experiences which I found great. He's really nice and will help you if you ask. There are pop quizzes, they're reallly not that hard. Would definitely take again. The class in itself is boring but he makes it more interesting.",
      "The textbook is mandatory in order to get a good mark in his class. He made the class fun and enjoyable, we laughed a lot in class. However, his exams and marking scale are harder than it seems.",
      "Great and fair prof! Never drags classes on. 2 papers, 3 pop quizzes (usually on the day the paper is due) and final exam (gives you the layout and picks the main essay question from two assigned readings). Bare minimum of the course is spent on grammar, he is more interested in great essays. Would definitely recommend this prof!",
      "Great prof!! Didn't drag the class on longer than it had to be and he made class interesting with his good sense of humour! Also very clear with his expectations and his marking seemed to be fair game!",
      "Great prof that makes english so engaging and interesting. Go to all the lectures. Very clear grading scheme, and always available to clarify or help you out on material. Textbook is a life-saver in this course. When in doubt refer to the textbook, it has so many guidelines and examples that will save you",
      "One of my favourite profs in university! He made a dry subject interesting, interacted with the students, and made an effort to learn names. Also, he kept lectures to the point and ended classes early on several occasions. Definitely a great option for ENG1100!",
      "He's a very nice man, and a good lecturer. Paper expectations were clear, and not graded too harshly. Midterm and exam were very fair (he loves examples in long answers!). It's an easy A if you've gone to class and done the readings. Interesting material too. Would highly recommend.",
      "Can't use electronics. The textbook is straight forward and helpful. The assignments are fairly easy, so are the two pop quizzes. Class did not last 3 hours always lasted two or less. He is really funny, nice, approachable. He gives you the final exam prior but with more choices. Overall great guy, hope to take another course by him again.",
      "So happy I took this class. Dr. Tucker's style of teaching allows you to think for yourself. Lectures are open dialogue and full of excitement (especially if you've got funny classmates)! I would definitely recommend a class with him. Learned so much about nonverbal communication!",
      "His classes are pretty standard - midterm, final, and pop quizzes for extra marks throughout. He doesn't allow electronics in class, so be prepared to write notes by hand. FUNNIEST prof I've ever had, such a pleasure to attend his classes! Apply the readings and lectures and formulate your own opinion, and you're golden.",
      "***CMN2132-A***(french student taking english class) Great Prof. Organised, respond to email quickly, shows that he cares for the students. Lectures are mendatory and You have to read almost the whole textbook. Exams are easy IF you do your reading. Class aren't necessary but somewhat entertaining. The catch : He gives random quizzes.",
      "Trevor Tucker is one of the best profs I have ever had! He is super enthusiastic about the course and is very much into class participation. Lectures are focused on class discussion and does not usually post any slides. Super helpful, funny, and interesting to listen to! He makes being in a 7-10 super enjoyable! Would 100% recommend his classes.",
      "Professor Tucker is by far one of my favourite profs at the university. His lectures are engaging and encourage discussion. Every lecture is interesting, and his teaching style actually makes you want to listen. He often cracks jokes and gives great examples, often referring back to his own family. I would definitely take another class with him.",
      "Trevor was a good prof but my only complaint is that he is unorganized. Often he ends lectures about 30 minutes early(sometimes even earlier) and then later on he is pressed on time. Overall, he is fair and if you talk to him he gives good feedback and helps you improve your essays.",
      "Overall, Professor Tucker is a great prof! He doesn't actually use his ppt slides in class. Instead he lectures the group and posts his slides after class. The course was really interesting and easy to follow along and take notes. Fair exams. I would take another class with him for sure! You can get by without the coursepack, but it's nice to have.",
      "I am not an english fanatic, but Professor Trevor Tucker made the class engaging by cracking the odd joke and was actually very helpful with my essay writing. We did not have too many assignments, but when we did he guided us well towards what he looking for. He solely focuses on writing and does not do too many lessons on grammar.",
      "Very clear expectations and encouraged discussion and NEW perspectives during lectures and DGDs. Gives great feedback! He sat down and went through my essay with me and really cares about his students and the subject. Grades very particularly on content but really encourages you think outside of the box!",
      "Best English teacher ever. The class has an informal, open inviting environment to it, and so does Professor Tucker. He is funny, approachable, and will give you endless feeding on your essays if you're interested. The expectations for the course and essays are clear cut, with a medium level of workload. A must take if possible.",
      "I loved this prof, he was funny and wanted to make it easy as possible for the students. He gave us the essay that was going to be on the final the day before so we could get there ready.",
      "Prof Tucker is amazing! He made Essay Writing a class you actually wanted to be in. Asks thought provoking questions and encourages class participation. Worked through your writing with you so that you actually improve. Definitely not the easiest prof for this class (have to put in effort and he marks content pretty hard) but you learn a ton.",
      "Professor Tucker is absolutely hilarious. Walking down the street you wouldn't be able to tell this guy is an English Professor at a university. All around a great guy and a really good teacher.",
      "Very interesting if you like the topic (of fine English writing); may need to open Facebook from now and then if you are not into storytelling. He is an excellent storyteller himself however and the best suited prof. to teach the seminar!",
      "Professor Tucker should teach all seminars. He moderates debate, fosters discussion, and provides clarity to complex issues. Incredible professor, incredible man.",
      "His teaching style is this course is Socratic (we sat around in a circle and talked most classes). The material was very interesting and he gives you room to address areas of personal interests in your papers. He really wants to hear what you think. Don't be afraid of the pop quizzes. They are pretty open-ended and flexible. Great class.",
      "AMAZING prof. Lectures were always entertaining - made funny puns and side comments. Go to all the lectures, doesn't post anything on blackboarde-mail. Highly recommend, all assignments and pop-quizzes were each (95%- 110%)",
      "Avoid if possible. He thinks your communication classes are English classes. Marks essays tough.",
      "If you go to class, put in effort, and do the readings you will get at least a B+! One of my favourite professors by far and would take all my classes with him if I could. He's super sweet and cute too ;)",
      "If all classes were offered by him I would not mind going to every single one of my classes. He was so helpful, extremely friendly, very knowledgeable and he loves talking about his family; which was really cute! I would be excited to go to his classes because he was always interesting! Really cares for his students; TAKE HIS CLASS!!!",
      "For such a dry course, he had interesting lectures and kept my attention. It was the one class I looked forward to attending, and did learn a lot. I actually learnt more about writing an essay with him than I did throughout high school. Mediocre marker, gives good grades if you're creative. Has office hours and is willing to help. Very funny!",
      "I really enjoyed his lectures. He made jokes and related well with the students. He was very clear and specific on what he wanted. He's a tough marker, but he's fair. You need to work hard to get a good grade in his class.",
      "This professor managed to turn a dry topic into one that was extremely fascinating . His jokes help ease students and his openness to discussions is also quite refreshing . Pay attention in class and you should be good . Would definitely reccomend .",
      "Professor Tucker is amazing! He makes the boring English class fun and motivating. Though he is really tough on the correction, you will learn a lot from him. He rewards those who listen carefully to what he says by giving hints, so pay attention!",
      "Great prof. Made the class fun!",
      "Great English prof, he makes it clear of what he expects on assignments and is interesting to listen to. He seemed to give high marks to people who were creative with the assignments. Course was very easy too.",
      "He is one of the best English teacher Ive ever had. He is really clear and helpful during lectures. He cuts friday night classes shorter, but still covers everything he needs to cover. His assignments and quizzes are straight forward and you know exactly what you are expected and HOW TO DO THEM. My TA was a really tough marker, but class is easy",
      "Made a boring course interesting with his dry humor and personal stories. Also made the content easy to understand, and had no problems if you had any comments or concerns. Really fair marker, you'll do even better if you have original ideas. He is religious and obviously has strong opinions, but is still very open minded. Easy & great course.",
      "Such a boring class...he made the lectures super interesting though with funny stories about his family which was cool. I had the DGD with the TA who marked super tough, kinda wished I had him but whatever. Good class to take!",
      "Very good prof. Takes a very dry subject and makes it more engaging then it should have been. Also is pretty funny, and makes a few jokes and tells pretty interesting stories, that are irrelevant to the course, but nevertheless entertaining.",
      "I had him for business english.. he's a fun prof, not strict at all. My only issue was that it seemed everyone was getting similar grades regardless of the amount of effort u put in your work. His tests were not hard but he can be a tough grader at times. Overall, pretty good prof.",
      "Very funny prof :) I got higher marks in this class than I did in high school english. He made it pretty interesting!",
      "Class is very repetitive, and boring. But that's the content, his teaching is great. He gives good examples, a very approachable guy, has the odd funny joke, marks easy, but the repetition made classes very hard to attend.",
      "Had him for Business English on Saturdays and was totally worth it!Best prof of my 1st year in business and funny thing is he's not even a business prof.Laid back classes, easy quizzes and assignments.Read the textbook because it's very helpful.He not only teaches English business but also how to conduct and live in society, be a good human being.",
      "Great prof! Very helpful and super nice too! Explains things really well in class and he'll tell you his expectations. He actually made the class a lot more interesting than it is. Learned lots too. Thank you professor!!!",
      "Class was very laid back. Fair marker. Nice guy!",
      "Super easy quizzes, easy but lengthy final exam, easy going professor",
      "If you do poorly in this course, drop out of University. The easiest marker I have ever ecountered. Lectures were laid back, relaxed, and a useful refresher for people such as myself who did not pay attention in high school. He will let the class out early because &quot;it's friday&quot; or &quot;I'm in the Christmas spirit&quot;. I highly reccomend him",
      "Very nice teacher. Super chill. Sometimes will not show up to office hours but still really nice and willing to set up actual meetings with students. Marks fair. Is super easy going!",
      "Overall he's okay as a teacher. Not my favorite, but he's fine.",
      "honestly I couldn't bare more than 1week with him.could'nt stop bringing **** topics up towards religions.he should be more careful to notice he has all religions in his classroom whether minority or not.cracks white jokes up but it ain't funny.overall lame class.I do NOT recommend!",
      "Made it fun",
      "Great Prof. Made an otherwise dull english class enjoyable. Easy marks for originality and style as well as personality.",
      "He is really funny and makes this class entertaining when it's not.",
      "Made a boring, mandatory class really interesting and bearable. He's very easy-going and appreciates a good sense of humour. Lots of interesting and funny digressions. An easy A if you do the work and write with personality.",
      "Hated english prior to his class but he gave me a new found love of english and I loved him. The coolest and most chill prof I have ever had.",
      "This will be the best class of your semester. It's been said a million times here, but he's so laid back. He'll let you out an hour early sometimes. He really does know what he is talking about too. You will learn a lot from him, about English and life, and you'll actually enjoy yourself. If you get Trevor, consider yourself lucky. Amazing prof.",
      "Really chill teacher- I would take his class again in a second! Really laid back, fun, up to date with &quot;kids these days.&quot; Learn a bit bout English and a lots about random stuff. Really enjoyable! I RECOMMEND HIM!!! (On halloween we analyzed THRILLER and the different rhetorical devices used in it... too fun!)",
      "TAKE HIM!! he is sooooo funny and laid back. if u really want to learn english, dont take it with him. but if u want A, take tucker hes awesome",
      "Very funny and engaging. Would take any of his classes.",
      "Great prof, made what could have been a deadly boring class truly fun and entertaining. Very engaging, open and willing to talk to students. Pretty easy marker and offers lots of constructive criticism. Definitely take a class with him if you get the chance!",
      "Solid prof, made lectures fun, pretty funny, marks were fair, highly recommended!",
      "Amazing prof., he is one of my favorites!! I would recommend him to anyone. Hopefully I'll be able to take another one of his classes.",
      "an awesome teacher. very funny. I wish i could take his class again. :)",
      "From what I hear, BY FAR the best ENG prof to have for 1100. Made English fun! That's right I didn't know that was even possible but it's true. A wonderful man, very helpful. Papers/Exams were very very fair. Highly Recommended!",
      "Very very good prof... very funny, very encouraging. Great guy, encorporates life lessons into his class. Love this guy!",
      "Tucker was awesome, he made me laugh and overall he was a good prof...didn't really like the TA too much, but it was a solid class",
      "it was an essay writing class but he managed to make it really interesting...i'm not sure what else he teaches, but this course was really good",
      "A great professor - doesn't just want you to get a class, but an education. Literary criticisms to life lessons, he's got it all.",
      "such a sweet teacher, amazing guy. Got to watch live aid, and an episode of nothern exposure for some weird reason. lol overall great prof, sweet class, but i have herd from other people their essay writing class sucked, so take it with him",
      "Great professor. Manages to take a largely uninteresting and dry subject and make it both palatable and comprehensible.",
      "awesome prof!! i had tucker first semester, and he's my favorite university prof yet... take his class if you get the chance.",
      "Excellent teacher, very helpful, easy marker. Many of my 3-hour classes lasted an hour and a half tops",
      "I couldn't believe it when I saw a green smile beside his name. I found out why after reading the comments. There is a major correlation between the amount of spelling mistakes in the comment and the mark Tucker got from that person. If you have a working spellchecker on your word processor then you’ll likely enjoy his teaching.",
      "He's a very good teacher! He's funny and interesting. He actually cares that you understand what he is trying to communicate! A pleasure!",
      "Nice guy, laid back, funny, starts almost every class with a story. Made the class interesting. My writing definitely improved.",
      "Great prof! Interesting and laid back with the class. Easy marker, unless you're stuck with one of his TAs.",
      "Awesome Teacher! Didn't think that the class was going to be interesting before I started it, but he's very interesting and funny at times. Very informative and a fair marker. Like his personal stories as you can relate to him. Really, Really good writer and awesome person in general. Can you edit this blub for me&#63;",
      "Really nice guy, easy to follow, and is a good speaker.",
      "Great prof...would start the class off with a personal story. Was easy to listen to and very helpful. Only taught you what you needed to know and didn't waste your time with useless information. I highly recommend him as a prof.",
      "He is very nice and helpful, and puts a lot of effort into getting the class involved and making sure people understand the material. At the same time, don't expect a good grade if you are an illiterate idiot - go back to remedial. Tucker is definitely preferable to other 1100 profs.",
      "Prof Tucker was awesome, i loved going to that class even if it was at 8:30 in the morning.",
      "I LOVE TREVOR TUCKER!!!!",
      "Had him for essay writing. Thought he was a fair marker, liked how he got the whole class involved. For the good or bad, Felt more like a highschool class than university course",
      "I'm not sure what everyones talking about, I thought he was really genuine and nice. I got an A+ in this class. You can only make essay writing so interesting...",
      "Rude, Arrogant man.",
      "have fun in his class..nice prof, not so demanding..knows what's best for his students"
    ]
  ],
  [
    "University of Calgary",
    "Wiens, Jason",
    142,
    [
      "Fair essay marker. Tests are difficult and he's a harder maker on tests than with essays. Nice guy, willing to take the time to give you feedback when you need it. His choice of readings do tend to be dry though.",
      "Dr. Wiens' class was not easy, but he is one of the best professors, in my opinion, at the U of C. Not only is he hilarious, but he clearly cares for his students as well. For an extremely boring Canadian lit class, he made it as informative and entertaining as possible.",
      "Dr. Wiens is an incredible professor, he is passionate about his field. As far as English classes, Wiens' class is pretty standard.",
      "Professor Wiens is the best English professor I have had the pleasure of being taught by. He's a true inspiration and shares a true love of literature and knowledge. Love this man.",
      "Jason is a great prof who is passionate about his course material. In his papers, he grades more than fair as long as you provide a good argument with evidence, even if he disagrees with the argument as a whole. His exams, on the other hand, are a little more tricky. You NEED to read everything assigned with detail not just skim the basics.",
      "My favorite professor! Dr. Wiens is a fantastic teacher that makes you work for your mark in a way that demands respect. He has a great personality and is willing to help students without overly babying them. There is a lot of reading to be done and he keeps you astute through various quizzes. I can't wait to be in his other classes. Worthwhile!",
      "Loved him. I aspired to impress him because he inspired me so much. Really expressed his genuine feelings and thoughts on literature. Very human and I can easily apply all I learned to my everyday life.",
      "One of the best English professors at UofC! Wish I wasn't in my last year so I could take more classes with him! I don't really agree with the hard marking comments though... Except that it seems to be true that he does not like to give out As. I got an A- on both of my papers but he had no criticism or reason why it did not deserve an A.",
      "Wiens is a good, funny teacher and his class discussions are interesting and really insightful. But he is a hard marker and seems to find it hard to give As but without good reason. Ie, for the digitization assignment, worth 10% the maximum one could get was 9%. There is a LOT of reading, and pop quizzes about them, so missing readings is not good.",
      "Wiens is a good teacher, he makes it absolutely clear what he wants from students. If you attend regularly and take good notes you should be able to do well on his tests. While attendance isn't mandatory there are participation marks and quizzes that are substantially weighted. TL;DR He's great if you show up and pay attention.",
      "Dr. Wiens is a great professor. Careful, though, he wont hold your hand. He has high expectations when it comes to essay writing and idea development. His lectures are interesting and he relies on class discussions to really get to the heart of the piece, so dont miss class. His archive project has been my favourite university assignment so far.",
      "This was the toughest class I've ever taken, and though I'm used to As I only managed a B- while working my butt off. He knew his stuff and lectures were interesting but the quizzes were unrealistically tough, and the final was the final exam from hell. The stress was nowhere near worth it.",
      "Jason is an excellent professor! His breadth of knowledge is admirable and he really cares about Canadian Lit. His archive projects and in-class activities are an excellent way to learn and get (easy) marks. Though he does have pop quizzes on the readings as participation. Either way ask for help, stay engaged during class, and you'll pass easily.",
      "Dr. Wiens is amazing. He doesn't give out easy As - you have to earn them, but if you keep up with reading and study the lecture material thoroughly, you will get an A. He provides a solid foundation in English lit - concepts, theories and criticism. Super smart guy, interesting lectures, uses humor well, respects his students' ideas and opinions.",
      "Dr. Wiens is a fantastic prof. The class was very interesting (especially since this time around the topic was superheroes) and he knew how to engage students and make us laugh. Since pop-quizzes make up your participation grade it is mandatory to attend every lecture but thats really not asking much, this is university after all. Would recommend!",
      "Fantastic prof! I've taken 5 classes with Wiens, and I would take more if I could. He's hilarious, very helpful, and loves what he does. No, his classes are not easy As, but you'll learn a ton, and read some very cool texts. Two thumbs up!",
      "just read the books and make sure to take notes. he gives pop quizzes so don't be behind on readings.",
      "Dr. Wiens is a good prof overall. The final was a killer - tough, exhausting, and stressful. But, the course itself was great. He really enjoys Canadian lit, gets students involved with the archives, introduces good discussion, and tries to keep the attitude light. Be careful though as there are pop quizzes on the readings for participation grades.",
      "If you're a first year English major, I strongly recommend Dr. Wiens. Gathered from student feedback, the other literary analysis class doesn't prepare you as well moving forward. Participation is evaluated through pop quizzes, therefore, it is in your best interest to keep up with the text. On character, Dr. Wiens is humorous and understanding.",
      "Interesting and entertaining lectures. Great class discussions in his smaller classes, he respects and encourages different opinions and perspectives from students. Picks great texts, extremely knowledgeable about Can Lit. Highly recommend.",
      "Fabulous prof. Lectures are super interesting and often funny, very engaging. Wiens is the King of Can Lit - he is extremely knowledgeable, really motivates students to learn. Very respectful and helpful to students. Has high expectations - if you attend class, keep up on readings, and take good notes, you will do well and learn a ton.",
      "My favourite English prof so far! Funny and casual in lectures and approachable. He doesn't post lecture notes so be sure to go to class or get them from someone else, because he tests on a lot of the terms he mentions. He's a fair marker, though his exams are tricky at times, and he gives out pop quizzes on the readings. Really enjoyed the course!",
      "I liked Dr. Wiens as a lecturer and professor, but his choice in reading material was not my bag. He seems to be into more abstract concepts, including poetry, experimental novels, etc., which I personally struggle with. If you're into that, I would highly recommend him. If not, make sure to attend lectures and take notes!",
      "Really enjoyed the english class. Go to class, do the readings and the tests will be easy. If your considering taking a first year english course at u of c take it with this prof. I managed to get an A!",
      "He's amazing!",
      "Hands down, one of my favourite english professors in this department. He's very knowledgeable and always has the best text/topics for class. The books he chooses are awesome. Definitely recommended!",
      "I enjoyed this prof. He was funny, casual, and he showed a genuine interest in the subject matter. His midterms are tricky and worded funny, but he marks fair on essays. Go to class!! If you don't, you won't do well in this class as he has pop quizzes and his notes aren't online.",
      "Fantastic prof! Keep up with the readings, and it's an easy A. His midterms are based on class notes which he does not post online (so go to class!), but the questions are fair. He makes classes enjoyable and is pretty funny! He's very helpful and is available if extra help is needed. Easy assignments, too! Very clear about his expectations",
      "LOVED his class. So nice, so engaging, brings a lot to the discussion and is open to questions and challenges from students. Always tries to accommodate students and chooses really good books! His classes are challenging but well worth it.",
      "This professor made me enjoy English. Prof knows most of the students in his class aren't English Majors and marks easy. I got a C+ in my first English class, this was an easy A. Only thing, you have to keep up with readings because he does pop-quizzes. Otherwise, the best English professor I could possibly recommend as someone who sucks at English",
      "One of the best profs at the UofC. He is so informed and shares his knowledge well, you can't walk away from a lecture of his without retaining some interesting and useful knowledge about the coursework or beyond the coursework. Communicates clearly, marks fairly, and is willing to help those in need. Humorous, kind and charismatic as well.",
      "Decent prof, kinda rambles but he's really helpful if you get lost. Kind of a pain about the readings but it is possible to pass without doing them. Tests were totally brutal... 70-80 on those but assignments got 85-90.",
      "Great prof who is always willing to help students looking to improve or understand a concept better. Choice of texts were great, and I really enjoyed the course. Recommend for sure!",
      "Dr. Wiens is BY FAR the best professor I have ever had in this university. He has a sense of humour, he picks great readings, puts notes up during crucial lectures so you know what to focus on and is a fair marker and super helpful. He has a participation grade of 10% but all you have to do is write mini quizzes and he drops your lowest mark.",
      "Wiens is one of my fave profs! He's attentive and encourages class discussion. He's great to speak with in office hours and provides alot of insight into the material. I found that he was an easy marker for tests and papers, but do go to class and keep up with the readings. He's a funny and interesting person.",
      "Wiens is great! Really interesting teacher with good choice in texts. I had him for obscene lit and out of every U of C English teacher I've had, he's the best for this subject. He's particularly good on the Canadian texts.",
      "A very helpful prof, and fair marking. Midterms are tough, but overall a good prof who is always willing to help.",
      "For an English teacher, he sure is unbiased and willing to regularly engage students in intelligent and ranging discussion. Lots of discussion happens in his lectures. Very respectful and good to get to know as a person. Only issue is an \"out of 5\" marking structure that gets tricky, but just on smaller assignments. Excellent choice, give him a go!",
      "He is a very nice prof and is always willing to help. He is a very hard/weird marker on essays. He is a good prof though, just make sure to read the book.",
      "Very nice guy! Dr. Wiens is super approachable. Assignment expectations can be somewhat unclear, but I think he realizes that so he's willing to help those that ask. Pop quizzes were taken as the best 4/5 so as long as you've kept up with most of the readings, it was you'd do fine.",
      "Dr. Wiens is a very interesting prof to listen to and provides help to his students whenever needed!! His exams are fair, but not super easy. Requires you to keep up with readings but the pop quizzes are fair in terms of the content being tested. Overall, a very good English prof who cares about his students.",
      "Awkward at times, but can be really funny. Make sure to keep up with readings as there will be pop quizzes. Interprets the text well and is very encouraging when you speak in class. A little unclear on the assignments though.. but overall recommended!",
      "Overall a really great prof, remembers your name, speaks unbelievably eloquently and provokes interesting discussions. If you do all the readings and pay attention in class you'll be fine.",
      "A good professor,presents course content relatively clear,class is sometimes boring,does not post class notes on blackboard so make sure you get them down in class.Make sure you read when you're supposed to,know your terms and you should be fine.A recommended professor.",
      "I have mixed feelings about this course. The texts covered were very interesting, but I found Dr. Wiens to expect a lot of reading, and was really unclear about the midterm format. Half the class failed the midterm and on the rewrite, the majority got Cs. The TAs were great though, so m/c tests were worse than writing papers for this course.",
      "Prof. Wiens is very approachable and kind but expects too much reading from his students. Although, he was my favorite prof. Funny, personable and remembers your name!",
      "Best prof Ever!",
      "Good prof. Explains books well. Grades easy. Take this with this prof if you are looking for a decently easy english course.",
      "i had wiens for a 200 level course, and didn't like him. but now that i've taken a 300 level course with him, i can see his brilliance. he always has a fresh, compelling perspective to share, and really knows his stuff about can. lit. he does have this awkward problem with eye contact and takes a while to mark, but definitely recommended.",
      "I've taken a class with Wiens before and I thought it was awesome. This class however was a little weird and I think it had a lot to do with his TA. She was a total moron that threw a monkey wrench into his whole teaching scheme. One can hardly blame the prof for crazy marking rubrics and late grades when the TA was the one doing most of it.",
      "I can't believe some of the negative comments on Jason Wiens. I'm an english major, and he is the best prof I have had so far. He is clear and super helpful, a really nice guy and a pretty laid-back lecturer. Reading was totally manageable in this class and tests were easy if you attended class. Would definitely take another class with him!!",
      "BORING CLASS EVER, and Joseph Andrews was he worst novel ever. Alot of the reading assignments were brutal to read, but the class was easy, if you read the book you will do fine on the quizzes. Get definitions, (need to attend class) causes thats what the final is. This class is pretty easy, but its pretty boring,also the amount reading was crazy.",
      "After reading one hundred pages a night of Joseph Andrews I wanted to kill myself the book is terrible and expectations are ridiculous",
      "This professor was one of the best I've had in University. He is accomodating, makes what could be a boring class fun, a laid back guy and considerate. He listens to what students have to say and remembers your name, not just thinking of you as a number. If you need extra help, he is definitely there. I would love to take a class with him again",
      "Dr. Wiens is very helpful and approachable, as well as knowledgeable and enthusiastic. He takes a long time to get assignments back, but he's very nice and funny and doesn't give burdensome assignments. Actually, he taught me how to use the library, which has helped me in other classes. He really does know his stuff. I would recommend him. :D",
      "Jason is a very good professor. Easily approachable and passionate about the subject. Takes him forever to get assignments back but is a fair marker. Overall enjoyable class",
      "What a great guy. He is very calm and collected, never looses his cool. He doesn't ask too much from students, and doesn't waste our time in class; if we have nothing to do there is no class. His final was very fair, just make sure you don't fall behind on the readings.",
      "So I actually liked him a lot. He had clear explanations, and actually a passion for the subjects, which helps tremendously. One problem is the years it takes to get assignments back, but not a big deal. He is the kind of Prof you could approach very easily. Overall, very well taught class, and a good experience. Thank you Dr. Wiens!",
      "AWESOMEEE PROF! Given, he hands assignment back very late and is kind of unorganized, but the man knows his stuff. awesome professor. easy tests if u study. just make sure you read all the stuff beforehand. fair marker",
      "Best professor ever. I've taken 3 courses with him, averaged about a B+ in all of them. Very smart, loves poetry. His classes are very interesting, discussions are awesome. He always has interesting facts for certain poems/books. He is a little slow getting back to you with emails, but if you can handle that, Wiens is awesome."
    ]
  ],
  [
    "University of California Los Angeles (UCLA)",
    "Allmendinger, Blake",
    27,
    [
      "Blake Allmendinger is a great professor who really cares about student's understanding and development. If you have any issues he is very easy to get in touch with either via email or during office hours. The texts are easy to read within the allotted time and Blake is available to discuss them throughout the week. Would highly recommend.",
      "Allmendinger is my favorite professor I've had in my two years at UCLA, and definitely the one that I've had the most personal contact with. It was easy to talk to him outside of class and joke around, but he was also really helpful with information. His lectures are funny and compelling, just like him. Take his class!",
      "Detective Fiction was one of the best courses I've taken in my college career. The subject matter is fascinating and entertaining and the lectures are interesting. However, the tests are extremely difficult and require creativity and a mastery of the concepts discussed in class in addition to your own theories and ideas. Tough class but worth it",
      "Prof. Allmendinger is professional but also funny & relaxed; you will look forward to each class if you read & appreciate witty humor -lectures are interesting & relate to real-life. Smart, helps you to become a better writer instead of simply going through the motions. TRULY CARES, there for students, responds promptly to emails even on weekends.",
      "Blake is absolutely amazing, especially if you're an English major! Prepare to read important texts and engage in intellectually stimulating discussions. He's always there for you whenever you need him and will ensure you succeed if you want to. He is straightforward in what he expects, and is overall a wonderful professor.",
      "Don't take the class unless you are an eloquent and fast writer. The professor grades on in class essays. You could learn more about the subject on a weekend by reading professional essays than you will learn in his class. Again, his class is a writing class.",
      "Hands down the best professor I've ever had. Incredibly kind, funny, and accessible. On top of all that, he puts together really interesting classes. I learned a lot, and had a blast doing it....he genuinely cares about his students. Take his class. Any of them. You'll thank yourself later, it's an absolute treat.",
      "Obsessed with Professor Allmendinger. He is THE most genuinely concerned and approachable professor I have ever had. Ever. Period. He cares deeply about his students. Plus, this class was outstanding...doing the \"homework\" (reading detective fiction novels) made me feel guilty because I enjoyed myself so much. Take this course. It's perfect.",
      "Fantastic teacher. Funny, insightful, and helpful. Responds to emails very quickly. Lots of discussion in class but will never pressure or cold call you into speaking in front of class. Also, very clear about breakdown of work and grades. Outstanding teacher. Did not do as well in the class than I wanted but would absolutely take him again.",
      "Allmendinger is my all time favorite professor! I have taken two classes with him and I would not hesitate in taking more! He is funny and makes the class truly enjoyable. He is very clear about how your grade breaks down and is always willing to help! He is also understanding if you don't want to participate in discussion. Love him!",
      "Prof. Allmendinger (most students just call him Blake) is an amazingly devoted, highly approachable teacher and mentor. His teaching style is very casual and he rarely, if ever, merely lectures. Some students, especially those who are not very independent thinkers and who require strict guidance, may not care for this style. I, however, love it!",
      "Best English professor at UCLA hands down. Smart, witty, and extremely dedicated. Hilarious and insightful lectures. Take his classes. You won't regret a second.",
      "He is an excellent professor. My favorite so far. He made class fun and interesting. I would suggest his class to anyone. He is very knowledgeable about his subject and is open to feedback. He is enthusiastic in his lectures and clear on his expectations. You know what to expect on tests and can always go to him if you need help.",
      "He is by far the best professor I have had at UCLA. He makes class fun and entertaining. He is very reasonable and approachable. He is clear on what he wants and what he tests on. Participation is not mandatory, but it can help if you are on the border of a better grade.",
      "I disagree that you have to speak up in his class in order to do well. I got an \"A\" and never participated in discussion at all. He says on the first day that participating helps if you are on the borderline for a certain grade but is by no means mandatory. This is by far the most entertaining class I have ever had and one of the best teachers!",
      "I just finished taking a course with him in Spring 2012. I haven't received my final grade yet, but I definitely have to that it was the most enjoyable course I've ever taken. It was extremely thought provoking, and I appreciated the different avenues of thoughts he offered. He was very helpful, and extremely funny and enjoyable.",
      "If you are quiet, I don't recommend this professor, and in fact would not recommend discussion-enriched courses in general. Allmendinger has been the most open-minded professor I have had as an English major at UCLA, and I appreciate having a professor who does not pander to his students, but raises them up to be equals at the table.",
      "Professor Allmendinger is a great, funny, and engaging teacher. I always looked forward to his lectures. I highly recommend taking him.",
      "He seems like a nice enough guy and is very available to give assistance. However, if you have difficulty participating in discussion, this is not the class for you. If you are very talkative, you will be happy with your grade.",
      "Professor Allmendinger's selection of novels for my American Literature class was very diverse and interesting. His lectures are insightful and he's very articulate. He expects a lot from his students and their writing. Professor Allmendinger is very approachable and I will highly consider taking him for another course in the future.",
      "i took allmendinger almost a decade ago. to this day, i still think back on the experience with great fondness. this guy is smart, funny, engaging and serious about scholarship. it's an honor to have the opp. to learn from him! show up, do the work and engage in the material at the level any self-respecting bruin should, and you will do well."
    ]
  ],
  [
    "York University (all campuses)",
    "Paolucci, Peter",
    145,
    [
      "Prof. Paolucci is a great guy who really wants you to learn and it shows. If you can get Prof. TA Tanya this course is perfect. This class was a bright spot in a really bad year.",
      "Paolucci is one of the most straight-forward profs I've had. Tells you very specifically what criteria you will need to succeed. my advice for his EN1001 course: take the 24 hr extension for all assignments. he tells you more in detail what he wants after the first due date, so u can go back and resubmit with his advice",
      "Peter is by far the best Professor i've had at York so far. His lectures are AMAZING and he even incorporates fun games in lecture. It is impossible to fall asleep because he makes Shakespeare so interesting. I really thought I was going into this course hating it because i'm not big on Shakespeare but he completely changed my mind! LOVE HIM!",
      "He's not a tough grader, he's a fair grader. If you talk to him before you submit an assignment he will help you immensely. I was able to skype him while taking his course and it seriously changed my life. I'm a better writer because of this man.",
      "He's a really hard marker, he doesn't let things slide. You realize though eventually, THAT'S WHAT YOU WANT! I feel like I've learned so much more in the little time I had with him for a teacher than I have for years. Honestly, Peter Paolucci is a blessing in disguise!",
      "Professor Paolicci expects a lot from his students. But I found the way he structured his class was really helpful to everyone. He assigned his essays early and gave students almost 2 months to complete the work. I was personally very grateful for this because I have a disability and it takes me much longer than others to think through my work.",
      "He is one of the best profs I have had and really wants to see you succeed. If you show up and make appointments with him he will respect you and help you however he can. He was very accommodating and was very respectful.",
      "Good prof, knows what he's doing. Tough but fair. Going to have to bust your arse to get an A, but it's well worth it. Prof is a bit intense at times, but it's only because of his passion toward course material. Sets up students to succeed! LeInvaluable learning experience.",
      "Professor Peter is alright. He doesn't post any online, however, if you do go to lectures most times his power points aren't clear on what you should focus on. During lectures he would get side tracked and its like \"okay sir lets move on to something important please.\" As long as you do the readings and go to tutorial you'll be fine.",
      "I'm so glad I had the chance to be taught by such a wonderful professor. He told it like it was and we knew we were going to have to work hard to get the marks we wanted. Paolucci pushed us to be our very best and even challenged us to surpass our expectations of ourselves. Thank you for this opportunity.",
      "Don't miss lectures or tutorials, do the assigned readings and a bit more, preferably before the lectures, engage with the tutorial leader and you'll do fine!",
      "His lectures were good. You should attend them if you want to pass. It was very clear what he wanted from you for essays. He encourages you to work on and develop your own ideas rather than regurgitating his views.",
      "He was an okay prof but this course was so boring, I would not take it again.",
      "it was fun",
      "Not only was he one of the most amazing, well versed and well rounded professors I ever had, he was also extremely helpful and didn't hesitate to provide me with an evaluation letter when I needed a non science professor for my American Medical School Application. I had no idea how complex and profound Shakespeare was until Dr Paolucci's course.",
      "I've had him 3 times. By far the best professor I've ever had. He's tough, but fair. He's approachable and willing to lend the help and support if you need it. If you go to class and do the readings there's no reason you can't do well. His assignments and exams are straight forward and open book. Best prof by far.",
      "I had this professor for two classes. If you ask for help, he'll give you a lot of it. And he's approachable. His assignment directions are vague, so you must ask him to clarify if you want a decent mark. He is also a hard marker, and gives a lot of readings, so do not expect an A+. Good person, but not my favourite professor.",
      "The most amazing professor I have ever had so far, very clear during his lectures and when you emailed him questions, he would reply 1-2 days, in paragraphs for you to understand. If not understood he offered to go on Skype or meet for his office hours. Not monotoned, very helpful, his marking is hard but it's a good challenge. AMAZING!",
      "I cannot stress enough that students should take his classes. He is the reason I am still an English major and he is the reason I enjoy class. Fantastic lecturer and an unbelievable professor who actually takes the necessary time to help students when needed and he actually cares about his students succeeding and enjoying his class. BEST prof ever.",
      "He was absolutely a joy to have as a professor! He is extremely funny and very willing to offer help! Such a down-to-earth guy! He is not the easiest marker but he is not too tough either (at least I found this to be true). I am definitely going to take another one of his classes I learned so much and he is an awesome professor!",
      "Favourite Prof I've ever had.",
      "He is really tough. An A is more than possible, but he'll make you work for it. He is one of those profs you will remember for years. He will really impact you. If you can take his course without him as your TA - do it!",
      "This prof. really likes to challenge his students (in a good way). Editing course is tough as nails but you learn so much from this course that will open new possibilities and horizons for the future. A fair guy and just a real down-to-earth good human being. Don't suggest taking it though if you have a lot on your plate--very time consuming.",
      "Hands down, the best prof I have ever encountered. It is essential to come to class, but this is hardly a chore as his classes are entertaining, engaging, fun, hilarious, and knowledgeable. I don't have him as a TA so he did not mark my work, therefore I can't comment on this, but his lectures were an absolute pleasure to attend.",
      "Peter's lectures were very interesting. He added small stories and anecdotes to keep things interesting. As a TA, he was extremely helpful, and will go over your work with you. It hard work, but I very much appreciated his help. I suggest you take EN1001 with him!",
      "Great sense of humor. Like most English professors, Peter and his teaching team were NOT easy markers to teach a lesson in writing. However, he was very helpful and understanding: whenever I needed help, he was always available. If you're willing to put the work in, you should definitely take a class with Peter; you won't regret it.",
      "As with any English professor, he is definitely not an easy marker. However, if you follow his critiques sincerely, you'll get a pretty good mark. He doesn't skimp on comments for essays, so if there is room for improvement, he will show you the way.",
      "BEST-PROF-EVER. Always willing to help and look over your work prior to submitting, helpful feedback. Made class fun, he's an enthusiastic and passionate prof. Definitely taking more courses taught by him!!!",
      "he makes his lectures interesting and fun. clear concepts and would pause to take up questions in his lectures. all in all,AWESOME prof!",
      "I had peter for my FND course, he was amazing! He was clear and helped me understand what was going on in lecture, but also comparing it to my personal life. I recommend him 100% he was an amazing teacher!",
      "I had Paolucci for EN 1001 and I absolutely loved it! It's my first year in university and this course was extremely difficult but you will learn so much more than you know. Paolucci is an incredible lecturer and he understand the difficulty of first year. He's funny, charismatic, VERY intelligent and very clear in his teaching. Take his classes!!",
      "An interesting man, very enjoyable to learn from and attending his lectures are never a chore. This class however is extremely difficult and he marks extremely hard, so do not take this course unless you are willing to attend all of the classes and put your absolute best work in.",
      "Best Prof I've had at York!!! Extremely captivating, didn't recieve the best mark in this class HOWEVER was extremely intresting. (Too bad the TAs don't match) Extremely leniant, flexible with dates, and understanding. Highly reccomend Paolucci..A+++",
      "Best Prof I've ever had! He is honestly so interesting, it was hard NOT to come to class!",
      "if you think professors don't care about you succeeding, paolucci does, he was probably the most helpful professor i have ever had and i actually enjoyed attending his class, he was funny and loud and a good teacher. and a professor willing to help someone that is no longer in his lecture obviously cares about their success- best prof at YU.",
      "Best Professor I Ever had. Understand: This is NOT an easy A. However, if you put in the effort, go to lectures/tutorials and take advantage of paolucci's help (always willing to give) you will learn skills that will help you in future classes and in life. Plus his vampire class is super interesting and he is a great lecturer",
      "Lectures are super interesting and he uses a lot of online resources, so books for the class don't cost a fortune. There is no formal exam, just two in class tests, which are only hard if you have a problem thinking outside the box. He gives you the tools and teaches you how to use them, but you're expected to do your own 'building'.",
      "Awesome prof. He actually teaches you useful stuff. The course material is challenging but interesting and useful. Paolucci's also very funny and laid-back.",
      "Best prof. I've ever had! Peter is very funny, makes lectures FUN and very informative. I've learned more in this class than any other and I actually enjoyed it. He is very helpful, very nice to all students and just a great guy overall. Very smart. Not the easiest marker, but an amazing professor. I would take all his classes.",
      "One of the most charismatic professors I've ever had.",
      "He's an excellent prof - informative, knowledgeable, clear, & funny. I swear this guy knows everything *but* he's a pretty brutal marker (I have him as my tutorial leader, too). You learn tons in his class, just don't expect a high grade. Seriously.",
      "I hated his class, and didn't do well, but he is a great prof nonetheless! He helped me a lot, and his lectures are very interesting - though they do often go off topic. I recommend him for anyone who likes to have fun and learn a lot! : ))",
      "Gaberielle Sugar is a useless T.A useless, actually. She was a complete waste of my time. She does not have enough knowledge and experience to teach on of his courses. SWITCH TUTORIALS",
      "interesting class, and an interesting prof. extremely helpful and down to earth.",
      "Amazing prof. A bit challenging and a hard marker, but if u show u care and see him for help, you will do well. Friendy, witty and intelligent, most caring prof. at York. Have him as a TA to it will supplement the lecture greatly and you will understand things alot better.If you work hard and show him ur ambitious he will give u a great grade!!",
      "Peter is great!!!!!!!!!!!! HIS T.A GABERIELLE WOW BACK OFF! SHE IS HORRIBLE.",
      "Peter is wonderful! A must for English majors. I had him 2 times and each as been better then the other. He is a great T.A also, and is great at moulding his students to be successful. His T.A Gaberielle Sugar is horrible, has no clue about Peter and his material, she is pompous in marking, and explaining. Take the course LOSE THE T.A... just RUN!",
      "Absolutely fantastic!!! I learned SO much, truly insightful. Peter goes beyond all expectations. English majors do yourself a favour and take one of his classes. Your degree is not complete without it.",
      "Peter is one of a kind. Amazing man. always willing to listen and help even regarding issues outside his class. Very approachable and funny. good man, good teacher, good tutorial leader. very engaging.",
      "He is by far the most amazing prof i have had in university. I adore his english classes and just can't get enough of what he has to say, or for that matter the texts he chooses. For the people who are complaining...he's not going do the wrk 4 u, the point is to come to your own conclusions, if you do that then he'll never give u a bad grade...",
      "i liked this course although he was a hard marker and not too clear on what he wanted when it came to essays.",
      "Wonderful. Any class he offers take it! Work hard, go to class, ask for help. You will love it! York is lucky to have him.",
      "This class is a great english class! The readings are fair... not too much. Paolucci's a great lecturer.. his lectures are interesting. The exams are not based on lectures. Students must be insightful and think outside the box while writing essays. I hear Paolucci marks hard if u get him for a t.a. Try to get Ross C. - he's the easiest t.a. marker!",
      "Peter ROCKS!!!! If u are an English Major, do yourself a favor, take a course with Peter. He is smart, funny, engaging; his classes are NEVER boring!!!! AMAZING!",
      "his lectures are so intressting that no1 wants to leave after one hour. he's cool and oh so pretty.",
      "Most interesting class I ever took. I took his class about 2 years ago, and he still comes to mind when deciding on the best proff and my favourit class.",
      "Peter Paolucci is a fantastic lecturer. He is terse, verbose, poetic, senecan, and attican all within a span of two hours. He is a very tech-savvy instructor who will go to great lengths to make sure that students comprehend the material being taught. As a TA leader, he is a difficult marker. A low passing mark in his tutorial would probably q",
      "really really interesting prof! most interesting class i've taken in 3 years at york",
      "Had an awesome time in his course..... learned a lot.... adn he was always VERY willing to examine your essays or work and tell you how to improve.",
      "I had Peter for a Writers Workshop years ago and to this day what I learned from him has positively changed my writing skills. I went from being a C student to a B+ student and I can honestly say that a lot of it had to do with being more confident in my writing style. Thank you Peter! Definitely has a true passion for helping others succeed.",
      "Very engaging and animated lecturer who kept you interested in the course material. As a TA super hard marker - got to bust your ass for a good mark! Extremely helpful in terms of meeting to discuss papers, presentations or problems. Fantastic Class! Well worth the low marks!",
      "He is simply a great prof. It is evident that he loves his job, and that is refreshing to see.",
      "Amazing lectuerer! Keeps your interest throughout a 2-hour span. He's witty and intelligent. And, honestly, if you're a decent student who's taken enough English courses to know how to write a proper essay, you'll agree he isn't an unusually hard marker! Chances are you deserve the mark you get.",
      "hard marker, but great prof. most challenging class i've ever taken, but I probably learned more than in any other class. He knows everything, and may seem like he's off topic at times, but the point is that literature can take you anywhere, and you have to learn how to use it. i thought he was brilliant. it's not easy, but it's so worth it!",
      "Great prof., avoid him as t.a. (hard marker). Take any of his classes if you want to learn---he makes any topic interesting---ANY!!! Knows how to talk to young people and grab there attention. Best prof i've had at York and I'm in 3rd year.",
      "The lectures were really enjoyable and the topics are interesting. However, avoid his tutorial at all costs. He is a very hard marker and he doesn't provide a lot of insight on how to make your writing better. Good teacher, hard marker!",
      "A very nice man and good prof. A good sense of humour and I really enjoy his lecturing style. He's understanding, although he is a bit of a hard marker. He lets you know what you're in for at the beginning of the course (it gets harder as it goes on). The type of assignments seemed repetitive and painstaking, but all in all it wasn't too bad.",
      "Hes good one of all pro I've met.He always makes good viewing of the problem for you to fly up.",
      "No Comments",
      "Amazing Prof!",
      "if u're into the supernatural, definitely take this class! lectures are interesting; He really knows his stuff and knows how to draw in his audience. Kind of hard to get A's in this class though, but still, you learn a lot of things about vampires and werewolves -- it's well worth it! :D",
      "Love trivia, look forward to it each class...Too much history and interesting info about books covered, not enough helpful and useful information or analysis. Encouraged others opinion. All in all great Prof.",
      "One of my favourite classes. Prof. Paolucci was awesome. He really knows what he's talking about and delivers a great lecture. Exams are ususally essay style and if you pay attention in class and do the readings you should do well and feel like the class was both worth the cash and time.",
      "Excellent prof, makes possible boring course into a very interesting one.",
      "love his &quot;trivia for the day.&quot;",
      "Great prof. His lectures were excellent. Practical ideas on how to improve your writing, good resources to follow up with, mixed with a bunch of interesting trivia and a good sense of humour. The assignments weren't anything groundbreaking, but they were what you made of them.",
      "The assignments felt tedious, and the lectures were unorganized. He basically directs you to some very good resources (Zinsser's books and some websites). Glad I got a B, but felt like a waste of time",
      "Definitely knows the material he's teaching and you can tell he enjoys it too, which makes all the people in his class listen to him and enjoy it. Very friendly and approachable.",
      "Peter is a fantastic prof, try to make sure you're in his tutorial, you'll miss alot if you're stuck with a grad student. Make sure you make an effort in his class, tagging along for the ride will reward you with your well earned C-C+. Rather hard marker, but exceptionally accomodating.",
      "Amazing professor. one of the best ones I had and I was lucky to have him for two classes. he knows his stuff and he makes lectures interesting with funny facts and jokes. very friendly and approachable and very fair.",
      "Very funny.",
      "I love this class!",
      "Funny. Sharp. Fair. Easy to approach. Always open.",
      "Paolucci is a great prof.!!",
      "No Comments",
      "i like proffesor paolucci, the lectures are fun, he is postive, very organized, however, for a 3 month course, there is too much work, packs in way too much content, very intense assignments, i would not suggest taking a course for that reason, but it a shame bc he is a great lecturer,",
      "No Comments",
      "1-TOUGH MARKER 2-entertaining selection for course material 3-prompt reponse to email inquiries 4-accesible 5-favours some students 6-broad knowledge base to draw from 5-active within York admin 7-responsible 8-not a tight ass 9-tactful",
      "One of those Profs that think outside the Paradigm. He is very knowledgeable in many areas. Encourages Critical Thinking, something YorkU should get their profs to encourage. That is what U is all about.Critical Thinking! Great Prof! Great Class!",
      "i love hime very much, although his work is much, as long as you listen and do what he tells you , u deserve what u should get!^^",
      "he is not bad....one of the better profs,he s not hard but he does make u think to do ur work,so dont give him****ty assignments and he tries to make the lectures fungo ahead take his class",
      "Great prof, after three years at york, I can still say he has left a great impact. Very thorough prof, who tries to cover all angles of course, but make sure he's your T.A. or you will be lost! Really quick to respond to emails & online discussion groups.",
      "What a great Prof. He made class fun and he exlained things well. I'm glad he was my tutorial leader too. I actually did well in that class.",
      "Shakespeare was a great course. The professor is a very clear lecture. However, the marking is tough so if that is important to you dont take this course",
      "Great professor who makes every class interesting, and relates things to everyday life. He's very interested in the psychology of english, such as analyzing literature from a human perspective and not just a literary aspect. His essays make you think.",
      "He is just great. Very creative way of teaching. Makes you use your head, not just memory hence not very easy course. There are only few profs at York who have impact on your life and he is one of them.",
      "not bad. lectures wander. seems nice enough, though.",
      "Great Teacher. Great Guy. Clear in his expectations and interesting classes. Take his classes!",
      "a really great prof. he help's if you have problems and tries to make class fun",
      "He's amazing~~you can really learn sth from his lectures"
    ]
  ],
  [
    "Universite de Montreal",
    "Boro, Joyce",
    14,
    [
      "One of the best profs on campus! She is one of the main reason for my staying in university. While some profs offer a great learning experience, she offers a class that is both insightful and relevant to today's realities. I have literaly taken every single class I could with her and would have taken another had I not filled up all my credits.",
      "Best prof in the department!",
      "I loved this professor. She enjoyed teaching and the material she taught. She was extremely interested in her students' input. She encouraged dialogue and gave interesting lectures. She is definitely one of my favorite professors and I would take one of her classes again. She also grades fairly. You get the grade you deserve.",
      "Very interesting, very clear, motivated professor.",
      "this was a great seminar. boro is a refreshing change from other grumpier profs who seem more keen to show off what they know than to teach.she really seems to care about her students.",
      "A great Professor, very clear and very helpful. Easy to talk to, very intelligent and knowledgeable. Also quite beautiful... Definitely a favorite of mine!",
      "great teacher. i loved this class and all the others i took with her,",
      "great teacher! i can't understand why anyone wouldn't like her.",
      "I have taken many classes with Boro and it has come to my attention that those who tend not to enjoy her classes are neither prepared nor paying attention. Boro is a very thorough teacher. The key is to pay attention the whole class to not miss anything – she hand feeds the info but you have to be conscious to grab it.",
      "No Comments"
    ]
  ],
  [
    "University of Michigan",
    "Williams, Ralph",
    155,
    [
      "As you see here in the comments, when youre a one-of-a-kind entertaining and wildly intelligent professor, youre likely to generate a love/hate reputation amongst students. To me, Professor Williams was hands down (and hands up, those hands!) my favorite professor thruout college. While some students may prefer dull, I did not. An EPIC guy.",
      "One of the most intelligent men I've ever met. The course was hard due to the pure amount of reading, but so worth it. Go to office hours to chat with him about anything, and also to see his incredible, overflowing library. My friends and I quote him on a regular basis now... &quot;For the wind is very much up&quot;",
      "Ralph is a kind man and is of a rare breed of intellectual. One can learn a lot from him. However, it can be trying to engage in discussion with him. The papers are lots of work and seem to be unworthwhile. He expects a lot so it can be difficult when one isn't able to match that. Take P/F, such to maximize Ralph-time and minimize work-time.",
      "Very entertaining and insightful. He strikes me as the sort of professor who would have been brilliant when he was in his prime. He can now be unfocused and sometimes repetitive, but he's still great.",
      "Amazing professor! Life lessons learned. Took him every semester I could!",
      "I haven't met a more engaging man, I sat in on three of his lectures with a friend and I couldn't agree more with people. He is really smart, kind-harted, and a gentleman. He engages everyone with the respect you deserve and is willing to talk to any one, if I could I would take all of his classes",
      "Talk about a guy who shapes your college career--who shapes you for life. Ralph is it. One of the most genuine, enthusiastic, kind-hearted and dedicated professors at UM. I brought a friend from another top-ranked school to sit in on one of his lectures--my friend was floored. He picks great books and speaks about them with unparalleled passion.",
      "Professor Williams is great! I took \"Memoirs and Social Crisis\" with him and his insights have truly changed the way I think about the world. Great guy, there for students, and really passionate about what he teaches. Grading expectations were somewhat high, but he's the kind of professor you want to do good for. Lots of EC available too!",
      "This was my second class with Prof Williams and all I can say is I wish I could take a 3rd. He is an incredibly engaging speaker and steers discussion in incredibly interesting ways. I didn't only learn a lot about course material, but also about how to think. Even if you are not an english major, take a class with Ralph! You won't regret it!",
      "He's literally the best prof you'll ever have. He greets every single student in lecture every single day; he loves us that much and continually tells us how great it is to share time with us. I LOVE this class. We read memoirs about social crisis (slavery, holocaust, vietnam war, AIDS) and I honestly read all of them 'cause they were all great.",
      "Ralph Williams is one of my favorite teacher on campus. Both the breadth and depth of his knowledge is astounding. He's clear and enthusiastic and compassionate; I highly recommend taking any class with him. I read all of Paradise Lost for this guy. He is gold.",
      "Phenomenal!! Ralph Williams is so smart, so compassionate, and cares so much about his students. I've never met someone quite like him. I loved this class, and I was so sad when it was over. I had him as my discussion leader as well as for lecture, and that made the class even better. Our final exam was a discussion about Shakespeare at his house!",
      "Professor Williams is astounding. His insight and comments on Shakespeare's writing is truly inspirational and eye-opening. His insists upon making a personal connection with each and every student (he shakes everyone in the hall hands)! If you have the opportunity to have this legend, do!",
      "Ralph is a legend. I've never actually felt someone's passion for the material prior to taking this class. Even for works that I wasn't as interested in, he made it easy to appreciate them. I am truly honored that I had the opportunity to take his class this semester. If you haven't taken one of his classes, sign up now!!!",
      "I graduated from U of M 12 years ago, and randomly came upon this site. Dr. Williams is the single greatest teacher I have ever had -- including undergraduate, medical school and beyond. His brilliance, charisma, warmth and insight continue to compel me in my thirst for knowledge and understanding of the human condition.",
      "Kinda over-rated. He's not bad, don't get me wrong, but he's not the freakin' Messiah. A bit too tangential for me. I'd've preferred if he went into more depth in lectures. The overall structure is a bit disorganized, but not so much that it threw me off.",
      "Like everyone else has said, Williams is a fantastic professor. He is so incredibly inspiring, and he is an English department legend. He is so adorable, so compassionate, and assigns beautiful readings. Easily one of the best courses I have ever taken at Michigan. Even if you aren't an English major, try to find time to take Williams' classes.",
      "A very well learned professor who truly inspires. I left Memoir and Social Crisis feeling as I should hearing him lecture about tragedies: depressed. But it helped me understand the human condition and to be more compassionate. The books are long but the class is a breeze.",
      "I took Ralph Williams Great Books class in 1974 and will be forever grateful to him for inspiring in me a love for great literature. I have used stories about his teachings to encourage my now adult children to be great book readers. In my family, Ralph's influence has spanned generations. If he ever begins teaching again, take his class.",
      "Ralph is a legendary teacher - thats why i took the course. 2 papers on 2/5 books to read, 1 hour not even lecture per week - wish i could have connected more with him. He's epic",
      "Williams is my hero! Greatest teacher on Earth. So much passion. So much knowledge. Brilliant!",
      "Just wanted to point out that although he's retired, his brilliant lectures live on thanks to iTunes U. Check out http://www.lsa.umich.edu/english/media/. The lecture on the book of Job is one of the most thought-provoking I have ever heard. I hope that audio from the Primo Levi class finds its way onto the site someday, too....",
      "Hands down one of the best professors I ever took. His passion for teaching and erudition are unmatched. Speaks multiple languages, knows as much about Italy as most Italian-studies profs -- and he's in the English Dept! Also cares deeply about people and greets everyone with a smile and a kind word. In short, Prof. Williams is a treasure!",
      "I don't understand why people think he's overrated. He makes truly deep observations and is always kind to everyone. His enthusiasm for the topic is unparalleled. I'm really happy that I've been able to take his class before he retires.",
      "Absolutely loved this guy! I would show up to lecture just to hear him talk. I'd heard so much about him before entering his class, and he exceeded expectations. Sadly, he'll be retiring at the end of the term, but truly a class A professor!",
      "Best teacher at the university. He'll be gone soon, sadly. Take his class if you can!",
      "I just fell in love with him and his teaching style:) So glad, I took this class and had a chance to attend his BRILLIANT lectures. He is very nice to his students too and genuinely cares about them.I frankly don't understand why some say he is overrated.I feel sorry for everyone who will never take his class because he is retiring soon, if not yet",
      "You can't help but love the guy for his passion, personality, and brilliance. I found him to be a little too abstract at times, especially compared to the other two profs. I'm glad I got to experience him before he retires. He's enriched a lot of students with his respect for learning and learners.",
      "Prof. Williams is entertaining, interesting, and makes very good points. He's very authentic and the texts he chooses are actually interesting. He's helpful in office hours but the paper &quot;field topics&quot; he gives you make it hard to figure out what he actually requires.",
      "Williams is an awesome professor who is often called overrated by the masses of people who are here to just get their grade and leave, regurgitate and be content. But for those who truly enjoy their work Williams is an exemplary prof. All profs of other fields should consider modeling their style to williams.",
      "I genuinely appreciate Ralph's enthusiasm for the subject. He loves what he's teaching and is performing it so students can reach the humanity of the words. It's an intro Shakespeare class, so one shouldn't expect it to be too in depth, reading one play a week gets stressful, but overall enjoyable.",
      "Brilliant, and entertaining. He really knows his stuff, but his style of lecturing gets old by the end of the semester. He really cares about his students and wants you to do well. My only critique is the monotony that arises by the end of the semester. But overall, very, very good.",
      "Ralph Williams is the reason I live.",
      "He is truly an amazing person; VERY enthusiastic and passionate about his beliefs and teachings. He's the type of person you love to be around. Unfortunately, his lectures are kind of hard to follow.",
      "Engaging, dramatic, and passionate. Also a great guy and brilliant in more ways than one. But lectures are often wandering or so large in scope or deep in philosophy that they become difficult to follow. I don't recommend this class to those w/o some sort of religious background.",
      "Incredible teacher.",
      "This man is an amazing educator. It's hard not to be interested in what he's saying, and, let's be honest, sometimes Shakespeare can be a little dry. He makes himself available to students for help, and he is genuinely passionate about what he does, that much is obvious.",
      "I had Prof. Williams for several classes when I was an undergraduate. In my opinion, one of the best teachers ever! His extreme intelligence is undergirded by kindness and compassion. Ralph Williams was a great listener and gave good counsel during a real low period of my life. He's also a great actor, so enjoy his reading of texts.",
      "He is a great professor. Highly entertaining and personable. His Shakespeare class was one of my favorite class at Michigan, and I was a science major looking for something different senior year. It was perfect ... love the guy!",
      "Would definitely recommend. The course was an eye opening experience.",
      "outstanding",
      "The best prof on campus. Extremely entertaining lectures, and thought-provoking points. I took his class 2 years ago, and he still remembers my name. If at all possible, get in his discussion sections. I got to take my final exam at his home!",
      "No Comments",
      "Williams is by far my favorite professor I have had at Michigan. You can tell he's really loves what he teaches. I think majority of the students taking the class took it to see him in action!",
      "Marvelous. Need I say more&#63; The man is a genius, and he is without question the most engaging speaker I've ever had the pleasure of listening to. Snap up any chance to take one of his classes, regardless of subject matter.",
      "He is the best professor at the university. The class was very interesting. I greatly enjoyed it, and he made Shakespeare easy to understand and interesting.",
      "Ralph Williams is a character you have to see to believe. Words can't describe him. Has a passion for the material he teaches and does a lot for his students. Although going to lecture is not required to get a good grade, watching him teach is fun! Recommended for English and non-English majors alike.",
      "I really enjoyed going to lecture. His style of teaching is very interesting. He is a teacher everyone should have at least once. When he arrives, he runs around the lecture hall greeting everyone. I strongly recommend him.",
      "It is true that Williams is somewhat of a performance artist, but like any good performance, there are so many nuances to be learned from it, and in Williams' case you have the luxury of being helped along. He'll do things for you that no other professor will... bringing Patrick Stewart to class = something I'll remember for the rest of my life.",
      "An odd, yet endearing presentational style. A brilliant, yet self-deprecating man. Knows a great deal about a great deal. Whether in a huge lecture hall or in one-on-one, you will feel smarter just listening to this man. Take a course with him before you leave Ann Arbor.",
      "Somewhat demanding, but he's such a good teacher you want to learn. Michigan wouldn't be the same without Ralph Williams. WILLIAMS FOR PRESIDENT. too bad he's canadian...",
      "What makes the University of Michigan worth 120K&#63; The SHEER PRIVILEGE of interacting with this caliber of thinker, scholar, speaker and mentor. Ten years later and I still find myself reflecting on Ralphisms.",
      "Inspiring. I had him over 6 years ago and he stil stays with me today. His love of the subject is contagious and is a conversation for friends and family.",
      "Simply amazing. He is an incredible lecturer, he captures the audience. The only problem is that you get so into the lecture, you forget to take notes.",
      "You absolutely have not experienced everthing the University has to offer without taking a lecture with Ralph Williams. I'd go sit in on another class just to hear him speak. He's a little odd and a little quirky but that just adds to the experience. You can't leave the University without hearing this guy lecture!",
      "He spoke very passionately and made you really FEEL the tone of the book. He often went on tangents, but was fairly organized. A laptop is always advised because he makes a lot of points in a short amount of time. His booming voice keeps you awake the whole time and he has a true passion for actually teaching his students. He's fun.",
      "Williams is brilliant and passionate. I found his religion lectures more disorganized than his literature lectures. If you can, TAKE YOUR LAPTOP with you, writing down as many of his tangents as possible really makes it click in the end, his thought is coherent if you can track it.",
      "Yea, Williams is an amazing lecturer and NO ONE should leave the university w/o taking one of his classes but keep in mind, if youre christian this class won't be the easiest to take. An excellent experience, but keep in mind that your views might/will conflict.",
      "One of the best classes I had at UofM! His lectures are so engaging, and you really come out of it with an understanding of Shakespeare. He is hilariuos and a fun guy to chat with. I definitely recommend taking this class!",
      "This has been my third class with Professor Williams. His classes are marked by heavy reading and arbitrary midterms and finals. While he is a brilliant and enthusiatic lecturer, his persona does grow a bit old after awhile, so you'd better have some interest in the material. A little over-rated, yes, but Williams is still the best UM has to offer.",
      "Captivating prof. Taught me how to understand Christianity in an entirely different light. His lectures can be ambiguous at times, but after going over the notes you'll understand every little detail and its role in the grand scheme of things.",
      "Ralph Williams is an amazing lecturer who inspires students to really dig into the material. He never teaches hard &quot;facts&quot; but instead inspires students to think about the larger issues. Everyone should take this class.",
      "He's a captivating lecturer and first class expert at the material he presents. The only problem is that it's hard to take notes because you get so interested in the lectures. He also made a point of going around the lecture hall at the beginning shaking people's hands.",
      "he really loves teaching and is certainly an interesting professor to watch.. does know his stuff and really cares about his students..",
      "Very interesting speaker. Sometimes talks too fast, but he is a delight to listen to. Classes are always interesting. He seems to really respect all of the students in his lectures, and seems to honestly care about how we do in the class.",
      "If you read that someone dislikes Mr Williams, it's probably because they were too lazy, too ignorant, or just not worth the time. Who doesn't ejnoy a professor that takes time to greet ALL his students&#63; And his teaching style appeals to all levels....",
      "Ralph is simply incredible. He will certainly make you think a great deal about both the subject matter and also ideas that apply to more than just the class. He is the most enthusiastic professor I have ever met and is always willing to help his students. Lectures are also entertaining. Take any class with him that you possible can",
      "He is very eloquent/erudite/all of the above!! Don't let first impressions scare you, he is a nice person (one on one and in a group) and LIKES teaching!",
      "Definitely an experience not to miss. I love this man. Dante pilgrim, Dante poet! Rubric I, the Eyes of Beatrice... very engaging.",
      "little one credit class, but extremely moving. definitely worth your time",
      "Good morning friends, and a rich welcome to you all. I'm so glad to see you all. Are there any questions before I begin mattering away, for the wind is very much up. Yay or nay&#63; Ralph Williams is my guilty pleasure...",
      "Fabulous traditionalist. One of MI's best. I remember most of what he said and many of the high points he revealed in the text. Gives extra credit, gives bookless finals, but has wonderful stories and is very animated. Don't leave Michigan without RW.",
      "Ralph is one of the very best profs around. Engaging, entertaining-basically a one man performance that should not be missed, His energy is felt in every lecture and tries to connect to each student. You shouldn't graduare from UM with out taking a Williams class!",
      "No Comments",
      "Brilliant, engaging, informative.",
      "The best professor I've ever had, hands down (and I spent 6 years at Michigan!) He's engaging, interesting, greets everyone individually, is friendly and helpful. You need to enjoy the Ralph Williams experience for yourself!",
      "he's more than a prof, he's an experience....for shakespeare, he pushes you to read a play a week, and the bible class is interesting but isnt too organized in terms of readings",
      "the man, the hands, the legend. Ralph Williams is a saint.",
      "Verbose and theatrical. Entertaining and informative, but make sure you brush up on your vocabulary to get the full meaning of everything. He knows what he's talking about. Great man, great man.",
      "most interesting and enthusiastic prof ever!",
      "He's what you would expect from a lecturer--someone who stands in front of the class every day talking. But he does it in a way that's interesting and it really encouraged me to constantly want to learn more, even beyond the scope of the course.",
      "Very interesting teacher. In class, you are more than a number to him. He cares about every student and how they view his class. He is nice to everyone and tries to help them as much as he could. He is very funny, educated and everyone needs to have him at LEAST once before graduation. He is cool.",
      "All around great guy. This is a prof who views you as more than a number. His lectures are thoroughly entertaining. I admit he can be a little difficult to follow, mostly because the man speaks poetically, however, he is more than willing to go over with you anything you don't quite grasp.",
      "He is so engaging in class. I wanted to be there.",
      "he's just.... ralph williams. don't miss out.",
      "What can one say, Ralph Williams is a legend - his voice, his unbelievably immense hands, his frantic antics. He is also passionate, ingenius, brilliant, crazy, and genuinely concerned about his students. Lectures are never dull. Everyone should take his class at least once before they graduate!",
      "Ralph Williams will go down in Michigan history as the crazy Canadian professor running up and down the rows of class spouting off his various rubrics. A particularly interesting gentleman with a genuine concern for his students. Material presented in class, though, is a bit stale.",
      "Excellent course...it taught me a new way to look at excerpts in the Bible. Also, Williams is simply a great professor! Very passionate about his profession. He also is a great contributor to the educational process in Ann Arbor...",
      "Fantastic Teacher, passionate, brilliant, one of the best I've ever had.",
      "Amazing professor, awesome class. He tried to greet as many students as possible before the lecture started. He has an amazing knowledge of the Bible, literature in general and knows over a dozen languages fluently. Do not graduate from Michigan without taking one of his classes!",
      "He ran up and down the aisles before every lecture and shook as many hands as possible so that he could get to know us. Not taking a Williams' class while at UofM is like not ever going to a football game while you're here.",
      "Williams is one of the best professors here. He is well known for his loud voice (never uses a microphone) and vast knowledge of literature and religion. He holds each class members attention from the moment he starts talking.",
      "Simply great. Find time to talk to him during office hours... it's great and he doesn't speak as loudly as he does during lectures.",
      "It's practically retarded to go to Michigan and not take one Professor Williams' courses.",
      "Professor Williams is the best professor I have EVER had. He is intelligent, compassionate, and just plain awesome. Do whatever it takes to get into one of his courses.",
      "Williams is AMAZING! Sometimes he is a little vague in lecture, but his discussion section for religion was the best experience ever. For the final, you go to his home with a few other students and have a 2 hour discussion. Highlight of my college career",
      "Prof. Williams is a wonderful teacher and scholar. I felt very lucky to have had him for several English classes.",
      "Ralph Williams is a major asset to the University of Michigan. He is a wonderful, compassionate, and learned human being.",
      "&quot;Are you ready for the rubric of the day, my dear class&#63;&quot; He has been named best professor for several years...take one of his courses!",
      "Simply amazing. He's 65 years old&#63; and going strong. This guy has a passion and he's filling it. Not an easy class but he makes stuff so interesting! Very unique lecturing, but probably the best ENG professor at the U.",
      "Yeah, I love listening to him talk too, but he could dial it back occasionally. Sometimes it seemed put on. His love for the subject matter and language is evident and I know I'm better off for having taken his class.",
      "WOW",
      "Have you experienced the Williams experience&#63;",
      "Love the ruberics-- can't wait to take ENG 401 next term!",
      "the hands!",
      "Hands down the best professor at the University of Michigan. He knows every student, even in classes of several hundred. The type you would expect at Cambridge or Oxford.",
      "Williams' unique style of teaching gives the impression that he is a Shakespearean actor. The rubrics take some getting used to, but he is still a prof that everyone must have before leaving UofM.",
      "No Comments",
      "Best Professor I have ever had. A privilege to know",
      "Awesome Teacher, get to know him outside the classroom!!!",
      "With a background in theatre, literature, and religion, Williams knows all",
      "Wonderful Professor, makes subjects come to life",
      "Brilliant, hands, rubrics, and the Bible unfolds!",
      "Amazing",
      "hilarious",
      "Excellent lecturer.",
      "I have been out of school for 8 years and I think of him all the time. amazing.",
      "This guy has the craziest mannerisms, but he is amazing!",
      "No Comments"
    ]
  ]
]