[
  [
    "Massachusetts Institute of Technology-Winston, Patrick",
    {
      "online": 1
    },
    [
      "Watched the complete 6.034 course online. Excellent lecturer."
    ]
  ],
  [
    "Stanford University-Sahami, Mehran",
    {
      "online": 6,
      "website": 1,
      "upload": 1,
      "film": 1,
      "video": 1
    },
    [
      "Having seen the 106a lectures online and liked them, I wasn't particularly expecting anything new. yeah some of the material was familiar but Mehran was so much more awesome in person and such a great teacher, who really prepared me for some of the more difficult computing concepts.",
      "Mehran is awesome. He is always fun to listen to and he explains everything so well. The lectures are also filmed and uploaded on the course website (same day) so you \"go to lecture\" on your own time (at double speed). He is very approachable and loves what he teaches.",
      "Mehran is awesome. He is always fun to listen to and he explains everything so well. The lectures are also filmed and uploaded on the course website (same day) so you \"go to lecture\" on your own time (at double speed). He is very approachable and loves what he teaches.",
      "Mehran is awesome. He is always fun to listen to and he explains everything so well. The lectures are also filmed and uploaded on the course website (same day) so you \"go to lecture\" on your own time (at double speed). He is very approachable and loves what he teaches.",
      "The best prof through whom I could learn online",
      "saw his lectures online, this guy is amazing!! wish my college had teachers like him. his lectures made my first year so much easier. amazing guy!!",
      "attending CS106A online: Mehran Rocks!",
      "Oh how I love Dr. Sahami! He's funny, smart, and LOVES to teach! I'm on video 7 of his CS 106A class (I don't attend Stanford); he's THE BEST EVER! Now I can say I UNDERSTAND Comp Sci! I took 2 CS classes at my own alma mater and HATED it each time. Now I LOVE IT! THANK YOU Mehran! YOU TOTALLY ROCK! (I added a hot chili pepper for bonus lol :))",
      "I am a computer science student, but do not attend Stanford University. I have seen most of his online lectures on programming methodology and i have been blown away. By far the best professor/instructor/teacher/lecturer i have EVER seen in front of a class doing what they do best.",
      "I don't even go to Stanford. I watched Mehran's Programming Methodology lectures online. He's awesome."
    ]
  ],
  [
    "Stanford University-Parlante, Nick",
    {
      "website": 1,
      "online": 2,
      "youtube": 1,
      "coursera": 2
    },
    [
      "He made CodingBat website. Its amazing how his efforts helped thousands of students taking computer science like the AP Computer Science to other college intro to CS (Java) courses. Also thanks to Stanford Professor Marty Stepp.",
      "Makes the subject interesting. Energy comes through, even online. Nice to look at too.",
      "I knew nothing when I started taking his courses online. He made everything crystal clear and everything seemed easier. He is perfect at what he does. I thank him with all my heart.",
      "Look at this guy on youtube, very thorough and energetic. Makes complex topics simple. One of the best teachers you will EVER have.",
      "Nick is awesome! I took this Stanford course through Coursera.org. His way of explaining computer science was crystal clear. I enjoyed every lecture and feel like I took a lot away from the course! Thanks Nick!",
      "Hats off Teach. You are extremely well at what you do. Keep it up. Course I took was CS101 from coursera.com"
    ]
  ],
  [
    "Stanford University-Schwarz, Keith",
    {
      "video": 1
    },
    [
      "Keith is so excited about CS ad the excitement is contagious. He talks really fast, so you might miss some of the jokes he tells until 5 seconds later. Most of the classes (or all?) he teaches have lecture videos, so if speed is a problem, you can just watch the lecture videos."
    ]
  ],
  [
    "Stanford University-Ng, Andrew",
    {
      "coursera": 2,
      "video": 3
    },
    [
      "Participated in Coursera MOOC. Excellent course. Highly Recommended. Inspirational and Humble figure. Extreme clarity in deliverance. Relevant and useful assignments, makes you ready to employ the technique to real life problems. Thanks for becoming a hero in ML and AI buy providing your wealth of experience to thousands of underprivileged.",
      "Greatest professor ever! I am currently in the third week of his Machine Learning course (created by Stanford, offered through Coursera). It's absolutely amazing! Prof. Ng explains pretty advanced topics in understandable ways. His numerous lecture videos are top-notch. Thank you, Prof. Ng! You are the greatest!!",
      "Greatest professor ever! I am currently in the third week of his Machine Learning course (created by Stanford, offered through Coursera). It's absolutely amazing! Prof. Ng explains pretty advanced topics in understandable ways. His numerous lecture videos are top-notch. Thank you, Prof. Ng! You are the greatest!!",
      "Absolutely amazing! Genuinely interested in the subject, explains concepts with clarity, uses excellent examples and focuses on what's important. Usually you'd need to meet a professor in person to iron out problems and understanding. He managed to teach via lecture videos and STILL got through to most people. Absolutely amazing!",
      "I have only watched videos of his course"
    ]
  ],
  [
    "Stanford University-Roughgarden, Tim",
    {
      "coursera": 2,
      "youtube": 2,
      "video": 2,
      "online": 1
    },
    [
      "I took both Algorithm courses on Coursera last year. I think Prof. Roughgarden is one of the best teachers I've ever had. He explained clearly and in detail quite difficult topics. And he's tons of fun too! I'm going to take both courses again next year. It's the kind of experience worth repeating!",
      "Awesome free course on youtube.",
      "This guy is awesome for putting his course videos up on YouTube for free, extremely informative, one of the best professor's I've ever encountered.",
      "This guy is awesome for putting his course videos up on YouTube for free, extremely informative, one of the best professor's I've ever encountered.",
      "He's amazing! I wish we had someone nearly as good as him at my college. Learned more from watching his videos than I did by going to class here.",
      "Amazing professor. Love his lectures. Also, I'm totally attracted to him. He's just so personable and eloquent. He makes the online course very engaging.",
      "He taught me on coursera. He teaches nice"
    ]
  ],
  [
    "Carnegie Mellon University-Kosbie, David",
    {
      "online": 1
    },
    [
      "THE BEST PROFESSOR! If you pay attention in class, you will learn A LOT! All necessary notes are online. Is willing to do anything for his students and will stay at office hours until EVERY student is fully helped. I took his class a year and a half ago, but he still asks me how I am doing. Students are Professor Kosbie's top priority."
    ]
  ],
  [
    "Carnegie Mellon University-Pausch, Randy",
    {
      "video": 1,
      "youtube": 1
    },
    [
      "Randy Pausch has taught me more about life than any other professor. The last lecture and the time management videos are incredibly valuable. The wisdom he exudes will stay with me forever. Thank you, Randy!",
      "I just watched the Youtube &quot;Last Lecture&quot; and was once again moved. I am going home to hug my wife and kids."
    ]
  ],
  [
    "Carnegie Mellon University-Hoffman, Tim",
    {
      "online": 1
    },
    [
      "Good guy, funny, helpful w/little things that might prop up. 15-113 is pretty basic stuff, but C can get a little tricky for those without a CS background. Posts all the notes online, assignments are basic (and are basic variations of the same thing each semester). Final exam is cake, midterm somewhat harder. 1/2 pay attention, do the HW, get an A."
    ]
  ],
  [
    "University of California Berkeley-DeNero, John",
    {
      "online": 8,
      "video": 4,
      "film": 1
    },
    [
      "Loved taking CS61A. I didn't attend lectures, just watched the online lectures. The class is pretty fair and they give opportunities for EC - definitely do the EC! I learned a lot and there is lots of support. At the time of writing final grades haven't been given out, but I'm an A-/A.",
      "His lectures are so great that the online textbook is unnecessary. However, get ready to work plenty if you want to do well. If you can complete all homework and projects on time, you can get 100% on those assignments and even some extra credit, so the only thing in the way are the exams. Be sure to understand the concepts and you'll do fine.",
      "CS61A was an incredible class. There were over 900 people enrolled, but I had more opportunities for personal assistance than in any of my smaller classes. John is an awesome professor - fun, interesting, and helpful. His online videos are very clear and precise (more so than any professor's physical lectures). Definitely would recommend.",
      "CS61A was an incredible class. There were over 900 people enrolled, but I had more opportunities for personal assistance than in any of my smaller classes. John is an awesome professor - fun, interesting, and helpful. His online videos are very clear and precise (more so than any professor's physical lectures). Definitely would recommend.",
      "Best person you could ask for your first CS class at Cal. Expect to spend a lot of time on projects and homework and studying for tests, but GO TO OFFICE HOURS. The TAs are very helpful, remember that you're not alone on this. I've gone to every lecture, you can watch the videos online but live lectures are great. Hilarious and answers questions",
      "Best person you could ask for your first CS class at Cal. Expect to spend a lot of time on projects and homework and studying for tests, but GO TO OFFICE HOURS. The TAs are very helpful, remember that you're not alone on this. I've gone to every lecture, you can watch the videos online but live lectures are great. Hilarious and answers questions",
      "Denero is an amazing professor. His online video lectures are far better than live lecture. However, learning in this class really comes from surviving the constant inundation of homework, quizzes and projects. Doing previous exams are essential for success on his exams.",
      "Denero is an amazing professor. His online video lectures are far better than live lecture. However, learning in this class really comes from surviving the constant inundation of homework, quizzes and projects. Doing previous exams are essential for success on his exams.",
      "Denero is amazing. His lectures are very helpful and he keeps them interesting and fun. Lectures are most commonly viewed online, which is also helpful. You'll definitely learn a lot in this class and help is readily available via office hours and online resources. On the other hand, the work load for this class is large that the exams are tough.",
      "John Denero is fantastic. He is loved by students. His (massive) course is extremely well organized. Most of his homework and projects are useful. Lecture videos are posted online, and are very good. Biggest downside is that it's a hard course. I came in with a lot of prior experience and did fine, but I still had to study and practice quite a bit",
      "John Denero is fantastic. He is loved by students. His (massive) course is extremely well organized. Most of his homework and projects are useful. Lecture videos are posted online, and are very good. Biggest downside is that it's a hard course. I came in with a lot of prior experience and did fine, but I still had to study and practice quite a bit",
      "John DeNero was incredibly clear, and he was a fantastic lecturer, especially considering that over 900 students took CS61A in Fall 2013. All of the lectures were filmed in advance, so it was not even necessary to go to lecture. He genuinely cares about all of his students. However, the class itself is quite challenging.",
      "Fantastic online presentation, fantastic lecturer, has WONDERFUL TAs, really know howto organize and present concepts and got me into coding! I'm really glad my major requires this class, and am grateful to have taken this class and learned so much from him! That said, no programming experience makes this class very painful, especially projects."
    ]
  ],
  [
    "University of California Berkeley-Garcia, Dan",
    {
      "online": 1
    },
    [
      "I had no CS background so it was NOT an easy class for me. Tons of work. But he's an awesome professor and so organized! EVERYTHING was online. He cares about students more than any professor I've had. The grading policies helped a lot— I freaked out when I got a D on the first exam but I still got an A in the class. He's fair."
    ]
  ],
  [
    "University of California Berkeley-Lavian, Tal",
    {
      "video": 5,
      "youtube": 5,
      "blog": 7,
      "online": 1
    },
    [
      "Really enjoyed the class. The homework can be annoying sometimes because it's easy to forget about it until it's due on Saturday nights. Regardless, interesting class that has no tests, quizzes or papers. The only HW is blogs and YouTube videos. Easy A.",
      "Really enjoyed the class. The homework can be annoying sometimes because it's easy to forget about it until it's due on Saturday nights. Regardless, interesting class that has no tests, quizzes or papers. The only HW is blogs and YouTube videos. Easy A.",
      "Really enjoyed the class. The homework can be annoying sometimes because it's easy to forget about it until it's due on Saturday nights. Regardless, interesting class that has no tests, quizzes or papers. The only HW is blogs and YouTube videos. Easy A.",
      "Weekly homework, only takes 1-2 hours, but is not too difficult, involves weekly blog and youtube posts. Very easy to talk to, tries his best to help the students learn the material. Very interesting topics and has great guest lecturers.",
      "Weekly homework, only takes 1-2 hours, but is not too difficult, involves weekly blog and youtube posts. Very easy to talk to, tries his best to help the students learn the material. Very interesting topics and has great guest lecturers.",
      "Tal was great. This class incorporated social media for homework which consisted of doing blog posts, youtube videos, and tweets about patent cases. This course was interesting in that you learned a bit more about patents. The 2 hour lectures were sometimes boring and material moved slowly. As in there would be a lot of repeated materials presented",
      "Tal was great. This class incorporated social media for homework which consisted of doing blog posts, youtube videos, and tweets about patent cases. This course was interesting in that you learned a bit more about patents. The 2 hour lectures were sometimes boring and material moved slowly. As in there would be a lot of repeated materials presented",
      "Tal was great. This class incorporated social media for homework which consisted of doing blog posts, youtube videos, and tweets about patent cases. This course was interesting in that you learned a bit more about patents. The 2 hour lectures were sometimes boring and material moved slowly. As in there would be a lot of repeated materials presented",
      "Professor Lavian is good and fun! His expectations are very clear with regard to the online homework. It's only graded for competition, and he is flexible with timing. It's also pick your own topic - so you don't get bored with it.",
      "Class was interesting and the only assignments were blog posts, youtube, and twitter posts. Tal is nice and he is very appreciative of student feedback.",
      "Class was interesting and the only assignments were blog posts, youtube, and twitter posts. Tal is nice and he is very appreciative of student feedback.",
      "Tal is a great professor. He makes the material super interesting and really engages students. I learned so much this semester-this is one of my favorite classes at Cal. In terms of grading, he is very fair and reasonable and also extensions are given! No final, midterm! Just blog posts & videos that are super fun and interesting! TAKE THIS CLASS!",
      "Tal is a great professor. He makes the material super interesting and really engages students. I learned so much this semester-this is one of my favorite classes at Cal. In terms of grading, he is very fair and reasonable and also extensions are given! No final, midterm! Just blog posts & videos that are super fun and interesting! TAKE THIS CLASS!",
      "Teacher was one of the BEST TEACHERS I'VE HAD AT CAL. He focused on core concepts for the class. There were no tests or midterms - he didn't care about those and route memorization, but rather just wanted us to learn key takeaways that we would actually be able to apply to our working lives in the future. Blogs & videos as homework - interactive!",
      "Teacher was one of the BEST TEACHERS I'VE HAD AT CAL. He focused on core concepts for the class. There were no tests or midterms - he didn't care about those and route memorization, but rather just wanted us to learn key takeaways that we would actually be able to apply to our working lives in the future. Blogs & videos as homework - interactive!",
      "Great professor but assigns SO MUCH HW. I didn't realize what I was getting myself into when I took the class with all these blog posts and YouTube videos... But regardless I recommend this course",
      "Great professor but assigns SO MUCH HW. I didn't realize what I was getting myself into when I took the class with all these blog posts and YouTube videos... But regardless I recommend this course",
      "Great professor but assigns SO MUCH HW. I didn't realize what I was getting myself into when I took the class with all these blog posts and YouTube videos... But regardless I recommend this course"
    ]
  ],
  [
    "University of California Berkeley-Shewchuk, Jonathan",
    {
      "youtube": 1,
      "website": 1,
      "online": 1
    },
    [
      "Watch his youtube lectures they are great at helping you understand. Helped me pass data structures",
      "My #1 or #2 favorite professors at Cal. He is THE best professor at public speaking (and has his own advice about it on his website). He is also organized in every way, from lectures to grading rubrics. He's funny without seeming to try (and don't even try cheating). I would definitely recommend, but he doesn't seem to teach as much as he used to.",
      "Fantastic lecturer, and the lecture notes he posts online are incredibly helpful. Exams are challenging but doable (buy the reader). If you want to take some time off to laugh a bit during dead week, go to the final lecture."
    ]
  ],
  [
    "Harvard University-Malan, David",
    {
      "youtube": 2,
      "website": 1
    },
    [
      "I took his class on Youtube's CS50 channel, and I was amazed by his passion into coding. Really appreciate to have him teach me the basics of Computer Science.",
      "CS50 was hilarious. Youtube is a good chance for you to try it.",
      "I think for a first time computer programming class, cs50 is too fast even for Harvard students. first 6 weeks,you study c programming, from conditional loops, then pointers, then functions,then structures,then data structures,(stacks,Queues, link list). Then he switches to teach Website design(html,css,php,ajax)"
    ]
  ],
  [
    "Harvard University-Overflow, Stack",
    {
      "online": 1
    },
    [
      "Used his online lectures in many other classes. Great prof."
    ]
  ],
  [
    "University of Washington-Reges, Stuart",
    {
      "online": 6,
      "website": 4
    },
    [
      "I would recommend using the book to do practice problems. I did lots of practice it (UW online java practice programming problems) and honestly even though it helps I only got a 3.4 because I honestly wrote messy code in the two exams, and lost points on the hard programming question for both exams. I would advise use the textbook.",
      "very clear in every details, especially in CSE142 pay attention to each homework from the beginning to the end, every parts are equally significant for doing well in this course do practise-it (an website for online practising) before exams, or you will fail good luck",
      "very clear in every details, especially in CSE142 pay attention to each homework from the beginning to the end, every parts are equally significant for doing well in this course do practise-it (an website for online practising) before exams, or you will fail good luck",
      "Glad I signed up for the lab (1-credit CSE 190). You can lose very easy points for the homework because of \"style points\". Stuart Reges uses analogies so you should read the book and do practice-it problems BEFORE attending the lecture. Also you should go to Autumn 2015's CSE 142 website to do the homework 1 and 2 BEFORE day 1 of class. Hard exams.",
      "This class has some students with java experience, \"hares\". Make sure you do practice-it problems before each lecture, as the metaphors may help - or not. Quiz sections depend on your TA, some are good some are more useless. Sign up for the CSE 190 lab- handy when you need help with some conceptual questions. Lectures recorded in CSE 142 website.",
      "Lectures are good. Lecture slides provided online are extremely helpful, especially if you miss a day. There were weekly homework assignment, moderately hard for people new to coding. Class was fun and challenging. Even if you're not a computer science major, I recommend trying this class. Textbooks are useful, but not necessary.",
      "Awesome lecturer, he is clearly passionate about teaching this course and has excellent explanations. The grading is very specific and unbending, double check all your assignments, do practice-it (the textbooks online practice website) and you'll do fine. Highly recommend the class.",
      "Awesome lecturer, he is clearly passionate about teaching this course and has excellent explanations. The grading is very specific and unbending, double check all your assignments, do practice-it (the textbooks online practice website) and you'll do fine. Highly recommend the class.",
      "For this class, each HW will consume about 3 - 5 hours and he'll give you a week long. Exams are straight forward with questions similar to quiz sections. Book is useless since everything you need will need will be posted online. He is very clear in explaining the lecture and what he is expecting you to do. Good professor, recommended.",
      "AWESOME PROFESSOR! Interesting, clear, concise, gives excellent analogies and explanations. Posts clear lecture notes and practice exams online. Class is curved so easiness has nothing to do with professor, so its hard to get a high grade. TA-led quiz sections and out-of-class practice crucial to success. Really anal on how homework is graded."
    ]
  ],
  [
    "University of Washington-Stepp, Marty",
    {
      "online": 3,
      "website": 1
    },
    [
      "Marty is an awesome teacher, the lecture notes as well as screencasts are put online, so you don't have to go. Grading can be rough, lots of focus on efficiency and eliminating redundancy can cause you to lose point for little things. The final wasn't very easy,do the practice tests online with a timer for a good idea what you are up against.",
      "Marty's a really good teacher. Java is really hard but you have so many resources to learn the topic of the week: you can go to lecture, read the book, look at the slides, or watch the lecture online (what I did!). Also there are online practice problems. And an almost 24/7 computer lab dedicated to CSE students with TAs to help. Good, hard class.",
      "I've never taken any programming class before, but just going to lecture and listening (no notes) worked fine for me. Everything that's required for homework/midterms are explained well in lecture. Though if you miss class, notes are on the website. This might be hard for some people, but I think of this class as my fun class for this quarter.",
      "Textbook is technically optional, but exams are open-book & it's helpful w/assignments so buy it anyway! It's only required on MyUW b/c Marty gets $ as an author when you buy it. Lecture notes online are INCREDIBLY helpful - my favorite class this quarter. Lectures are entertaining and helpful. Homework gets tough around week 4/5..."
    ]
  ],
  [
    "University of Washington-Blank, Adam",
    {
      "online": 1
    },
    [
      "Adam gives very interactive and inspiring lectures. He has tons of office hours and offers a lot of help online, too. His midterm this quarter was really tough, but he wrote a &quot;significantly easier&quot; final to make up for it. A very smart and caring prof indeed."
    ]
  ],
  [
    "University of Washington-Martin, Helene",
    {
      "online": 2
    },
    [
      "I came in with zero programming experience and no expectations but LN's teaching encouraged me to take 143 as well with her this quarter. Her lectures are interesting and if you miss something you can always re-watch the recorded lecture online. Read the TA's grading standards and proofread your HW. Do 5-10 practice exams before each test.",
      "She's great, I had her for CSE 142 and now CSE 143. Very put together, comprehensive lectures I don't actually fall asleep in, does a great job putting all of her demos and notes online, all well formatted and working, and if you are a girl looking to go into CSE who feels intimidated, go talk to her, she's very supportive and friendly."
    ]
  ],
  [
    "University of Washington-Fung, Zorah",
    {
      "online": 2
    },
    [
      "By far the best professor I've had at UW. Lectures are amazing, she teaches cs in a clear, concise manner, and she makes lectures really interesting and funny. The exams and homework are very fair but also pretty hard. Also provides fantastic study material online. Overall 15/10 :)",
      "Very engaging lecturer, but isn't always able to stay on schedule. If lecture falls behind a day, homework and discussion section continues on at the regular schedule anyway. Homework and exams are actually fun. You don't actually need the textbook; I did the whole class with just Oracle's online Java documentation, never needed the text."
    ]
  ],
  [
    "University of Washington-Limketkai, Benson",
    {
      "video": 2
    },
    [
      "This guy actually is my favorite professor thus far in UW. It's disheartening to see all the bad comments about him, because I don't see how any of it is true. He's a funny guy who keeps us entertained with funny videos at the beginning of class. We were suppose to be taught by a much easy teacher WIN2009, but I'm glad Benson taught us instead!",
      "One of the best professors I've ever had. Plays music and videos before class. I had no previous programming experience but could still do all the homework alone w/out any help. Got a 3.6 GPA. Easy class structure. He brought a robot he built to class once. His class has helped me find what I want to major in. But beware, may try to rick-roll you."
    ]
  ],
  [
    "University of Washington-Schafer, Hunter",
    {
      "online": 1
    },
    [
      "Good lectures, great guy. The grading for the class was rough at times but fair (prioritize good comments!). Attendance is optional, all lectures are online, but I would recommend watching them in person with laptop closed, phone away."
    ]
  ],
  [
    "University of Washington-Wortzman, Brett",
    {
      "upload": 1,
      "online": 1
    },
    [
      "Brett's a nice guy. I come in blind and learned so much. Attendance isn't mandatory (large class) but I recommend going, as panopto takes time to upload. Be careful w/ hw assignments--check style guide and basically any resource available to you. Doing practiceit before exams rly helps, but start early. The system crashes when everyone's using it.",
      "Brett is a great professor. You would be lucky to take his class especially when you are new to programming like me. He teaches everything clearly and gives a lot of examples. He posts the programs he used in lectures online for you to review later. Also, he is humorous."
    ]
  ],
  [
    "University of Washington-Tatlock, Zach",
    {
      "online": 1
    },
    [
      "Zach gives great, engaging lectures and assigns reasonable amounts of homework. His tests were fair, and the topics he emphasizes in lecture are generally the topics he tested us on. Attendance is not mandatory (slides posted online), but I feel that his lectures are one of his strong points as a professor, and I found them to be very useful."
    ]
  ],
  [
    "University of Washington-Quinn, Kevin",
    {
      "online": 1
    },
    [
      "Honestly his class was my favorite class I have taken at UW. He is really energetic about all the material he talks about. The only bad thing is that the class itself was hard so the lectures were very fast paced. Also btw you don't need the textbook at all he has power points and they are posted online."
    ]
  ],
  [
    "University of Washington-Ruzzo, Walter",
    {
      "video": 1
    },
    [
      "Professor Ruzzo is an expert in this area and his lectures are very rewarding if you attend. I felt his lecture pace is a little bit slow but I'm personally a fast learner and most people find it ok. He always made his lecture videos available and his explanations are very accessible for newbies in algorithm like me."
    ]
  ],
  [
    "University of Washington-Hong, Ning",
    {
      "video": 1
    },
    [
      "Ning was one of the best TA's I've ever had. She was always enthusiastic in class and was super accessible outside of class. I once e-mailed her a couple questions before the midterm, and she responded in like an hour with videos of her working out the problems on a white board just for me."
    ]
  ],
  [
    "Georgia Institute of Technology-Leahy, Bill",
    {
      "online": 1
    },
    [
      "Awesome teacher. Do all the homeworks to completion and review for the quizzes by looking at the old ones online on tsquare and you will get an A."
    ]
  ],
  [
    "Georgia Institute of Technology-Summet, Jay",
    {
      "online": 3,
      "website": 3,
      "video": 3
    },
    [
      "Jay is the coolest professor I've had. I'd never taken CS before, but he explained everything really well, and he and the TAs were great about answering my questions. Read the texts he puts online, study your homeworks, and take lots of practice tests, and the real tests will be easy. The robots were also a lot of fun to work with.",
      "Lectures were very straightforward and kept my interest. The tests were tricky, but all you had to do was get a B average to get an A in the course. His class website was very organized and made getting assignments and practice tests easy.",
      "Professor Summet is extremely helpful, from the recorded lecture videos he posts on his website to the questions he answers about homework during class. His homework assignments are all doable, even if you've never coded before. Recitation is as useless as the TA's for this course, but you should go so you don't miss the pop quizzes.",
      "Professor Summet is extremely helpful, from the recorded lecture videos he posts on his website to the questions he answers about homework during class. His homework assignments are all doable, even if you've never coded before. Recitation is as useless as the TA's for this course, but you should go so you don't miss the pop quizzes.",
      "This is a rather easy class. There are free online chapters to read but I did good without reading them much. Its a very fun class, easy to get an A. Prof Summet is an amazing instructor, always very clear and goes slow so everyone can keep up and understand. Help is always available. I highly recommend this class.",
      "Reaally great teacher especially if you sit in the front two rows! He teaches the class with scribbler robots (you will have to buy one or share with someone else if you choose). He uses a microphone to talk in class so he is audible. Very helpful during his office hours and even online!",
      "This professor was extremely knowledgeable in what he taught. He was really great at conveying the information to the students and he made class fun and interesting. Many examples and videos were shown during class as a visual representation of what you learn. SO HELPFUL!",
      "Very helpful professor. I did not know anything about Computer Science but still managed to get an A in the class. He teaches using a lot of examples and posts lecture videos on class website. There are one or two pop quizzes throughout the semester during recitation, but they are very short and easy if you have been paying attention in lectures.",
      "Very helpful professor. I did not know anything about Computer Science but still managed to get an A in the class. He teaches using a lot of examples and posts lecture videos on class website. There are one or two pop quizzes throughout the semester during recitation, but they are very short and easy if you have been paying attention in lectures."
    ]
  ],
  [
    "Georgia Institute of Technology-Stasko, John",
    {
      "online": 1
    },
    [
      "Stasko is a really solid lecturer. I'm not someone who focuses easily, but he held my attention. Definitely knows his stuff. The course isn't easy by any stretch, definitely practice inheritance/polymorphism, but if you study a fair amount you'll learn OOP basics pretty well. Textbook is easy to find the pdf for online."
    ]
  ],
  [
    "Georgia Institute of Technology-Marsicano, Kristin",
    {
      "online": 1
    },
    [
      "I love her!! I missed a lot of classes during the semester but she posts the lectures online so if you need to go over it you have the ability to. She also makes class interesting; she likes to joke and she talks a lot but if you pay attention you'll understand it. Haven't finished the class yet but I have a 94% on hw and 89% on tests. Take her!!!"
    ]
  ],
  [
    "Georgia Institute of Technology-Joyner, David",
    {
      "video": 5,
      "online": 10
    },
    [
      "Dr. Joyner is the best teacher I've had at Georgia Tech and I took the CS 1301 online class with him. His video lectures were clear and concise. I had never taken any CS course before this one. I only had to complete 3 problems on the final for a 95 overall in the class. Definitely recommend him.",
      "Dr. Joyner is the best teacher I've had at Georgia Tech and I took the CS 1301 online class with him. His video lectures were clear and concise. I had never taken any CS course before this one. I only had to complete 3 problems on the final for a 95 overall in the class. Definitely recommend him.",
      "The best class I've taken at Georgia Tech. I am a business major, and it made me think about switching to CS. The online format is amazing and so much better than in person. You get to run/test/debug your code as many times as you want before you submit it on a test (other CS sections are paper only). You can complete material at your own pace.",
      "This guy is awesome! He made the class really accessible and makes it interactive and engaging even though its online. You will actually learn from examples and videos if you pace yourself and don't wait till last minute. Since you get 1 or 2 attempts for each mc and unlimited submissions for coding problems there isnt partial credit",
      "This guy is awesome! He made the class really accessible and makes it interactive and engaging even though its online. You will actually learn from examples and videos if you pace yourself and don't wait till last minute. Since you get 1 or 2 attempts for each mc and unlimited submissions for coding problems there isnt partial credit",
      "Professor Joyner is the best CS professor I've ever had a class with by far. I took the online section, which is definitely worth it. Pretty simple A if you do your work and his recorded lectures are really good. Definitely worth taking a class with him.",
      "Take CS 1301 online!! This course is a really effective way to learn it. Joyner's video lectures are really concise &amp; the lessons are broken up by exercise questions so you don't get distracted/bored; vids are 3 mins long on avg. Really manageable class; its schedule is properly paced and very flexible, but don't procrastinate or you'll struggle.",
      "Take CS 1301 online!! This course is a really effective way to learn it. Joyner's video lectures are really concise &amp; the lessons are broken up by exercise questions so you don't get distracted/bored; vids are 3 mins long on avg. Really manageable class; its schedule is properly paced and very flexible, but don't procrastinate or you'll struggle.",
      "Videos for learning are very good. Schedule is a bit flexible since it's online, but don;t get too far behind because it's a decent amount of work. Test are legit even though online- they very much monitor you, but if you do the learning an homework and put just a little forethought into the test you should do well. Responds quick to questions.",
      "Videos for learning are very good. Schedule is a bit flexible since it's online, but don;t get too far behind because it's a decent amount of work. Test are legit even though online- they very much monitor you, but if you do the learning an homework and put just a little forethought into the test you should do well. Responds quick to questions.",
      "The online section of CS1301 is great,do not be apprehensive because this class is online. The majority of the grade comes from lessons and problem sets that have unlimited attempts, and the tests are simple . Requires a little bit of effort, is an easy A, and you'll learn as much as the inclass section without having to take trips to the help desk",
      "Best class I've ever taken, online or not. His Piazza responses are very detailed and helpful. If he's not available, Piazza falls apart, even though we had many students answering questions, too. Bc it's a large class, there are a lot of questions. If you can't reach him by Piazza, he is very good about Slack responses. Tests taken online",
      "First time taking online class and it was great. You watch short videos and you do exercises throughout. Take good notes and do the problem sets and you should be golden for the test. I never had to go to office hours. Plus, some of the tests he would give you the questions beforehand. If you have to take CS1301, DO IT ONLINE. You won't regret it.",
      "First time taking online class and it was great. You watch short videos and you do exercises throughout. Take good notes and do the problem sets and you should be golden for the test. I never had to go to office hours. Plus, some of the tests he would give you the questions beforehand. If you have to take CS1301, DO IT ONLINE. You won't regret it.",
      "I've taken online classes before and had terrible experiences, but both the layout of the course and the professor itself are excellent. It takes self-discipline like any online class, but the professor is very qualified, passionate, and answers emails, slack, and Piazza questions promptly."
    ]
  ],
  [
    "Georgia Institute of Technology-Stallworth, Cedric",
    {
      "video": 1,
      "website": 1
    },
    [
      "Stallworth teaches it like it is. Get in, get out, get an A. Awesome dude who cares about learning and loves teaching CS. Do the homeworks, use the CS1371 website for data banks and review videos, and find a recitation with a good TA to go to to help learn the material even more. Just don't slack off and you'll have a good time.",
      "Stallworth teaches it like it is. Get in, get out, get an A. Awesome dude who cares about learning and loves teaching CS. Do the homeworks, use the CS1371 website for data banks and review videos, and find a recitation with a good TA to go to to help learn the material even more. Just don't slack off and you'll have a good time."
    ]
  ],
  [
    "University of Texas at Austin-Downing, Glenn",
    {
      "website": 9,
      "blog": 3,
      "online": 3
    },
    [
      "Downing really knows his material and wants you to learn too! The class is pretty accessible, so if you have a question someone will answer it. I felt that projects, despite the claim that it was about a good website, just became fulfilling requirements. Tests were difficult and stressful.",
      "SWE is very similar to OOP: cold-calling, daily quizzes, an easy solo project, group projects. In SWE, you'll build a website with a group of 4 other people. It's fairly easy to get enough points for a B, but getting more than that requires much more effort. The lectures / tests / quizzes aren't related to the projects, so you still need to study.",
      "Downing's class is well organized and structured, and his lectures are interesting and explain concepts fairly well. If you have anxiety like me, his Socratic method and blog posts, as well as the constant group work probably won't sit will with you. Otherwise I think his class is a good choice, and a great way to get introduced to OOP and C++.",
      "Prof. Downing is a great teacher. I have learned a lot from his summer software engineering course. Tests were online through Hackerrank. There were Canvas quizzes every class, and lectures were very important to attend in order to get the most out of the course. There were one solo project and 4 group projects. Overall he is an excellent teacher.",
      "Downing has a very engaging, active lecturing style and is very knowledgeable about the C++ content covered in the course, making OOP, as a class, very enjoyable. As long as you go to class, actively review the notes that he posts on his website, and practice the in class exercises before the exams, you'll probably have a good experience.",
      "You will learn a lot in Professor Downing's class, but you will have to put in the work. For Software Engineering, there is a slight disconnect between the lectures and the tasks required to complete the projects, but there is plenty of help available. Lectures involve language-specific details and the project is to build a dynamic website.",
      "Knowledgeable, professional, and engaging. Interactive with the students. He will ask questions on a random students as he writes code. Group work on a web project and learning about python/SQL/javascript. You will learn a lot about coding practices. Daily quizzes can be hard. Tests are fairly easy. Weekly blogs.",
      "I didn't read the textbook much, but I usually liked the articles he provided. It isn't difficult to get points for doing relatively minor tasks like attending class, working with a partner, and writing a weekly blog post. You will get called on frequently in class, but he'll lead you to the answer without making you feel bad about it.",
      "Professor Glenn Downing is overall a nice person and a great lecturer. The group project about developing a database website is real world, fun to work on, and rewarding in terms of self-education and worthy of showing a future employer. The tests are quite difficult and are very unforgiving if you mess up. Redemption from a mistake is difficult!",
      "Prof. Downing's lectures are definitely the highlight of the class. I always learned something new and interesting from them. The quizzes and tests can be tricky, but there are plenty of freebies and extra-credit opportunities for quizzes to make up for it. The main group project is a full-stack website which you'll have to work pretty hard for.",
      "Professor Downing is an amazing lecturer, definitely a class worth taking. You learn the intricacies of Python and some SQL, and the project for the whole semester is building a website with a group. The quizzes are hard, so definitely try not to skip class. Grading is fair. The class is a lot of work, but it is 100% worth it.",
      "Downing is a great professor! His lectures are quite interesting and you want to make sure you pay attention because that is what most of the quizzes and test questions are going to be over. You will also build your own website as a group project. This class requires a lot of effort, but is definitely worth it.",
      "Great lecturer, he's well-prepared and posts class notes and examples online. I've gained a solid understanding of the languages and concepts he teaches in class because his examples are clear and he gets right to the point. He gives a quiz at the beginning of each lecture and you have to be in class to get the code to unlock it.",
      "Group projects due every 2 weeks. Each project was built on top of the other and the final product was a dynamic website. Quizzes every day in the first 5 minutes of class.",
      "Take the class if you are new to web development. If you put in the effort, you will be able to learn a lot about the front end, the back end and how every fits together in the \"story\" that he talks about so much. (P.S. All textbooks able to be found online if you are a broke college student)"
    ]
  ],
  [
    "University of Texas at Austin-Scott, Mike",
    {
      "online": 4
    },
    [
      "Learned a lot in this class and spent the most time on it by far compared to the rest of my classes. The assignments are time-consuming but easy to do well on, and the quizzes are not graded very harshly. However, the tests were very hard for me but passable if you put in the time to study. Don't buy the book use the 3 edition which is free online.",
      "Great lecturer and easy-going guy. Lots of online resources to help you prepare for tests and coding assignments. Only thing I didn't like was that we had to write unnecessary tests for our code, and that felt like busywork.",
      "Very good teacher, lots of homework but they definetly help you out and make you learn the material, old tests are online so they you can prepare-best idea ever.",
      "He was a great teacher and very happy to teach. His patience is without bounds and he keeps all his power points online for easy referral. Plus, all his old tests are online so it's great practice for tests. Start assignments early and do the practice tests before the exams!"
    ]
  ],
  [
    "University of Texas at Austin-Mitra, Shyamal",
    {
      "online": 1
    },
    [
      "Two programming assignments per week, simple quizzes based on last lecture every lecture, and occasional online reading assignments which are free grades. Tests are fairly doable, mostly closely related to the homework and generally simpler than homework. Relatively a lot of work but Dr. Mitra is a great professor with good lectures and feedback"
    ]
  ],
  [
    "University of Texas at Austin-Fraij, Fares",
    {
      "online": 1
    },
    [
      "Fraij is a very nice guy who cares that his students understand the material, but his lectures are very boring. It's hard to pay attention, but he does post all his notes online. Tests are fair, but they are a time crunch. Overall, solid professor, and I learned a lot from his course."
    ]
  ],
  [
    "University of Southern California-Papa, Marco",
    {
      "youtube": 1,
      "online": 6,
      "video": 3
    },
    [
      "Prof. Papa manages a hard class. That is why some people find it too difficult and complain. BUT I got an internship at Google's YouTube just because of what Prof. Papa taught me. If you want a job in Webtech, this si the class to take. Highly recommended.",
      "This class got me an internship at Amazon! I had everything to nail the interview: nodejs, pHP, angular and most of all AWS. the prof. Is always online day and night on Piazza. My doubt were solved in minutes. The exercises are HARD. Don't take this class if you do not have time. I spent many nights working on the web app and mobile app. Take this.",
      "Course is harder than I thought. Prof has lots of industry experience. Piazza is used 100% for solving my doubts. Glad Papa is flexible to change and dump the videos (really boring) and replace with hands-on demos. Exams require some memorization and lots of JavaScript knowledge. But I am glad I took it. Requirement for CSCI572.",
      "Prof. is good. Listens to students: dropped the crappy videos and started doing demos, which solved all my s/w installation doubts. would recommend. It's hard, though.",
      "One month to go in this course, and I am glad I signed up. Great material. I disliked the slides, though. I am glad Prof. Papa switched to hands-on demos. Much better. Also glad no more switching on spec online. Glad the prof is listening to students complaints. That's refreshing. I will take CSCI572, as definitely I have all needed background.",
      "Prof. Papa provides great new material. Just saw stuff on AWS Lambda and Google Functions, the server less stuff. It is going to help together me a job in web tech easier. Prof. is online on Piazza at all hours, day and night. Weird but great. I recommend for everyone interested in web tech. The class is not easy, though.",
      "Professor Papa is one of the best professors at USC. He is always responsive and he is online on Piazza at any time of the day or night if you need help. CSCI 571 was an amazing class, especially if you are new to Web technologies. It was well-organized, interesting, and the lectures were great.",
      "Just started taking this class. Earlier lectures are really cool. Also the classroom is amazing and Prof. Papa is using all the screens for a very good audio/video presentation. I am really looking forward to attend the rest of the course.",
      "Attending this class gave me access to an internship at Google. There is no book required, all the slides are available online, though I decided to attend the lectures so I could ask questions. Last semester we were able to do AWS and mobile project and it was awesome. Prof. Papa is a great instructor.",
      "Prof Papa is decent for graduate level. People who come in the class expecting to have their hand held will likely struggle. Going to class is not necessary because he simply reads off the slides, but when you ask well-formed questions online (Piazza) he'll respond (he says he doesn't reply to emails). Work is interesting assignments that are easy."
    ]
  ],
  [
    "University of Southern California-Cheng, Bill",
    {
      "online": 1
    },
    [
      "Professor Cheng is a solid choice. The class is full of concepts but he explains everything fairly well. He's very helpful with the assignments, especially debugging. All materials are online and grading criteria are extra clear. The cons: sometimes talks too quickly, and assignments are time-consuming. A good cheat sheet will save you in exams."
    ]
  ],
  [
    "University of Southern California-Cote, Aaron",
    {
      "online": 1
    },
    [
      "You can tell he is really smart just from the way he lectures. He really cares about students having questions and will sometimes stop lecture until someone asks one. He speaks in a monotone but his lectures are pretty clear. He has a very nerdy, dry sense of humor if you're into that. Attendance is not mandatory but he doesn't post notes online."
    ]
  ],
  [
    "University of Southern California-Shindler, Michael",
    {
      "online": 1
    },
    [
      "Professor Shindler is one of my favorite professors at USC. He is genuinely a nice person and enjoys teaching, which is hard to find these days, especially in the computer science department. If you don't understand something, he will go out of his way to help you- you just have to actually reach out for help instead of just complaining online."
    ]
  ],
  [
    "University of Southern California-Raghavachary, Saty",
    {
      "online": 1
    },
    [
      "Learning C++ from the dear professor, switch to Java next week. Despite very short time, professor make C++ be easy and clear. Just amaze by him. I have taken other C++ courses including online ones, read many books but was confused. Now professor has fully educated me. He is brilliant, kind and patient, and knows a lot (everything!). Thanking you!"
    ]
  ],
  [
    "University of Southern California-Shamsian, Shahriar",
    {
      "video": 1
    },
    [
      "He is an excellent professor in my opinion. But some have -ve opinions about him is not because of issue with professor actually, but with the way course is structured. It is hard for anyone to listen for more than 45 minutes whereas the algo classes are almost 3hr lectures. Hence watching lecture videos nextday makes you understand how good he is"
    ]
  ],
  [
    "University of Southern California-Madhav, Sanjay",
    {
      "video": 1
    },
    [
      "He is a funny guy who likes video games and to help his students. Honestly one of the nicest people, let alone professors, that I have ever met."
    ]
  ],
  [
    "University of Southern California-Horowitz, Ellis",
    {
      "video": 3
    },
    [
      "Great material. Prof. uses humor. Too bad always video classes.",
      "Class material is very good, though the videos are so-so. I would change most of them. Prof is funny. Slides should be updated, But the class is very useful for internship at Google and Yahoo. Which I did get.",
      "Good professor. Projects are good. Videos not that good. Helps with sarcasm. Lecture notes could be better. Professor is available when I have doubts. I recommend."
    ]
  ],
  [
    "University of Southern California-Greenfield, Nathan",
    {
      "online": 1
    },
    [
      "He's a funny guy. Willing to help with labs very well during office hours. Would recommend. Unlike ITP165, there's no lab after lecture, so you don't need to go to every class as the lecture slides are online. Homework is assigned every two weeks compared to every week from ITP165, but they're much longer and harder so be prepared."
    ]
  ],
  [
    "University of California San Diego-Ord, Rick",
    {
      "online": 5,
      "website": 7
    },
    [
      "Class put me to sleep sometime but he really knows his stuff. Assessments were basically the same as what he posts online on his class webpage, so study those. Start early start often",
      "This class requires a lot of time and effort but Just learned so much and i purely think how much you put it in this class will determine your grade in the end. There are tons of practice midterm, quiz, finals on his website so there are really no excuse . Lastly the tutors are just awesome they are really knowledgeable. Start early start often",
      "Rick is a great professor. There are practice quizzes, midterms and finals on his website that are nearly identical to the real things. You will spend a lot of times in the lab on the assignments. Easy to get an A, but it's very time consuming.",
      "Quizzes/midterms/final are really easy if you study the past tests that he provides online. Programming assignments can be challenging unless you get lucky and get a genius partner.",
      "If you've taken a class with him before, you pretty much know how the class is going to go. Quizzes and exams are almost exactly like the practice/previous ones he has listed on his website, and the programming assignments were pretty fair (just make sure you start SUPER early!)",
      "Awesome teacher. Very fair with his grading but you have to read all his extremely helpful handouts and do the practice midterms and quizzes he has on his website. The programming assignments are not easy but if you start EARLY and go to discussion you should be fine.",
      "Great prof, very clear, occasionally funny, nice...really easy class. Don't need to buy the textbook, notes are online..just have to listen in lecture for little facts that aren't in the notes for the quizzes and tests. Very straightforward labs.",
      "Excellent professor. Take him whenever possible! He posts lots of his old quizzes and tests online. Not much bad I can say about him except that when I took his class, he was reformulating the curriculum a little and the new parts of the programming assignments were confusing. He probably has it straightened out by now.",
      "The coolest cse prof you'll ever have. Great sense of humor, down to earth and very good at teaching. Strong command of material. Knows how to deliver material that could easily be very bland a dry otherwise. Quizzes are a bit rushed, but all his old quizzes are posted on website so you know what he will ask. I highly recommend him!",
      "He is a very nice guy who trys to make class fun with comics. He puts his lecture slides online and spends class time on other stuff so he doesn't have much time for lecture. An easy class and you can definitely pass without going, but a lot of the stuff he talks about in class that isn't online shows up on the test. Tests are easy enough.",
      "If the quarter you're taking it hasn't started yet, I really recommend you going to the website (ieng9.ucsd.edu/~cs30x) and download all the past quizzes/exams NOW. no links to them once the quarter starts. Easy class, there are readings but you don't have to do them, save money don't buy the book.",
      "Best CS teacher I've had. Programming assignments aren't overly difficult, and he gives tests/quizzes that are very similar to the practice ones he puts on the website. Pretty easy to get a good grade in this class."
    ]
  ],
  [
    "University of California San Diego-Cao, Yingjun",
    {
      "online": 2
    },
    [
      "There's a lot of work in this class. (Labs, quizzes, homework, midterms) He posts everything online. He even posted the podcast of when we took our midterm, so it was a podcast of us staring at a watch for 80 minutes. But he is pretty good at explaining and he tries really hard. Getting a passing grade isn't hard, but you have to work for the A.",
      "Awesome class. He was very clear and you knew exactly what he wanted you to know thanks to his good use of iclicker questions. My only problem with the class was the fact every assignment (once a week) was with a partner. All around, easy and well-educating class. And he podcasts. Find the book online."
    ]
  ],
  [
    "University of California San Diego-Langlois, Marina",
    {
      "website": 1,
      "online": 1
    },
    [
      "She's a great lecturer. I thought the grading was a little ambiguous, but she did provide a great deal of extra credit opportunities. I learned a lot in her class, and the assignments were very helpful, and also very difficult. There were a couple that I didn't finish in time. She had us using several different websites for homework, confusing.",
      "Kindest professor I've ever seen in UCSD. Assignments are useful. Instructions on assignment can be sometimes not clear, but she is there for you in person or on piazza if you ask. She does have an accent but I am able to understand. Exams are fair enough if you do understand the lecture material and read some online resources yourself after class."
    ]
  ],
  [
    "University of California San Diego-Alvarado, Christine",
    {
      "online": 2
    },
    [
      "Nobody can teach data structures better than her. She had open-ended programming assignments, challenging optional extensions, an amazing free online text book. Her tests are from her quizzes , worksheets and slides. Her TA' s and tutors were great. I just wish we didnt have work every day and had a break between assignments. It was too stressful.",
      "Alvarado is energetic and knowledgable. Lectures are very clear; slides are usually posted online the night before. The reading is redundant if you go to lecture or can read Oracle's documentation, but there are reading quizzes at the beginning of most classes. 4 very short in-term exams were manageable with light studying, final moderate."
    ]
  ],
  [
    "University of California San Diego-Mirza, Diba",
    {
      "online": 2
    },
    [
      "She is one of the best CSE professors I have had in my a little longer than one year of college. Her lectures are pretty clear. Not too many programming assignments. A quiz per week online which you can do twice. Exams are not hard as well as long as you study it. I am so glad I took her CSE 30 in her last quarter at UCSD. Great professor!",
      "Professor Mirza's lectures are clear and does a really good job of condensing the reading into a nice set of annotated slides which are made available online after class. Would take her again."
    ]
  ],
  [
    "University of California San Diego-Simon, Beth",
    {
      "online": 1
    },
    [
      "Class isnt hard, it's just that there is a lottt to do. Labs are annoyingly long and can take the whole 2 hrs. Might be best for you to come in 30 min earlier to make sure you finish on time. There is a quiz every week (lowest two dropped), a project, a midterm, a final, and some other little random assignments online that take about 10-20 min."
    ]
  ],
  [
    "University of California San Diego-Graham, Ronald",
    {
      "online": 1
    },
    [
      "Do yourself a favor and either go to his lectures or listen to the podcasts. The textbook sucks and you will be hard pressed to find good material on the subject online. Other than that, pretty easy class. The final was 65% of the grade, but it was easy. Came out with an A+ and I never went to class - I just listened to his podcasts."
    ]
  ],
  [
    "University of California San Diego-Tiefenbruck, Janine",
    {
      "online": 1
    },
    [
      "Her lecture is super clear and detailed. All the podcasts and slides are posted online. The group homework is pretty hard but if you spend time in office hours it wont be that hard since the TA and profs will explain all the problems pretty clear. Got full score on all group HW. 98% and 100% on 2 midterms and 95% on final. Hard work required."
    ]
  ],
  [
    "University of California San Diego-Rhodes, Neil",
    {
      "online": 1
    },
    [
      "Excellent teacher. His lectures are interesting and he has a good teaching style and sense of humor. He puts templates for the notes online that you can print out and then write on in lecture. He gives weekly quizzes taken almost directly from the homework. The exams are challenging but fair."
    ]
  ],
  [
    "University of California San Diego-Porter, Leo",
    {
      "video": 1
    },
    [
      "Prof Porter really cares about his students. Reading isn't needed at all and you don't have to go to class, it's video podcasted. You do get some participation for going which otherwise is part of your grade on the final. Midterm was fairly easy (85% average), homework is average difficulty, and final had a 69% average but a pretty solid curve."
    ]
  ],
  [
    "University of California San Diego-Gao, Sicun",
    {
      "website": 1
    },
    [
      "My first time rating a prof on this website because I'm just that satisfied with this professor. Literally the most chill, down-to-earth professor I've had so far. He's super approachable so don't be afraid to talk to him like you are with your other professors. Not only is the class easy as long as you keep up, you learn a ton of cool stuff too."
    ]
  ],
  [
    "University of California San Diego-Camac, Kyle",
    {
      "video": 1
    },
    [
      "Kyle provided informative video lectures for the class. This class is the last class in the certificate program for data mining. I enjoyed the program and I look forward to possibly taking more courses for the other data analytics certificate programs at UCSD."
    ]
  ],
  [
    "University of California San Diego-Tullsen, Dean",
    {
      "online": 1
    },
    [
      "Do NOT cheat/copy homework, you will be caught. Midterms and Final were excruciatingly difficult. Go to class and office hours, they are very helpful (and Tullsen helps out those who show a lot of effort). Lecture slides are online, but fill in the blank (so you might as well show up)."
    ]
  ],
  [
    "University of Waterloo-Vasiga, Troy",
    {
      "online": 1
    },
    [
      "He is very clear. He was my favorite professor that term. Also he was really helpful after class and he answer all the questions in the class online discussion page!"
    ]
  ],
  [
    "University of Waterloo-Lushman, Brad",
    {
      "online": 1
    },
    [
      "Very good prof. Helpful during and after class, will try to make time to help you if you have an issue outside of appointment time. Provides notes online and hints during class."
    ]
  ],
  [
    "University of Waterloo-Ivkovic, Igor",
    {
      "video": 1
    },
    [
      "I didn't find CP102 that easy and I've spent a lot of time studying. The instructor tried really hard to make it interesting to us. I really enjoyed the videos on new technology that he showed in class. I recommend that you attend lectures or you will be lost otherwise."
    ]
  ],
  [
    "University of Waterloo-Kaplan, Craig",
    {
      "online": 1
    },
    [
      "Very intelligent and passionate about his subject to boot. Clear, organized lectures and slides posted online."
    ]
  ],
  [
    "University of Waterloo-Sakhnini, Victoria",
    {
      "online": 1
    },
    [
      "She offered to skype students who needed help up until the exam. Big heart, little bit of an accent, solid prof. Free online textbook, which isn't even necessary, but don't buy your own textbook."
    ]
  ],
  [
    "University of Waterloo-Lau, Lap Chi",
    {
      "online": 2
    },
    [
      "Lap Chi was one of the best CS profs I've had at UW. It really showed how much he cared that we learned. He had very good hand-written notes available online before class. He structured the content for programming and proof-style content for assignments and made sure there were bonus marks on almost everything. Really enjoyed the course due to him",
      "Although his accent might be tough to understand in the beginning. He goes through each topic slowly and clearly. Which means that you can understand the topic being taught but at the same time it could make the classes feel long and boring. He posts his actual full lecture content in written form online so you can concentrate in class."
    ]
  ],
  [
    "University of Waterloo-Orchard, Jeff",
    {
      "online": 1
    },
    [
      "Genuine interest in the course. Well prepared notes, just make sure you show up to class as he doesn't post them online."
    ]
  ],
  [
    "University of Waterloo-Goldberg, Ian",
    {
      "blog": 1
    },
    [
      "He is the security guy. Very funny person and relaxed lectures. He gives a lot of stories and you learn a lot more than the slides. Lecture slides are clean and organized. Grading is pretty tough for some reason. Assignments are hard and somewhat long. Exams are fair but tricky. Has blog task and it's tedious to read. Gotta work hard and learn alot"
    ]
  ],
  [
    "University of Waterloo-Hackman, Rob",
    {
      "online": 1
    },
    [
      "Fun prof, did an online exam prep session which was really nice."
    ]
  ],
  [
    "University of Waterloo-Anderson, Terry",
    {
      "website": 1
    },
    [
      "Excellent overall prof. Funny guy and very good at teaching concepts. CS is pretty hard but he makes it easier. Very good at explaining during officer hours. Only issues I had was that he didn't show up twice during lectures, and cancelled office hours (he holds 3) without posting on the CS website that he wasn't coming."
    ]
  ],
  [
    "University of Waterloo-Gao, Alice",
    {
      "online": 1
    },
    [
      "Loved her class, even though I hated the course, if that says anything. She used slides + handwritten notes that were always posted online after. Caring, engaging and knowledgable prof. I really admire her efforts in trying to improve as a lecturer and also to motivate students. Hope to have her as a prof again. she's goals tbh"
    ]
  ],
  [
    "University of Waterloo-Hoey, Jesse",
    {
      "website": 1
    },
    [
      "Explained things very well. Posted all examples onto the website. Assignments were interesting even if sort of hard to start if you have no background. At the end of the day, you'll be proud of what you've done through the assignments. Definitely not a tough grader. Very nice guy. Love you Jesse :)"
    ]
  ],
  [
    "University of British Columbia-Carter, Paul",
    {
      "online": 4,
      "coursera": 1
    },
    [
      "SO GOOD! Great at explaining things, packs his lectures with information and makes students follow along always taking questions. Also answered questions on the online course platform very quickly. (This was an in-person course with Piazza and Coursera)",
      "SO GOOD! Great at explaining things, packs his lectures with information and makes students follow along always taking questions. Also answered questions on the online course platform very quickly. (This was an in-person course with Piazza and Coursera)",
      "Good professor. But.. he basically goes through problems that are already posted online (with solutions). Organized slides, everything's cool. The course however, is brutal. Stay on top of everything or else you're doomed. Don't dig yourself into a hole...",
      "his online notes rule.",
      "I like his online notes."
    ]
  ],
  [
    "University of British Columbia-Belleville, Patrice",
    {
      "online": 3
    },
    [
      "Awesome prof, disliked his worksheets near the end of the term tho. Don't buy a textbook you can easily find pdf online",
      "Amazing Prof. His lectures can seem like a lot to take in but all his notes are posted online and he explains things really clearly in office hours. Definitely a great prof for this difficult course.",
      "Very enjoyable prof that gives good notes, whether it be online or chalk. Isn't necessarily his fault that he's always teaching the hardest courses- in fact that must be a testament to his skill ;)"
    ]
  ],
  [
    "University of British Columbia-Wolfman, Steve",
    {
      "video": 3,
      "youtube": 1
    },
    [
      "His lectures are probably the highlight of this course. Be prepared: the course has an ASTRONOMICAL workload (10 hours a week at least). Between the problem sets, the practice problems, the videos, labs and studying for the tests, you'll be completely screwed if you fall behind. It is not impossible; with LOTS of practice, you can do very well.",
      "Steven is such a funny guy He always has some jokes during lectures, but sometimes he just goes too fast... No textbook but videos! I have to say that the exams are hard if you do not keep up with the material and get enough practice. It's really IMPORTANT to stay with him! Really like him",
      "Steve is a funny, kind, and nice guy. He's a great prof. Textbook is completely unneeded and attendance isn't necessary—the best way to master this material is through youtube videos. If Steve really wanted to make his lectures useful, he'd get a bunch of paper cups with numbers on them for algorithm demonstrations. Too much emphasis on proofs.",
      "Steve is a funny, kind, and nice guy. He's a great prof. Textbook is completely unneeded and attendance isn't necessary—the best way to master this material is through youtube videos. If Steve really wanted to make his lectures useful, he'd get a bunch of paper cups with numbers on them for algorithm demonstrations. Too much emphasis on proofs."
    ]
  ],
  [
    "University of British Columbia-Kiczales, Gregor",
    {
      "online": 3,
      "video": 12,
      "coursera": 1
    },
    [
      "Strict but amazing prof. Comp sci is hard but he does his best to teach his students. I took the online section but I met him in person as well because he was interested in feedback to improve the course. Tbh all the CPSC110 profs are great, you can't miss.",
      "CPSC 110 is a beginner-friendly course, but is very fast-paced. You MUST keep up with the video lectures and problem sets. If you fall behind, you will be in trouble. If you keep up, this course is straight-forward and its really easy to do well. Gregor's video lectures explain concepts very well and he is very helpful on the discussion forums.",
      "Gregor is hilarious and teaches the material very well and reinforces them by giving clicker quizzes at the start of every lecture. The overall course isn't very challenging but that is only if you keep up with the video lectures and practice problems. He is also hilarious and inspiring, highly recommend.",
      "Possibly the most intelligent man I've ever been taught by, but he doesn't make you feel dumb. If anything, he teaches the course in a way that makes you feel accomplished in what is being taught. The course is quite (nee very) difficult, but keeping up with EdgeX videos and attending lectures will keep your head above water. Inspiring prof.",
      "Gregor is one of the best prof I met in UBC. He might look serious but he is super approachable and patient outside class. I am not in his section but I sometimes go to his office hours. He explains everything in a super clear efficient and encouraging way. 110 is a hard course but Gregor and his videos make everything better.",
      "Great prof, pretty much people who do well rate high and people who fail rate low. Watch your videos and practice because you will fail if you dont. The difficulty of the course is irrelevant to Gregor as a professor, and you need to spend time or else you will not do well.",
      "Especially if you haven't programmed before, you need to be 100% on top of the homework and reading/video material. Start on assignments early. The lectures fill in the gaps with concrete examples and walk-throughs and Gregor is tough but fair. Exams were pretty reasonable.",
      "As long as you keep up with the videos and do your practice, his teaching really drives you to learn",
      "Dr. Kiczales is the one who designed the entire course (CPSC 110) so he knows the material extremely well and answers student questions with 100% clarity. Attend lectures as he gives good problems to try. Watching the videos is a must as you will be lost if you don't. Expect to put in more time at the beginning of term if you have never programmed.",
      "Prof. Kiczales teaches the ideas universally used in CS. Some topics are harder to grasp and you may end up spending more time on homework than you'd expected. However, the online lectures and plenty of TA hours are there to help. Just open your mind & expect mood swings from \"HAHA, I'm a mighty god!!\" to \"Never will touch programming again!!!\"",
      "Coursera videos are really detailed and helpful for learning the concepts. The final exam was much harder than the midterms.",
      "Coursera videos are really detailed and helpful for learning the concepts. The final exam was much harder than the midterms.",
      "Everyone here is complaining how the course was ridiculous and unclear. Although the course was VERY time consuming and stressful at times, Gregor did well at explaining and the in-class problems helped a lot. If you paid attention to the problems he was doing in class, it's easy. Videos were very helpful but needs better explanation in lectures.",
      "I feel that this course has been made too difficult to be considered a \"beginner\" 4 credit course. The videos we watch online are easy to understand, however if you have a heavy-ish course load... DON'T TAKE CPSC110. Spare yourself from that. This course requires ~15hours of DEDICATED TIME PER WEEK. If cpsc110 is req, then take it. OTHERWISE DON'T!",
      "I feel that this course has been made too difficult to be considered a \"beginner\" 4 credit course. The videos we watch online are easy to understand, however if you have a heavy-ish course load... DON'T TAKE CPSC110. Spare yourself from that. This course requires ~15hours of DEDICATED TIME PER WEEK. If cpsc110 is req, then take it. OTHERWISE DON'T!",
      "One of my favourite profs so far, he's very clear about what he expects of his students and his teaching is very clear. Attend lecture, do practice problems, watch the videos, etc. and it'll be an easy A/B."
    ]
  ],
  [
    "University of British Columbia-Knorr, Ed",
    {
      "online": 2
    },
    [
      "Ed is a great guy and he posts pdf notes online, but he don't always post the annotations. The lab was so hard in the beginning but they changed it half way through. He's really passionate about teaching and I enjoyed him a lot.",
      "His lectures consist of iClicker questions, going over the key concepts from the screencasts posted online, then handing out problems for students to work on in class. occasionally, he does bring about some insights related to computer science/engineering, which are useful informations to keep in mind. Great professor overall."
    ]
  ],
  [
    "University of British Columbia-Eiselt, Kurt",
    {
      "online": 1
    },
    [
      "Not bad. Like what everyone else said, he definately could have covered a lot more in the course. But then again, maybe he didn't cover too much because this was only an introductory A.I. course. Excellent online summary notes."
    ]
  ],
  [
    "University of British Columbia-Estey, Anthony",
    {
      "video": 5,
      "online": 2
    },
    [
      "A very kind guy. His lectures were entertaining and he made going over the stuff that we already watched in the videos less boring. He made a course that can be somewhat hard much easier. Lots of office hours as well, so that's a plus. If you want a great CPSC 110 experience, try and get a spot in Anthony's section. You won't regret it!",
      "CPSC 110 is basically a self-study but his lectures always helped me piece together the things I learned through the online course material. Great prof. Anthony is like the Luke Skywalker to Gregor's Obi-Wan. Don't worry, this will make sense after you take this course.",
      "By far the best prof I've had at UBC so far. CS in seemed intimidating at first, but the two different teaching styles in Gregor's videos and Anthonys lectures helped me understand the course better and really inspired me to like cs. Anthony also had a LOT of office hrs so u could go ask Qs and do problem sets there with a nice group of people.",
      "Great explanations. Make sure you go to class to really learn what is going on. The videos can only help so much. Also very helpful during office hours so if you're ever confused, go!!!",
      "Just a really nice prof overall. Lectures are often a rehash of the videos, but are useful nonetheless; he goes over examples in class. Holds lots of office hours, sometimes even on weekends. Really recommend him.",
      "He makes me love CPSC!! The best lecturer I've ever had, who is willing to devote extra office hours (even during weekends) before exams. He explains programming clearly and really wants to ensure everyone gets it. His paper is easier relevant to Gregor. The online video is time-consuming but helpful for students with no prior cs background",
      "He makes me love CPSC!! The best lecturer I've ever had, who is willing to devote extra office hours (even during weekends) before exams. He explains programming clearly and really wants to ensure everyone gets it. His paper is easier relevant to Gregor. The online video is time-consuming but helpful for students with no prior cs background"
    ]
  ],
  [
    "University of British Columbia-Voll, Kimberly",
    {
      "online": 1
    },
    [
      "Awesome! She clearly knows what she is talking about and she makes it really fun and interesting. The most helpful prof I have encountered at UBC, if you need to turn something in late or make up a quiz, she is great about it. Make sure you check online for announcements though, that's her main mode of communication."
    ]
  ],
  [
    "University of British Columbia-Baniassad, Elisa",
    {
      "online": 2,
      "edx": 1
    },
    [
      "I know Ms. Elisa from edX online courses. She is inspirational. She has wonderful speaking and teaching skill.",
      "I know Ms. Elisa from edX online courses. She is inspirational. She has wonderful speaking and teaching skill.",
      "Elisa is an amazing professor. I only went to a handful of classes all semester because it is my only class and in the morning but she was excellent in all of them. Super engaging and moves at a student-friendly pace. All material is posted online so lectures are not mandatory. Exams aren't too bad though the format is a little weird."
    ]
  ],
  [
    "University of British Columbia-Pottinger, Rachel",
    {
      "online": 1
    },
    [
      "Rachel actively encourages class participation and by the 2nd or 3rd week had learned the names of every class member. Homework is submitted online and you are allowed to keep submitting until you get it prefect... providing me with the most amount of learning and least amout of stress of any CPSC class I've taken. I highly recommend her!!"
    ]
  ],
  [
    "University of British Columbia-Schroeder, Jonatan",
    {
      "online": 1
    },
    [
      "Speaks as clear as he can and take loads of questions, so expectedly his lecture is very accommodating to the slower students. He uses flipped classroom format so be prepared to read/watch screencasts, but the grading scale is fairly forgiving. Answers online question very quickly and helpfully."
    ]
  ],
  [
    "University of British Columbia-Holmes, Reid",
    {
      "video": 4,
      "online": 1
    },
    [
      "While the videos made it tempting to not go to class, a small sample from my friends this term found that attending class had pretty big impact on the final grade.",
      "Reid is great. If you have any interest in software his lectures are well-worth attending. The material is super easy - especially coming from previous industry experience. Choose your partner well and the project will be a breeze. The true/false midterm/final is annoying, but studying for it really just involves going over the videos/notes.",
      "Material seemed conceptual at the time but ended up being super useful on my next co-op term. Video lectures have been really nice for review while on co-op too.",
      "Reid video taped all his lecture material and put it online this year. This ended up being great for me because I was ab,le to review the weeks content in advance and only go to lectures when I knew I needed more time to work on the tricky material class time was mostly spent on hands-on activities, so those were useful and fun in general.",
      "Reid video taped all his lecture material and put it online this year. This ended up being great for me because I was ab,le to review the weeks content in advance and only go to lectures when I knew I needed more time to work on the tricky material class time was mostly spent on hands-on activities, so those were useful and fun in general."
    ]
  ],
  [
    "University of British Columbia-Gao, Xi",
    {
      "online": 1
    },
    [
      "Puts a lot more effort into teaching the course than the other professors. Real focus on understanding the material through in class exercises rather than students just blindly copying notes or slides. Her notes are nicely written, straight to the point and posted online so you can focus on solving the problems in class. Very good teaching style."
    ]
  ],
  [
    "University of British Columbia-Madooei, Ali",
    {
      "youtube": 1
    },
    [
      "Ali is a great professor. Goes out of his way to help students, he did a 3+ hour review session live stream on youtube before each of our midterms. He is also a really funny guy and you won't get bored in his class."
    ]
  ],
  [
    "University of British Columbia-Ola, Oluwakemi",
    {
      "online": 2
    },
    [
      "I was online but I sneaked into a couple of her lectures. Ola is an amazing person. She explains the material really well and cares so much about the students. She tells great stories and makes the lectures really fun.",
      "Great professor + genuinely took feedback to improve course. average was 81 course content isn't hard but if you're looking for more useful applications take CPSC110. online quizzes aren't hard b/c it's from the lecture notes + best 3/5 quizzes. group work - &quot;15%&quot; but more like 7.5% since you get marked on group feedback etc. would recommend her"
    ]
  ],
  [
    "University of British Columbia-Garcia, Ronald",
    {
      "online": 1
    },
    [
      "He's the one 110 prof that really tries. Funny. Great personality. Friendly. Not the best prof ever! But definitely better that Meghan Allen! Not too much better than Gregor and Ron in terms of teaching. If you're looking for an A on this course you should keep up with all the assign. and practices online and go to office hours as much as you can."
    ]
  ],
  [
    "University of British Columbia-Greif, Chen",
    {
      "online": 1
    },
    [
      "Professor Greif clearly cares about his class. I would highly recommend taking a class with him. I really appreciated the enthusiasm and humour he brought to each lecture. His midterms were challenging but fair, assignments are long but constructive to learning. The course comes with an excellent text that is free through the UBC online library."
    ]
  ],
  [
    "University of Alberta-Ahmed, Sadaf",
    {
      "online": 3,
      "video": 1
    },
    [
      "She really wants the students to learn, and tries to think of unique ways to get her message across. She has an accent, but you can still easily understand her. She has a lot of different grading criteria, such as pop quizzes, online quizzes, and exams. The exams are not heavily weighted, which is nice. No powerpoint with notes.",
      "Best professor I have had (yet). She does a good job at getting the tougher concepts across by using analogies. By attending all the lectures you will learn everything you need to do well in the course. The exams are pretty easy, so don't stress over them, and make sure to get online vignettes over with asap.",
      "I had no coding experience prior to taking this class and at first I found it tough, but Prof. Ahmed was super helpful and really helped explain the concepts well. The online videos you have to watch in the beginning are super annoying but really important to establish base knowledge. Go to class and follow along and you'll do great.",
      "I had no coding experience prior to taking this class and at first I found it tough, but Prof. Ahmed was super helpful and really helped explain the concepts well. The online videos you have to watch in the beginning are super annoying but really important to establish base knowledge. Go to class and follow along and you'll do great."
    ]
  ],
  [
    "University of Alberta-Zaiane, Osmar",
    {
      "online": 1
    },
    [
      "There is no need for a textbook. All the material and slides are provided online. He is very attentive to the students. Very approachable.. One of the best profs I had in CS. The course has a lot of work and lab uses crappy VM machines, but recommend the course and definitely recommend the prof. I learned a lot and will use what I learned."
    ]
  ],
  [
    "University of Alberta-Szafron, Duane",
    {
      "online": 1
    },
    [
      "Amazing prof. Makes computing approachable. Great at rephrasing topics, drawing pictures for explanation. Labs were fun but hard, and mandatory to be with a partner. Spent a lot of time outside of lab time working on it. Prof was super quick to answer emails and online forum posts though. Super fun class, even with all the work. Tests were easy."
    ]
  ],
  [
    "University of Alberta-Stewart, Lorna",
    {
      "online": 2,
      "youtube": 1
    },
    [
      "A great prof who tried her best to keep class engaging. Well organized notes, which were posted online. Assignments and seminar questions were similar to those on the midterms and final.",
      "Class is quite boring, but her notes (posted online) are fantastic. Speaks slowly and monotone, but knowledgeable. If you require a good lecture to learn, find another prof, but if you just need good notes take her class!",
      "Very good prof, falls just short of what I would call a great prof. Explanations are quite good, although be sure to YouTube a lot of topics for further clarification. Not the greatest prof ever, but by no means a bad one. Recommended."
    ]
  ],
  [
    "University of Alberta-Hindle, Abram",
    {
      "video": 2,
      "youtube": 1
    },
    [
      "This professor gives a lot of materials(Both videos and text notes) for studying.",
      "Best prof I've ever had. Not sure where the last person was coming from as he gave practice midterms and finals as well as extensive notes, supplementary youtube videos and was very responsive to any questions asked on the forum or directly. Overall he cares a lot about his subject matter and really seems to want students to succeed. A++ prof.",
      "Best prof I've ever had. Not sure where the last person was coming from as he gave practice midterms and finals as well as extensive notes, supplementary youtube videos and was very responsive to any questions asked on the forum or directly. Overall he cares a lot about his subject matter and really seems to want students to succeed. A++ prof."
    ]
  ],
  [
    "University of Alberta-Smith, Jacqueline",
    {
      "online": 1
    },
    [
      "Clear speaker, fairly interesting, willing to help. Class was graded on a midterm, a final, 3 assignments and a weekly lab. Only complaint: no solutions were posted for practice exams and problems. Don't skip class after the midterm. Free access to an online textbook (which is also optional)."
    ]
  ],
  [
    "McGill University-Kry, Paul",
    {
      "film": 1
    },
    [
      "Awesome prof and interesting material in my opinion! He made class fun by sometimes playing short film clips or sounds from movies to introduce the next topic. When it came time to study for the final, it was genuinely fun to study since most of the topics were well explained and still clear in my head."
    ]
  ],
  [
    "McGill University-Panangaden, Prakash",
    {
      "website": 2,
      "online": 1
    },
    [
      "Prakash is great, he explains concepts clearly in an easy to understand way. The additional notes on his website are well written and very helpful. The expectations for assignments and exams are precisely given which makes them easy to do if you put some work into understanding the concepts. All classes I took with him were amazing experiences",
      "Prakash is the best. He is very clear in lecture. He is very humours. He provides fantastic notes on his website which is very useful. Assignments are not hard and they are very fun! Midterm is fair and the average is around 75, which is rare in 3-level comp courses. I would definitely wish to take any other comp courses with him again.",
      "Amazing prof, really cares about his students. Posts very detailed notes online to make sure everybody understands. Lectures are entertaining and funny. Assignments are very interesting. Exams are fair and the exam material is explicitly laid out beforehand. He puts emphasis on the exactness of communications to avoid any ambiguity."
    ]
  ],
  [
    "McGill University-Langer, Michael",
    {
      "online": 3,
      "website": 2,
      "upload": 1
    },
    [
      "Great slides and a very fair final exam. No midterm, only bi-weekly online quizzes and 4 assignments throughout the semester. Only thing is he can be a bit condescending when people ask questions...",
      "Prof Langer is amazing! The lectures are very organized and easy to follow. He keeps incredibly detailed lecture notes and presentations on his website and his assignments are very fair as long as you follow the instructions carefully. He will even sometimes let you to resubmit assignments for a higher grade if you messed up the first time.",
      "One of the best! Clearly structured lectures with amazing notes. Prepares us well by giving exercises that are similar to the questions on exams, so take the time to do them all. Everything we need to succeed is accessible online on the course page. Assignments take some time to figure out, but are very reasonable. Overall an amazing professor.",
      "Great lecturer, really knows the course material, fair exams and fair assignments. Like all comp courses, the assignments can take a while, so don't expect to simply cruise through them. He also provides extra notes and exercises on his website. Srsly, I'm down to take any class this man teaches!",
      "One of the best profs I had at McGill! He's an amazing lecturer and his notes are very clear. He answered every question on the discussion board (even on the days of the exams) and uploads lecture recordings. Gave us an easy midterm but the final was pretty hard. Exams are within the scope of the course but you need to understand the concepts well.",
      "he gets annoyed when people ask questions but posts all his lectures online with notes. i had trouble with the final from his notes so make sure you pay attention and keep up all semester"
    ]
  ],
  [
    "McGill University-Pomerantz, Daniel",
    {
      "website": 1
    },
    [
      "Dan Pomerantz is an awesome prof, he really got me interested in computer science. The course is usually a midterm and final, with 40% assignments, which aren't really that hard. The lectures are really fun and help you understand a basic level of how computers work and there roles in security, websites, search engines, etc."
    ]
  ],
  [
    "McGill University-Alberini, Giulia",
    {
      "online": 1
    },
    [
      "Giulia is such a sweet professor. Her lectures are very well-organized and all the recordings are online along with most of the codes we use during lectures (practice codes). Giulia also answers quickly to most of the questions about assignments and exams on the discussions (MyCourses) which is very helpful. I definitely recommend this professor."
    ]
  ],
  [
    "McGill University-Blanchette, Mathieu",
    {
      "online": 1
    },
    [
      "Great prof, fun course. All the slides are online, easy to follow."
    ]
  ],
  [
    "McGill University-Precup, Doina",
    {
      "online": 1
    },
    [
      "Very productive lectures, with easily legible and audible recordings posted online. Besides that, Doina seems to be the least organized professor at McGill. Feedback (grades on assignments, etc.) does not come in any form until the weeks directly prior to the final, and the students are not kept updated on this process at all."
    ]
  ],
  [
    "McGill University-Siddiqi, Kaleem",
    {
      "online": 1
    },
    [
      "Great prof who is being judged unfairly by some who don't realize that in any CS class, a lot of the learning comes from looking stuff online and teaching some stuff to yourself. Also, lecture recordings in this class were a lifesaver and allowed me to thoroughly understand topics I could not comprehend in class. High class avg and fair exams."
    ]
  ],
  [
    "McGill University-Devroye, Luc",
    {
      "website": 1
    },
    [
      "Luc is awesome. Anyways, any prof who posts Playboy pictures on his website can't be unawesome."
    ]
  ],
  [
    "McGill University-Kienzle, Joerg",
    {
      "online": 1
    },
    [
      "Great prof. I knew nothing about programming prior to this class and now i love it. He posts all the slides online, so its not too bad if you miss a class. But if you go, he explains everything very well."
    ]
  ],
  [
    "McGill University-Pineau, Joelle",
    {
      "online": 1
    },
    [
      "Joelle speaks like a textbook. This is impressive but unhelpful - she often failed to simplify the material and provide concrete examples. At least half the course was pure math and probability. Her slides make it very clear what you need to know though, so watch online lectures. The AI tournament was a great project though. Very worthwhile class."
    ]
  ],
  [
    "McGill University-Oakes, Bentley",
    {
      "video": 1
    },
    [
      "He's a lovely man who loves cats and has a quite particular sense of humor (that I really enjoyed!) He is really sweet and has good taste in video games (Wesnoth!), I would recommend taking him."
    ]
  ],
  [
    "Carleton University-Lanthier, Mark",
    {
      "online": 2,
      "website": 1
    },
    [
      "Awesome. Online notes are great. Very nice guy and will give any help you need. Don't even need to attend his lectures, but you'll find yourself going anyways because it's enjoyable.",
      "He's a pretty good professor. There's no textbook for the course, but Professor Lanthier has all the notes for the course (which he made himself) posted online, which are sufficient for learning the material. He goes through the notes each lecture and explains them well using examples, without just reading. He's willing to help anyone who asks.",
      "Goes out of his way to make java fun and the learning sort of sneaks up on you while you're having fun in his class. The clear and comprehensive &quot;textbook&quot; for this course was really a collection of course notes which are available free on his website, but a dead tree version is available for cheap from the CS society."
    ]
  ],
  [
    "Carleton University-Nel, Louis",
    {
      "online": 1
    },
    [
      "Assignments are just extremely hard to understand, you will need to ask a few TAs to get a good grasp. He has a very good layout for the course though, bad lectures are made up with very good ppt slides that are posted online. Tutorials are worth 20% and they're extremely helpful in learning the content, you will fail the course if you miss them."
    ]
  ],
  [
    "Carleton University-Maheshwari, Anil",
    {
      "online": 3
    },
    [
      "Anil delivers amazing lectures. Also provides both his notes online as well as another free textbook to use as reference. Assignments were challenging but doable. Midterm/exam were fair.",
      "Will expect a lot out of you in terms of assignment difficultly and frequency, and for exams. Teaches very well though, and does his best to improve marks (best X of Y assigns taken, made final easier after a hard midterm) Take this prof to learn, but be ready for a busy workload. Clear in class but still might have to look for online material",
      "It's somewhat torturous stuff to get through, but he keeps a decent sense of gallows humour throughout. Good online notes, if you're looking to skimp on the textbook."
    ]
  ],
  [
    "Carleton University-Morin, Pat",
    {
      "online": 3,
      "youtube": 3,
      "video": 1,
      "upload": 1
    },
    [
      "You could probably pass this course without going to class. The textbook is fantastic and its free online, he also includes previous years lectures.",
      "Awesome at lecturing. Lectures are on YouTube which was a blessing, especially if you don't attend class. Assignments were tough but fair. Tests not too hard.",
      "Great guy. He wrote the textbook himself and made it freely available online, which shows that he genuinely cares about giving students a good education. Assignments can be tough though. Prepare to work hard!",
      "He teaches a tough subject with clarity and is extremely respectful and laid back with his students. However don't confuse this with easiness, as he provides difficult assignments and makes you work for your grade. He records his lectures with his a personal video camera, providing the lecture videos for free, and uses a free open source textbook.",
      "He basically just programs in front of the class and asks students what his next step should be. He also posts all the code he writes in class online.",
      "He's teaching style might not make the material easy to understand for students who have no previous programming experience. He's assignments are sometimes challenging, which is good or bad depending on your perspective. lectures are uploaded onto youtube which is very helpful. I enjoyed his classes a lot!",
      "He's teaching style might not make the material easy to understand for students who have no previous programming experience. He's assignments are sometimes challenging, which is good or bad depending on your perspective. lectures are uploaded onto youtube which is very helpful. I enjoyed his classes a lot!",
      "He posts all his lectures on youtube which makes things really easy. If you sleep in just watch the lecture later!"
    ]
  ],
  [
    "Carleton University-Smid, Michiel",
    {
      "online": 1
    },
    [
      "Professor Smid is excellent at providing and explaining the material, but you have to go to class to understand it. Reading his free book is good to understand what he says in class but it's not enough to study solely on that. Assignments are challenging but going to TA office hours really helps. All his past exams and assignments online."
    ]
  ],
  [
    "Carleton University-Bose, Prosenjit",
    {
      "online": 2
    },
    [
      "One of my favorite professors. He explains things very well in lecture, so I suggest attending class while it is not mandatory. He is extremely helpful if you attend office hours. Finally, he provides sufficient resources such as a textbook and practice problems which are free online. Good sense of humor, and ultimately an amazing prof.",
      "Great Prof. Funny and Smart. Assignments were relatively difficult while tests were much easier. He posts notes online which are handwritten and can be difficult to read from time to time. Exam was multiple choice. No textbook required."
    ]
  ],
  [
    "Carleton University-McKenney, David",
    {
      "online": 2,
      "upload": 2
    },
    [
      "I feel bad for never going to class but he's the MVP for uploading all his lectures online. I suck at programming and kind of struggled in comp1006 but that's my fault for not keeping up with the material. Nonethless, he's an excellent prof with a caring personality, and his assignments are always crystal clear. Would definitely take again.",
      "I feel bad for never going to class but he's the MVP for uploading all his lectures online. I suck at programming and kind of struggled in comp1006 but that's my fault for not keeping up with the material. Nonethless, he's an excellent prof with a caring personality, and his assignments are always crystal clear. Would definitely take again.",
      "Professor David is one of the best professors I ever took a course with. He posted all his lectures online, was very responsive and accessible, very caring and understanding. If you put in the effort, you will definitely pass his class.",
      "very good prof. humorous and funny. make difficult CS knowledge easy to understand. upload all useful materials for students. e.x. PDF of textbook. PPT of class. notes. recording of class. clear and fun assignments."
    ]
  ],
  [
    "Carleton University-Somayaji, Anil",
    {
      "video": 1
    },
    [
      "Anil#1! Easy prof to talk to and get help from. Lectures are easy to follow and attendance isn't necessary (he video records every lecture too). Prof wants you to learn and wants students to do well, he makes sure grades come secondary to learning. 10/10, highly recommend any course with Anil!"
    ]
  ],
  [
    "Carleton University-Oommen, B J",
    {
      "online": 1
    },
    [
      "Very fair prof. Make sure you go to ALL the lectures because he doesn't post any notes online, and every single lecture is crucial. He has a very fun way of teaching, as he's very motivated in imparting the material to his students. Go to the TAs for help for the assignments! Free online textbook!"
    ]
  ],
  [
    "Carleton University-Howat, John",
    {
      "youtube": 3,
      "online": 2,
      "video": 1
    },
    [
      "The most amazing thing was about this course is that he is posting his lecturer on Culearn and youtube in order to understand the concepts. I highly recommended to take this course with him. His tests were not that hard. He gives sample test in advance and it is similar to it. great Prof So far for this Course.",
      "I loved how he posted his lectures on youtube, since he talks kind of slow, so I watched on 2x speed. He also uses a Surface Pro as a visual and posts everything he does on it. He's a really knowledgeable prof and you can tell he's made the effort to prepare perfect lectures, with just the right amount of examples for the content.",
      "COMP 1805 is the bane of first year computer science students. The content is difficult, but mandatory. However, John delivers the content in such a way that the course is definitely doable. He gives every possible resource to students, including good office hours, all lectures posted online, practice tests, and is very friendly.",
      "John is prob the only prof who can make this course easy. The sample tests are exactly like the tests and as long as you go to every single lecture (even though he posts notes online and the lecture as youtube videos) and pay attention you'll do great. :D",
      "John is prob the only prof who can make this course easy. The sample tests are exactly like the tests and as long as you go to every single lecture (even though he posts notes online and the lecture as youtube videos) and pay attention you'll do great. :D",
      "John is prob the only prof who can make this course easy. The sample tests are exactly like the tests and as long as you go to every single lecture (even though he posts notes online and the lecture as youtube videos) and pay attention you'll do great. :D"
    ]
  ],
  [
    "Carleton University-De Carufel, Jean-Lou",
    {
      "online": 1
    },
    [
      "The lectures are amazing. One of the few courses that ur tuition fees are finally worthily paid out. He prepared well for his lectures and posted all his notes online. Totally avavilable and attentive when u visit him during his office hours, but hes also a tough grader. Plus, this algorithm class is never made easy."
    ]
  ],
  [
    "University of Ottawa-Turcotte, Marcel",
    {
      "online": 2,
      "website": 1
    },
    [
      "If you find it difficult, I suggest to look at online material he offers (previous exams and lecture notes). Other than that, no need to take notes during lectures!",
      "Good professor. Has a decade's worth of old midterms and finals on his website. Assignments can ramble on with a lot of background information but expectations are always listed clearly. Very knowledgeable.",
      "VERY nice prof, clear slides in class, lots of online resourses. I did not take down a single note in his classes, just attend and listen. Do the many available past midterms/exams and you're good."
    ]
  ],
  [
    "University of Ottawa-Dujmovic, Vida",
    {
      "online": 7,
      "youtube": 1,
      "upload": 1,
      "coursera": 3,
      "video": 2
    },
    [
      "Very responsible prof who records all lectures online. Also willing to help if you go to her office hours for midterms and quizzes to correct past mistakes.",
      "There's nothing new when it comes to mid term and exams. All exams and midterms are multiple choice (same everywhere). Explains well in class which is recorded and uploaded on her youtube channel for revision purposes. Her assignments can be hard but not impossible.",
      "There's nothing new when it comes to mid term and exams. All exams and midterms are multiple choice (same everywhere). Explains well in class which is recorded and uploaded on her youtube channel for revision purposes. Her assignments can be hard but not impossible.",
      "She is a really good prof. Explanations are really good. Dont really need to go to her lectures since she posts them online. Labs are good. The only hard part about the course is her assignments. They get pretty challenging and VERY time consuming. If you go to her and ask her for help, she will definitely help you.",
      "Her lectures are very easy to follow and they're all recorded. Just do the work and review the lectures and you'll do fine. Make sure you know exactly what's happening in your code step by step and do all the Coursera work because that's what the exams are like.",
      "Amazing prof! All of her lectures are recorded and she goes through everything step by step in front of you so it's easy to follow. Beware, she doesn't prepare you well for the midterms. Make sure to do the coursera exercises and you'll be fine. She says the textbook is mandatory but I never used it.",
      "One of the best profs I've ever had. I had never programmed before but found her teaching very easy to follow. Her course was also very organized. She had lots of office hours and ran on online discussion forum where you could get help. Her assignments were quite long though. This course is not overly difficult but requires you to put effort in.",
      "She's a good and honest teacher. The class is well structured and you learn a lot. She expect you to work on your own so don't ask question during classes if you didn't work at all. She gives a lot of free material you can study on and lecture are available on video in blackboard.",
      "Vida is an excellent programming prof. If you don't know the language being taught, you should attend all lectures and ask any questions you have, as she always monitors her online forum through blackboard. An easy A if you already know the language, just make sure you're familiar with recursion and string/list operations.",
      "Assignments can be tough without programming experience but they're doable. Midterms are tricky because she doesn't do much to prepare us. Make sure to do the Coursera work before the midterms and understand the exact definition and outputs of everything without testing it the code. That's the only way you'll be ok on the exams.",
      "She is a fantastic professor. Assignments are easy if you listen to all her lectures. All material including videos is posted on Blackboard, so you dont need to attend the lectures. She is very helpful and answers all questions online.",
      "She is a fantastic professor. Assignments are easy if you listen to all her lectures. All material including videos is posted on Blackboard, so you dont need to attend the lectures. She is very helpful and answers all questions online.",
      "Great prof for introduction to Java. Only thing is sometimes she skips steps leaving you lost for the rest of the lecture, although she will answer any questions with pleasure. This class is very hard to take notes in, as she has prewritten code that she explains most of the time. Assignments can be tricky, but theres an online forum she hosts",
      "Amazing teacher. Really knows her stuff. All assignments are very clearly indicated, and she is quick to reply to any ambiguity via the online forum. Does not accept lateness of submissions, and failures are failures - no exception. I found this fair."
    ]
  ],
  [
    "University of Ottawa-Hao, Qi",
    {
      "website": 1,
      "online": 1
    },
    [
      "Took her class one year ago. She is a really nice prof. She also likes to help students in any ways both study and life. Strongly recommend you take her session. She told me that she always try her best to improve her teaching. She also will reference this website to improve herself, not like some profs they don't care at all.",
      "Super nice! But difficult to understand. Nicest prof ever. textbook PDF available online, make sure you have the right version!"
    ]
  ],
  [
    "University of Ottawa-Alja'afreh, Mohammad",
    {
      "online": 1,
      "coursera": 1
    },
    [
      "I had a heavy loaded timetable and I almost failed the introduction to computing ITI1120 course. This professor inspired me and keep encouraging until I got A-. One big advice try to participate at his lecture as he memorized names properly. Also, do not forget to enroll at the online coursera offered at his brightspace; those resources helped a lo",
      "I had a heavy loaded timetable and I almost failed the introduction to computing ITI1120 course. This professor inspired me and keep encouraging until I got A-. One big advice try to participate at his lecture as he memorized names properly. Also, do not forget to enroll at the online coursera offered at his brightspace; those resources helped a lo"
    ]
  ],
  [
    "University of Ottawa-Panchapakesan, Ashwin",
    {
      "online": 1
    },
    [
      "His lectures are fun! I had no experience with coding &amp; learned quite a bit, but I strongly recommend taking advantage of his office hours! Even if you don't have a lot of questions, he's just awesome to chill with. However, I would definitely suggest taking your own notes or supplementing with online info, as his slides are not the best."
    ]
  ],
  [
    "Simon Fraser University-Dixon, Anthony",
    {
      "upload": 1,
      "online": 8,
      "website": 1
    },
    [
      "Dr. Anthony Dixon is one of the best professors. I found his lectures very useful as he worked on examples during his lectures. He explained abstract concepts in a very academic and simple way which inspired me to attend his lecture and use his notes. He uploaded his lecture notes, and he spent a lot of time in his office hours when I needed help.",
      "Good lecture notes. Audio notes are available too. There're sample tests online and quite similar to the midterm. He gives you solutions for assignments which is great. Overall he's a good decent prof in CS. The course is hard though but all CMPT courses are hard you know what I mean.",
      "It's a very hard course, but Tony realizes this and does his best to help every student get a good grade. Many profs at SFU pride themselves in making it difficult to get a good grade, but not this prof - he puts many sample exams online to practice on (and the exams are usually very similar) - he makes audio recordings available and all notes too.",
      "Keys to be successful in this course: 1)find a good group mate 2)read the all the notes(every single line) that he posted online! 3)must understand each assignment in order to pass this course",
      "Very friendly and helpful instructor. The difficulty of this course heavily depends on whether or not you regularly go to his office. He posts online notes and audio recordings of each lecture. Tests are hard but not unreasonable. Assignments are easy if you start them early and attend to labs. Everything in the course is well organized.",
      "Barely opened the textbook & never missed a lecture, because his lectures & online class notes are clear, organized, and all you need to know. Assignments were long, but fun & informative. Very helpful, considerate, & thorough when asked questions in person or via email. Warning: he makes typos, so if you think you're right, speak up.",
      "Gives thorough lectures, and gave weekly lecture summaries online. I thought the tests, and assignments were fair.",
      "Good prof, but be prepared if you're taking CMPT 150 or 250 with Dixon; assignments are EXTREMELY difficult and will take many hours (or days!) to complete. Exams are decent. Notes are really great, but he doesn't post them online so go to class! He is very helpful and often stays after class to answer students' questions.",
      "Notes are well organized. Lectures are clear, although it seems boring.(Notes are posted online later) There's a lot to learn in the class, but parts of the assignments are disappointly HARD! Mixed feelings - The prof is great, but again the marks, ...",
      "He is so elegant that can't be described in words. Not only is he a great professor, he is a real man that hardly can be found in our era. He is always glad to help and never let students to be disappointed. He posts his neatly prepared lecture notes on the website. He is really a gret SENIOR LECTURER as his title specifies."
    ]
  ],
  [
    "Simon Fraser University-Cukierman, Diana",
    {
      "online": 4,
      "website": 1
    },
    [
      "I am surprised to see why doesn't have a rating of 4.5+. She teaches in an excellent manner that really makes you understand how your code works. No question is a stupid question in her class, she welcomes extra inquiries and slowly goes over anything you do not understand. She waits outside the class for some time if you have any quick questions. Her notes are organized and she posts the annotated notes online after the class (bless her!). Read over the notes before quiz/test and understand all the iClicker questions and the concepts. That's all you need to good on the exam. Don't forget to practice a lot. There are some websites that let you practice your python skills. She lets you use generous amounts of cheat-sheets so do not stress the exams. Remember Practice is all you need to get A+ in this course.",
      "I am surprised to see why doesn't have a rating of 4.5+. She teaches in an excellent manner that really makes you understand how your code works. No question is a stupid question in her class, she welcomes extra inquiries and slowly goes over anything you do not understand. She waits outside the class for some time if you have any quick questions. Her notes are organized and she posts the annotated notes online after the class (bless her!). Read over the notes before quiz/test and understand all the iClicker questions and the concepts. That's all you need to good on the exam. Don't forget to practice a lot. There are some websites that let you practice your python skills. She lets you use generous amounts of cheat-sheets so do not stress the exams. Remember Practice is all you need to get A+ in this course.",
      "Diana is a great ComSci prof! Lectures were very clear and easy to understand,even though it is quite clear English is probably not her first language. Every assignment was quite interesting, and the online Peerwise system was a good tool for learning from classmates. Great help was always available in her office hours. TA's however were not great.",
      "Super nice prof, really has enthusiasm for the course & cares about her students. Some concepts she explains very well using slides, diagrams, human model examples, etc. At other times her explanations can lack clarity. Course may be hard to people who have no programming background, since free online textbook can be vague",
      "BEST CS prof imo. Allows cheat sheet, excellent online notes, great explainations, care for students, replies quick to emails. Learned ALOT from her. 2 long projects in semester, and most labs are 'exploratory'. You can partner up with a buddy to split the work for the project. MT and Final were fairly long, but really easy if you can do projects."
    ]
  ],
  [
    "Simon Fraser University-Chan, Bobby",
    {
      "upload": 1
    },
    [
      "Nice clear prof! I really wished he'd upload his notes though."
    ]
  ],
  [
    "Simon Fraser University-Fraser, Brian",
    {
      "video": 1
    },
    [
      "Good guy, gives videos to help with assignments that are pretty easy for what you should know at this level. Only complaint is he scales up how much you need for a decent grade by quite a bit so be confident that you can get at least 80% if you want something that won't break your GPA. Also check you can run android studio it is a memory hog."
    ]
  ],
  [
    "Simon Fraser University-Vaughan, Richard",
    {
      "online": 2
    },
    [
      "Excellent professor. He teaches this course like no other course is taught at SFU. I highly recommend it, with him, if you are smart, hard working, and willing to learn. He doesn't hold your hand, and you will have to learn some things on your own), but we're not here to learn online tutorial material. Theory and experience is why we're here.",
      "Very decent. Passionate about the subject he is teaching. Concise explanations and nice British accent. Posts slides online. Midterm was 100% textbook questions, final was 40% textbook questions; difficulty is fair to hard. HW can be challenging. Takes him FOREVER to mark assignments--very thorough about checking for copied HW."
    ]
  ],
  [
    "Simon Fraser University-Stewart, Colin",
    {
      "online": 1
    },
    [
      "I took this course as a GPA booster and indeed my GPA went up (I had previous experience with xhtml/css). His final exam however was a KILLER (for most students). The final question required full understanding of python: we were required to build an online shopping cart. The material was covered... but the last question was too damn long!"
    ]
  ],
  [
    "Simon Fraser University-Tien, Geoffrey",
    {
      "online": 1
    },
    [
      "Geoff delivers good lectures and is helpful in his office hours. His assignments are above average difficulty (compared to John Edgar's which are viewable online). His exams are quite difficult and he gives you no way to prepare for them. Overall, he teaches well with kind of hard assignments, but asks unreasonably difficult questions on the exam."
    ]
  ],
  [
    "Simon Fraser University-Hell, Pavol",
    {
      "online": 1
    },
    [
      "He is the best prof that fits in what I believe to be the best way to learn and be tested. He gives clear lectures which his exams are all based on them and the homework. Even he was old school using paper and pen in class, but he is the only one prof that I have taken who uses the recording system for us to review his lectures online. Take him!!!"
    ]
  ],
  [
    "Simon Fraser University-Kabanets, Valentine",
    {
      "online": 2
    },
    [
      "Good prof and hard course. Notes posted online doesn't help much. Careful when you want to get this course.",
      "Great prof, very nice, open to feedback and suggestions. Interesting and interactive lectures. Exams aren't a slam dunk, but are mostly applying the same techniques from lectures and assignments to different flavored problems. Grades curved reasonably. Notes posted online, you're missing out on the useful examples and diagrams if you skip though."
    ]
  ],
  [
    "Simon Fraser University-Shinkar, Igor",
    {
      "online": 1
    },
    [
      "Professor Shinkar doesn't post solutions for practice questions and assignments. If you are not good at coding, avoid him. He covered a lot in CMPT125. The final exam was very difficult. Many questions ask for writing code in C. But you will learn a lot from his lecture and his lecture is interesting. He always replies emails and questions online."
    ]
  ],
  [
    "Simon Fraser University-Hibbitts, Paul",
    {
      "online": 1
    },
    [
      "Paul is one of the best professors at SFU. He not only lectures, but also actively works in the industry. He has a highly modern teaching style & seems to genuinely care about his students. He is polite, professional & is always available. All readings are (free) online, group project is big but allows you to pick your own groups & grade your peers"
    ]
  ],
  [
    "Simon Fraser University-Khosravi, Hassan",
    {
      "online": 1
    },
    [
      "He knows the material well and does a good job of teaching it. He was using some of the material from the online Stanford course which I thought was clever. Totally recommend taking 354 with him."
    ]
  ],
  [
    "Simon Fraser University-Sarkar, Anoop",
    {
      "website": 2,
      "online": 1
    },
    [
      "Anoop is definitely one of the best in CS at SFU. Classes are clear, the materials on the course website clearer! The assignments are tough, but absolutely helpful. The test framework and the leaderboard helps a lot. Project is really interesting. He cares for the subject. And his comic gestures are a cherry on the top. Do take the course.",
      "Anoop is one of the best at SFU. His course website is great with very clear pdfs of his slides. Assignments are very well organized. He provides a test framework which helps a lot in trying to solve them. Very personable guy with a good sense of humor.",
      "Great instructor, but teaches difficult courses. Updates class notes online regularly. Not necessary to attend class, but will certainly help. Easy to understand."
    ]
  ],
  [
    "Simon Fraser University-Donaldson, Toby",
    {
      "online": 2,
      "website": 1
    },
    [
      "Very nice prof, will take his course again. The assignments are not easy but really help you to understand. Notes are online and everything are base on the notes.",
      "His lectures were interesting, and his assignments were well related to the material that he taught. His midterm and final were fair, completely based on the notes for his class. Didn't use the textbook much, just read his notes on his website. If you had to take this class, take it with him!",
      "Excellent Prof. His online notes are awesome! Just study those thoroughly. His assignments are super fun. They are like puzzles and are about the right difficulty. Highly recommend this prof for CMPT 383!!"
    ]
  ],
  [
    "Simon Fraser University-Ergun, Funda",
    {
      "online": 1
    },
    [
      "I enjoyed Funda's class, she's got a great sense of humour. Assignments and tests are both fair, imo (plus the class is always curved). Teaches from textbook-based slides that are posted online. My only gripes are that she can be a tad disorganized and her wording on assignments can be vague at times."
    ]
  ],
  [
    "Simon Fraser University-Kristjanson, Scott",
    {
      "online": 1
    },
    [
      "Not the most clear instructor, but puts his lecture slides online which helps. Very respondent to emails, and helpful in office hours. He also gives \"hints\" as to what will be on the exam and more or less tells you how to do the projects. I recommend him!"
    ]
  ],
  [
    "Simon Fraser University-Makonin, Stephen",
    {
      "video": 1,
      "youtube": 1,
      "upload": 1
    },
    [
      "It's a really helpful course of basic HTMLCSS knowledge and skill. And Stephen is doing really well as a new teacher here. All HTMLCSS video casts are uploaded on Youtube which is extremely helpful. Python is a little bit tough, but he will give you many resources to guide you learn yourselves. Nice professor, excellent course, highly recommanded",
      "It's a really helpful course of basic HTMLCSS knowledge and skill. And Stephen is doing really well as a new teacher here. All HTMLCSS video casts are uploaded on Youtube which is extremely helpful. Python is a little bit tough, but he will give you many resources to guide you learn yourselves. Nice professor, excellent course, highly recommanded",
      "It's a really helpful course of basic HTMLCSS knowledge and skill. And Stephen is doing really well as a new teacher here. All HTMLCSS video casts are uploaded on Youtube which is extremely helpful. Python is a little bit tough, but he will give you many resources to guide you learn yourselves. Nice professor, excellent course, highly recommanded"
    ]
  ]
]